[
  {
    "title": "Creative Tech | QA Automation",
    "company": "Devoteam",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "iOS, Git, Selenium, Playwright, Cypress, Java, JavaScript, SQL, PostgreSQL",
    "description": "At Devoteam, we believe that technology with strong human values can actively drive change for the better. Discover how Tech for People unlocks the future, creating a positive impact on the people and the world around us. We are a global leading player in Digital Transformation for leading organisations across EMEA, with a revenue of €1B. We believe in transforming technology to create value for our clients, partners and employees in a world where technology is developed for people. We are proud of the culture we have built together. We are proud of our people at the service of technology. We are proud of our diverse environment. Because we are #TechforPeople. Join our multidisciplinary team of Cloud experts, Designers, Business consultants, Security experts, Engineers, Developers and other extraordinary talents, spread across more than 20 EMEA countries. Become one of our +10.000 tech and business leaders on cloud, data and cyber security. Let’s fuse creativity with technology together and build innovative solutions that actively change things for the better.\n\n### Job Description\n\n* Collaborate closely with the product team (functional tester, PO, Dev);\n* Design, develop, and maintain automated test scripts to validate functionality, performance, and security aspects of software applications;\n* Implement and enhance automated test frameworks to improve test efficiency and coverage;\n* Collaborate with the development team to integrate automated testing into the continuous integration/continuous deployment (CI/CD) pipeline;\n* Contribute to the creation and maintenance of test data, ensuring realistic and diverse scenarios are covered;\n* Execute automated test scripts and analyze results to identify defects, performance issues, and areas for improvement;\n* Report and track defects using designated tools, providing detailed information for developers to facilitate efficient issue resolution;\n* Collaborate with the development team to verify bug fixes and ensure the successful closure of reported issues;\n* Create and maintain documentation related to automated test scripts, frameworks, and testing processes;\n* Provide training and support to team members on test automation best practices.\n\n### Qualifications\n\nHard Skills:\n\n* At least 3 years of experience testing digital products.\n* Solid technical background in software development and testing principles.\n* Proven experience as an Automation Tester.\n* Autonomous in developing automated test projects.\n* Proficient in developing, maintaining, and executing automated tests for both BE and FE.\n* Comfortable with technologies such as: Java, JavaScript, Angular, and PostgreSQL.\n* Experience in web automation (Cypress and Playwright preferred, Selenium a plus) and API testing.\n\n* Dynamic and a fast learner.\n* Autonomous with strong prioritization skills.\n* Collaborative with product teams (Functional QA, PO, Dev).\n* Good communication skills in Portuguese and English.\n* Team player.\n\n### Additional Information\n\nThe Devoteam Group works for equal opportunities, promoting its employees based on merit and actively fights against all forms of discrimination. We are convinced that diversity contributes to the creativity, dynamism and excellence of our organization. All of our vacancies are open to people with disabilities.\n\n### Job Location",
    "apply_link": "https://jobs.smartrecruiters.com/Devoteam/744000102057650",
    "published_date": "January 9, 2026"
  },
  {
    "title": "Middle AQA Engineer (Playwright / TypeScript)",
    "company": "TechMagic",
    "country": "Ukraine, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "TechMagic is looking for Middle AQA Engineer (Playwright / TypeScript)",
    "apply_link": "https://techmagic.talentlyft.com/o/cf6sagN",
    "published_date": "January 8, 2026"
  },
  {
    "title": "Software QA Engineer Intern",
    "company": "Vimachem",
    "country": "Greece, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Vimachem is looking for Software QA Engineer Intern",
    "apply_link": "https://vimachem.recruitee.com/o/software-qa-engineer-intern",
    "published_date": "January 8, 2026"
  },
  {
    "title": "Localisation QA Test Lead",
    "company": "PlayStation",
    "country": "United Kingdom, Europe",
    "salary": "Undisclosed",
    "tags": "iOS, Game",
    "description": "**Why PlayStation?**\n\nPlayStation isn’t just the Best Place to Play — it’s also the Best Place to Work. Today, we’re recognized as a global leader in entertainment producing The PlayStation family of products and services including PlayStation®5, PlayStation®4, PlayStation®VR, PlayStation®Plus, acclaimed PlayStation software titles from PlayStation Studios, and more.\n\nPlayStation also strives to create an inclusive environment that empowers employees and embraces diversity. We welcome and encourage everyone who has a passion and curiosity for innovation, technology, and play to explore our open positions and join our growing global team.\n\nThe PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Group Corporation.\n\n**Role overview:**\n\nThe Localisation Test Lead is responsible for managing the Localisation Testing of products within PlayStation Studios.\n\nYou’ll bring your experience and skills in the Localisation QA space to our team and in return you’ll have the opportunity to work on the biggest and best games. You will work on ground-breaking hardware and video games within a large multicultural, global team; helping us drive and build the future of games & games testing.\n\n**What you’ll be doing:**\n\n* Own the creation and communication of test plans for assigned products to Test teams, production, and global stakeholders\n* Communicate with producers and global stakeholders, ensuring they are kept up to date with testing progress and title status\n* Create and implement appropriate resource plans, including vendors, and supporting Test Managers in generating title budgets\n* Manage global Test teams, including onsite testing staff and vendors, for assigned products\n* Provide day to day direction, support, and guidance to Test teams\n* Maintain excellent knowledge of QA services both current and emerging\n* Collaborate with peer group and global teams to promote knowledge sharing and the cultivation of innovation within PlayStation Studios QA\n* Gather feedback and data to build and facilitate global facing retrospectives, new services, strategies, and tools\n* Maintaining, developing, and promoting knowledge in the field of quality assurance through attendance at training courses and self-directed learning\n\n**What we are looking for:**\n\n* Ability to manage multiple tasks/projects at once\n* Extensive knowledge and practical expertise in quality assurance/software testing\n* Quality assurance and quality control techniques, methodologies, and practices\n* Understanding Test Strategy and Resource Management\n* Lead and manage remote teams through global communication\n* Communicate clearly with internal and external customers globally\n* Expertise in cross-cultural business and remote team interaction\n* Demonstrated knowledge of defect tracking systems and web-based database utilisation\n* Demonstrated experience with building and managing effective teams\n\n**Nice to have:**\n\n* Knowledge of the localisation industry\n* Previous experience within a QA Operations environment\n* Successfully shipped global titles on current generation platforms\n* ISTQB Foundation level qualification or higher\n* ITIL certification\n* Project Management accreditation\n* Experience in organisational change and conflict resolution\n* Proficiency in another language\n\n**Benefits:**\n\n* 25 days holiday per year\n* Flexitime working (where approved)\n* Free car parking facilities\n* On Site Gym\n* Subsidised Café\n* On site bar\n* Access to cycle garage and showers\n\nPlease note, Sony Interactive Entertainment conducts background checks at the offer stage for all new employees (which may include criminal background checks for some roles) and will need to process personal information to support these checks.\n\n**Equal Opportunity Statement:**\n\nSony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to gender (including gender identity, gender expression and gender reassignment), race (including colour, nationality, ethnic or national origin), religion or belief, marital or civil partnership status, disability, age, sexual orientation, pregnancy, maternity or parental status, trade union membership or membership in any other legally protected category.\n\nWe strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.\n\nPlayStation is a Fair Chance employer and qualified applicants with arrest and conviction records will be considered for employment.",
    "apply_link": "https://job-boards.greenhouse.io/sonyinteractiveentertainmentglobal/jobs/5734030004",
    "published_date": "January 7, 2026"
  },
  {
    "title": "Senior Site Reliability Engineer (Node.js & QA), Trading Technologies",
    "company": "Binance",
    "country": "Romania, Bulgaria, Argentina, Czech Republic, Greece, Portugal, Hungary, Europe",
    "salary": "Undisclosed",
    "tags": "Kubernetes, Android, Microservices, Docker",
    "description": "Binance is looking for Senior Site Reliability Engineer (Node.js & QA), Trading Technologies",
    "apply_link": "https://jobs.lever.co/binance/7943cc80-5a16-4aaa-852f-95fc683097ab",
    "published_date": "January 7, 2026"
  },
  {
    "title": "Creative Tech | Tech Lead QA Engineer",
    "company": "Devoteam",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "Git, Selenium, Playwright, Cypress, PyTest, Allure, Cucumber, Java, Python, JavaScript, TypeScript",
    "description": "At Devoteam, we believe that technology with strong human values can actively drive change for the better. Discover how Tech for People unlocks the future, creating a positive impact on the people and the world around us. We are a global leading player in Digital Transformation for leading organisations across EMEA, with a revenue of €1B. We believe in transforming technology to create value for our clients, partners and employees in a world where technology is developed for people. We are proud of the culture we have built together. We are proud of our people at the service of technology. We are proud of our diverse environment. Because we are #TechforPeople. Join our multidisciplinary team of Cloud experts, Designers, Business consultants, Security experts, Engineers, Developers and other extraordinary talents, spread across more than 20 EMEA countries. Become one of our +10.000 tech and business leaders on cloud, data and cyber security. Let’s fuse creativity with technology together and build innovative solutions that actively change things for the better.\n\n### Job Description\n\n* Collaborate closely with developers, product owners, and other QA team members to define test strategies and improve overall testing efficiency;\n* Design, implement, and execute automated and manual tests to ensure software quality across multiple projects;\n* Strategically apply various test types (Unit, Component, Integration, System, Regression, Smoke, and Performance) throughout the Agile/Scrum sprint cycle;\n* Develop, implement, and maintain robust automated test frameworks using tools such as Playwright, Selenium, Cypress, Gherkin (Cucumber), Pytest, or Capybara;\n* Conduct both functional and non-functional testing (including performance, usability, security, and scalability);\n* Produce and analyze test reports using tools like Allure Reports or equivalent, providing actionable insights on test coverage, defect trends, and software quality.\n\n### Qualifications\n\n* Bachelor's degree in Computer Science, Information Technology, or a related field (or equivalent work experience);\n* Proven track record as a QA Automation Engineer with hands-on experience across different test types and frameworks;\n* Strong technical leadership experience, preferably as a Tech Lead or similar position;\n* Deep knowledge of test automation technologies, including Playwright, Selenium, Cypress, Gherkin (Cucumber), Pytest, or Capybara;\n* Deep understanding of Unit, Component, Integration, System, Regression, Smoke, and Performance testing;\n* Strong background in object-oriented programming using JavaScript, TypeScript, Java, C#, or Python for automation script development;\n* Solid knowledge of testing methodologies and practical experience in performance, usability, security, and scalability testing;\n* Skilled in generating and interpreting test results and quality metrics using tools such as Allure Reports or similar reporting solutions;\n* Experience working in Agile/Scrum environments, applying testing best practices within sprint cycles.\n\n### Additional Information\n\nThe Devoteam Group works for equal opportunities, promoting its employees based on merit and actively fights against all forms of discrimination. We are convinced that diversity contributes to the creativity, dynamism and excellence of our organization. All of our vacancies are open to people with disabilities.\n\n### Job Location",
    "apply_link": "https://jobs.smartrecruiters.com/Devoteam/744000101669017",
    "published_date": "January 7, 2026"
  },
  {
    "title": "n8n Automation Engineer – Client Facing Role",
    "company": "The Growth Partner",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "Git, GitHub, Java, JavaScript, LLM",
    "description": "#### About AI Acquisition\n\nAI Acquisition is a global AI consulting and enablement platform helping founders, agencies, and businesses design, launch, and scale AI-powered services. We operate a hybrid model combining Platform-as-a-Service (PaaS), consulting, and execution—supporting clients across the US and globally.\n\n**design systems** **implement automation** **operate scalable workflows**\n\n#### Why Join AI Acquisition?\n\n* Work hands-on withreal client systems, not internal-only tooling\n* Buildproduction-grade n8n workflowsused daily by founders and operators\n* Be client-facing: influence outcomes, not just infrastructure\n* Operate in a fast-moving, high-ownership environment\n* Expand your skills acrossautomation, APIs, AI, and solution design\n\n**building, explaining, troubleshooting, and evolving systems with clients live**\n\n#### The Role\n\n**technical n8n Automation Engineer** **building complex workflows** **working directly with clients**\n\nYou will:\n\n* Design and maintain n8n workflows\n* Support clients throughdaily technical drop-in sessions\n* Run client calls to understand requirements, debug issues, and guide implementation\n* Act as a bridge betweentechnical systems and non-technical founders\n\n**hands-on automation** **human interaction**\n\nYou’ll report into Delivery / Client Operations and work closely with consultants and operators.\n\n#### What You’ll Do\n\n#### Workflow Engineering (Core Responsibility)\n\n* Build, optimize, and maintainn8n workflowsfor automation across sales, operations, onboarding, and internal processes\n* Debug, refactor, and scale workflows for reliability and performance\n* Write and maintainJavaScript / Code nodeswithin n8n\n* Ensure workflows are production-ready, documented, and reusable\n\n#### Client-Facing Technical Enablement\n\n* Rundaily technical drop-in sessionswith clients (live troubleshooting, guidance, and implementation support)\n* Join client calls to:\n* Understand automation needs\n* Translate business logic into workflows\n* Explain how systems work in clear, non-jargon language\n* Provide calm, structured support to less-technical founders and operators\n\n#### Systems & Integrations\n\n* Integrate n8n with tools such as:\n* CRMs, Airtable, Google Sheets\n* APIs (internal and third-party)\n* Webhooks, databases, and SaaS tools\n* Design workflows that handle:\n* Data ingestion\n* Enrichment\n* Syncing between platforms\n* Trigger-based and scheduled automations\n\n#### Collaboration & Continuous Improvement\n\n* Work closely with consultants, delivery leads, and operations teams\n* Identify recurring client issues and convert them intoscalable workflow solutions\n* Improve documentation, templates, and standard workflows\n* Proactively suggest improvements to systems and client experience\n\n### Requirements\n\n#### Technical Skills\n\n* Strong hands-on experience withn8n(required)\n* Solid understanding ofautomation logic, APIs, and webhooks\n* Ability to write and debugJavaScriptwithin automation tools\n* Experience building workflows that run reliably at scale\n* Comfort working across multiple tools and systems\n\n#### Client & Communication Skills\n\n* Comfortable runningclient-facing calls\n* Able to explain technical concepts in a clear, structured way\n* Confident guiding clients through setup, troubleshooting, and best practices\n* Calm, professional, and solutions-oriented when issues arise\n\n#### Working Style\n\n* High ownership and accountability\n* Comfortable working independently in a fast-moving environment\n* Organized, reliable, and proactive\n* Enjoys problem-solving and continuous learning\n\n#### Nice to Have (Not Required)\n\n* Experience with Airtable, CRMs, or data-heavy workflows\n* Exposure to AI/LLM integrations\n* Background in consulting, solutions engineering, or technical support\n* Experience supporting founders or non-technical clients\n\n### Benefits\n\n#### How to Apply\n\nPlease submit:\n\n* Your CV\n* Examples ofn8n workflowsyou’ve built (screenshots, explanations, or demos are fine)\n* Optional: GitHub, Loom walkthroughs, or documentation samples\n\n**how you think, build, and communicate**",
    "apply_link": "https://apply.workable.com/ai-acquisition/j/88C1111FD2",
    "published_date": "January 6, 2026"
  },
  {
    "title": "Junior QA Engineer",
    "company": "Veeam Software",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "AWS",
    "description": "Veeam, the #1 global market leader in data resilience, believes businesses should control all their data whenever and wherever they need it. Veeam provides data resilience through data backup, data recovery, data portability, data security, and data intelligence. Based in Seattle, Veeam protects over 550,000 customers worldwide who trust Veeam to keep their businesses running. Join us as we move forward together, growing, learning, and making a real impact for some of the world’s biggest brands. The future of data resilience is here - go fearlessly forward with us.\n\n##### About the Role\n\nThe Veeam Quality Assurance team invites you to work on Veeam products with Veeam QA professionals in the Warsaw R&D office. QA has the power to breathe life into our products. Testers are always at the center of the action: developing an idea, thinking through the functionality, and conducting a thousand complex experiments is all easy, and this is not the limit. The goal of QA is a quality product and millions of happy users confident that “Veeam just works.”\n\n##### What You’ll Do\n\n* “Deep diving” into our products, technology and profession\n* Analysing software requirements\n* Testing one or several Veeam products\n* Communicating with other participants of the product development process\n* Evaluating test results, maintaining defects database\n\n##### What You’ll Bring\n\n* Technical education or passion for technology\n* 1 year of experience in system administration, software testing, or networking\n* Looking for your first job in IT or already working as a test engineer, software developer or system administrator\n* Willing to grow professionally in the software testing field\n* Advanced knowledge of Windows or Linux operating systems\n* Understanding of network technologies and systems (DNS, DHCP, basic network settings, etc.)\n* Curious, attentive and tend to note flaws in everything around you\n* An open-minded person with common sense and clear logic\n* A fast learner (passionate eyes outweigh knowledge gaps) and you love interesting and challenging tasks\n* English proficiency for daily communication within international teams\n\n##### What You’ll Get\n\n* 26 paid days off annually, plus 3 global VeeaMe Days for self-care and paid volunteer time\n* Paid parental, maternity, andpaternity leave\n* Fully covered family medical plan, dental, rehab, and vaccinations\n* Life, critical illness, and disability insurance\n* Employer pension contribution via PPK\n* Monthly Edenred allowance of 450 PLN for meals\n* MultiSport card fully covered by Veeam, giving access to sports facilities nationwide\n* Six free therapy sessions, plus legal and financial advice\n* Professional training and education, including courses and workshops, internal meetups, and unlimited access to our online learning platforms (LinkedIn Learning, Athena, O’Reilly) and mentoring through our MentorLab program\n\n**Please note:**\n\nPlease note that any personal data collected from you during the recruitment process will be processed in accordance with ourRecruiting Privacy Notice.\n\nThe Privacy Notice sets out the basis on which the personal data collected from you, or that you provide to us, will be processed by us in connection with our recruitment processes.\n\nBy applying for this position, you consent to the processing of your personal data in accordance with ourRecruiting Privacy Notice.\n\nBy submitting your application, you acknowledge that the information provided in your job application and any supporting documents is complete and accurate to the best of your knowledge. Any misrepresentation, omission, or falsification of information may result in disqualification from consideration for employment or, if discovered after employment begins, termination of employment.",
    "apply_link": "https://boards.greenhouse.io/veeamsoftware/jobs/4745532101",
    "published_date": "January 6, 2026"
  },
  {
    "title": "QA Engineer, niemiecki",
    "company": "Wavestone",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Wavestone is looking for QA Engineer, niemiecki",
    "apply_link": "https://wavestone.softgarden.io/job/61319052/QA-Engineer-z-j%C4%99zykiem-niemieckim?jobDbPVId=258786254&l=en",
    "published_date": "January 6, 2026"
  },
  {
    "title": "n8n Developer, Automation Developer",
    "company": "Powerprozesse GmbH",
    "country": "Germany, Europe",
    "salary": "€4,000 - €5,500",
    "tags": "Git, Java, Python, JavaScript",
    "description": "* Zurück zur Karriereseite\n\n* Zurück zur Karriereseite\n\n* Standort flexibel\n* Worms,Rheinland-Pfalz,Deutschland\n* Worms,Rheinland-Pfalz,Deutschland\n* 4.000 € - 5.500 € pro Monat\n* Softwareentwicklung\n\n### Jobbeschreibung\n\nDu hast Erfahrung mit digitalen Themen und kennst dich mit der Low-Code-Lösung n8n aus – oder bist in der Lage, dich schnell und eigenständig einzuarbeiten? Dann ist unser Stelle im Bereich Softwareentwickung genau das richtige für dich.\n\nAls n8n-Entwickler (m/w/d) gestaltest und automatisierst du unsere Prozesse. Du sorgst dafür, dass Systeme ineinandergreifen, Datenflüsse reibungslos funktionieren und unsere Abläufe noch effizienter werden.\n\n**Aufgabengebiete:**\n\n* Automatisierung unserer Geschäftsprozesse mit n8n\n* Aufbau, Pflege und Verwaltung von Airtable-Datenbanken\n\nAutomatisierung unserer Geschäftsprozesse mit n8n\n\nAufbau, Pflege und Verwaltung von Airtable-Datenbanken\n\n* Planung, Umsetzung und Implementierung von neuen Geschäftsprozessen\n* Dokumentation & Konzeption von digitalen Geschäftsprozessen\n* Anwenderschulung & -betreuung\n\nPlanung, Umsetzung und Implementierung von neuen Geschäftsprozessen\n\nDokumentation & Konzeption von digitalen Geschäftsprozessen\n\nAnwenderschulung & -betreuung\n\n**Über Powerprozesse :**\n\nWir bei Powerprozesse arbeiten jeden Tag gemeinsam daran, die erfolgreichste Digitale Prozessagentur in Deutschland zu werden. Zunächst konzentrieren wir uns vor allem auf die\n**Digitalisierung & Automatisierung von Hausverwaltungen** , werden aber langfristig unseren Fokus auch auf andere Branchen erweitern. Bei uns arbeitest du\n**100% REMOTE** – du kannst uns aber gerne in unserem Büro in Worms besuchen oder uns auf Teamevents in Deutschland oder Europa kennenlernen.\n\nDu bist bei uns richtig, wenn du nicht nur den “Freiheitspart” einer Remote-Stelle genießen willst, sondern Lust hast anzupacken und langfristig mit uns zu wachsen. Wenn du also Lust auf einen tollen Job im Bereich Automatisierung & KI hast, freuen wir uns sehr auf deine Bewerbung!\n\nWeitere Informationen zu unserem Unternehmen findest du auf www.powerprozesse.de.\n\n**Gehalt: 4.000 bis 5.500 Euro pro Monat (brutto)** Weiterentwicklungs- und Aufstiegsmöglichkeiten in den nächsten Jahren sind vorhanden.\n\n**Wir bieten dir:**\n\n* 100% Remote Arbeit: Arbeite von überall in Deutschland aus, ggf. sogar innerhalb von Europa\n* Sicherer Arbeitsplatz:Jede Person, die wir einstellen, soll langfristig mit uns wachsen. Das Ziel jeder Einstellung ist eine unbefristete Übernahme.\n* Gute Vergütung & Karrierechancen:Über die nächsten Jahre werden wir weiter wachsen und expandieren. Dazu benötigen wir weitere Experten und/oder Führungskräfte.\n* Zukunftssicheres Themengebiet:Wie du weißt, haben die Themen KI & Automatisierung in den letzten Jahren stark an Bedeutung gewonnen. Gerade in wirtschaftlich schwierigen Zeiten ist Effizienz durch smarte Automatisierungslösungen gefragter denn je und Fachkräfte in diesem Bereich werden überall gebraucht – Jobsicherheit garantiert.\n* ETF-Betriebsrente mit 50 Euro Zuschuss pro Monat\n* 30 Urlaubstage\n* Flexible Arbeitszeiten\n\n**100% Remote Arbeit** : Arbeite von überall in Deutschland aus, ggf. sogar innerhalb von Europa\n\n**Sicherer Arbeitsplatz:** Jede Person, die wir einstellen, soll langfristig mit uns wachsen. Das Ziel jeder Einstellung ist eine unbefristete Übernahme.\n\n**Gute Vergütung & Karrierechancen:** Über die nächsten Jahre werden wir weiter wachsen und expandieren. Dazu benötigen wir weitere Experten und/oder Führungskräfte.\n\n**Zukunftssicheres Themengebiet:** Wie du weißt, haben die Themen KI & Automatisierung in den letzten Jahren stark an Bedeutung gewonnen. Gerade in wirtschaftlich schwierigen Zeiten ist Effizienz durch smarte Automatisierungslösungen gefragter denn je und Fachkräfte in diesem Bereich werden überall gebraucht – Jobsicherheit garantiert.\n\n**ETF-Betriebsrente mit 50 Euro Zuschuss pro Monat**\n\n**30 Urlaubstage**\n\n**Flexible Arbeitszeiten**\n\n### Stellenanforderungen\n\n* abgeschlossenes Wirtschaftsinformatik- / Informatikstudium, Fachinformatiker-Ausbildung oder Programmierkenntnisse\n* Technisches Verständnis & Problemlösungskompetenz\n* Guter Umgang mit Leistungsdruck\n* Schnelle Auffassungsgabe & disziplinierte Arbeitsweise\n* Solide Englischkenntnisse, für die unkomplizierte Kommunikation im Team\n* Wohnort in Deutschland oder in einer Zeitzone mit maximal ±2 Stunden Unterschied zu GMT+2\n* Vorkenntnisse mit Tools wie n8n,Make.comoder Zapier sind von Vorteil, aber nicht notwendig\n* Auch Programmierkenntnisse z.b. mit JavaScript oder Python sind von Vorteil, aber nicht notwendig\n\nabgeschlossenes Wirtschaftsinformatik- / Informatikstudium, Fachinformatiker-Ausbildung oder Programmierkenntnisse\n\nTechnisches Verständnis & Problemlösungskompetenz\n\nGuter Umgang mit Leistungsdruck\n\nSchnelle Auffassungsgabe & disziplinierte Arbeitsweise\n\nSolide Englischkenntnisse, für die unkomplizierte Kommunikation im Team\n\nWohnort in Deutschland oder in einer Zeitzone mit maximal ±2 Stunden Unterschied zu GMT+2\n\nVorkenntnisse mit Tools wie n8n,\noder Zapier sind von Vorteil, aber nicht notwendig\n\nAuch Programmierkenntnisse z.b. mit JavaScript oder Python sind von Vorteil, aber nicht notwendig\n\noder\n\nBitte geben Sie Ihre Kontaktdaten an\n\n* International\n* AfghanistanAfghanistan\n\nLebenslauf hochladen\n\nLaden Sie Ihr Anschreiben hoch\n\n*\n\n#### Alles erledigt!\n\nIhre Bewerbung wurde eingesendet!",
    "apply_link": "https://powerprozesse.recruitee.com/o/n8n-developer-automation-developer-mwd-100-remote-29",
    "published_date": "January 6, 2026"
  },
  {
    "title": "Quality Assurance Engineer",
    "company": "PROLOGA GmbH",
    "country": "Germany, Europe",
    "salary": "Undisclosed",
    "tags": "Selenium, RSpec",
    "description": "**100% remote within Germany** **Halle/ Leipzig, Oldenburg, and Walldorf**\n\n**experience as a** **Quality Assurance Engineer (m/f/d)** **SAP modules, integration points, and typical business processes** **SAP TAO/TAF,** **Tricentis Tosca, Selenium** **software development life cycles and agile methodologies** **performance testing and security testing** **SAP environments**\n\nShaping the future together: secure, sustainable, and full of opportunities!\n\nWhat defines a PROLOGIAN?Team spirit, creative freedom, and the drive to use technology to make a real difference. We are passionate about smart solutions that deliver true environmental benefits – and we believe that enthusiasm is an essential part of the journey.\n\nAt PROLOGA, you’ll find a job with purpose and impact: we develop software that makes our world a little cleaner. Zero Emissions is our goal – and maybe soon yours too?\n\nWe’ve been successful in the market for over 20 years, are a trusted SAP partner – and we’re still growing. For you, this meansfreedom to create, exciting perspectives, and plenty of room to grow together and bring your strengths to the table.\n\nWhat else you can expect at PROLOGA:\n\n•Flexible working hoursand the option to work remotely. Our doors in Halle, Leipzig, Oldenburg, and Walldorf are always open to you! So if you are looking for direct exchange or simply want to enjoy the office atmosphere, you are more than welcome.\n\n•Regular team meetings, events, and celebrations.\n\n•Choose your device: Mac or Windows – you decide what works best for you.\nJobRad bike leasing.• Structured onboarding & personalized training opportunities.• Volleyball court, sports groups & summer barbecues as well as summer and Christmas parties.• Dog-friendly offices.• With our PROLOGA benefits portal, you can access discounts and special offers from over 1,000 partners - from restaurants and fashion to travel and leisure activities.• Sports and team events as well as summer and Christmas parties.\n\n…and that’s just the beginning!\n\nReady for a job that truly makes a difference?Join PROLOGA – where tech meets purpose.",
    "apply_link": "https://prologa-1.jobs.personio.com/job/2475561?language=en",
    "published_date": "January 6, 2026"
  },
  {
    "title": "QA Engineer, język niemiecki",
    "company": "Komatsu Poland Sp. z o.o.",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Komatsu Poland Sp. z o.o. is looking for QA Engineer, język niemiecki",
    "apply_link": "https://poland-wavestone-career.softgarden.io/job/61319047/QA-Engineer-z-j%C4%99zykiem-niemieckim?jobDbPVId=258786239&l=en",
    "published_date": "January 6, 2026"
  },
  {
    "title": "Manual QA Engineer",
    "company": "Luware",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "Azure, Java, Python",
    "description": "Luware is looking for Manual QA Engineer",
    "apply_link": "https://luware.factorialhr.com/job_posting/manual-qa-engineer-f-m-d-100-277153",
    "published_date": "January 6, 2026"
  },
  {
    "title": "QA Analyst",
    "company": "Holafly",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "* Review and evaluate customer interactions across chat, email, video, and social media channels to ensure adherence to Holafly’s quality standards and protocols.\n* Monitor agent performance using key metrics established in the operation.\n* Monitor AI performance using key metrics established in the operation.\n* Identify coaching opportunities and provide detailed feedback to agents and team leaders to improve performance and consistency.\n* Calibrate quality evaluations with other QA analysts and leaders to ensure fairness and alignment across the team.\n* Create and escalate action plans with managers to improve the performance of team members.\n* Collaborate with Team Leaders, SMEs, and Trainers to identify common challenges and knowledge gaps.\n* Propose process improvements and knowledge updates that enhance efficiency and customer satisfaction.\n* Support the creation of best practices, tone guidelines, and examples of excellent interactions.\n* Participate in QA calibration sessions, quality roundtables, and process audits.\n* Track and analyze QA results, identifying trends and recurring issues that impact customer experience.\n* Prepare weekly and monthly reports on quality performance, highlighting successes and opportunities for improvement.\n* Share insights and recommendations with leadership to help refine training, tools, and operational workflows.\n* Partner with the Product and Tech teams to relay customer pain points and feature-related feedback.\n\n* 1–2 years of experience in quality assurance, customer support, or related roles (preferably in BPO, travel, or tech environments).\n* Experience evaluating customer interactions (chat, email, calls, or tickets) using quality monitoring tools.\n* Deep understanding of customer service performance metrics and quality frameworks.\n* Excellent written and verbal communication skills in English; other languages (Spanish, French, or German) are a plus.\n* Strong analytical and problem-solving skills, with high attention to detail.\n* Familiarity with CRM or support platforms such as Zendesk, Intercom, or Gorgias.\n* Proficiency in Google Workspace and/or Microsoft Office tools.\n* Ability to work independently, manage priorities, and adapt quickly in a fast-paced, remote environment.\n* Empathy, integrity, and a genuine passion for creating amazing customer experiences.\n* This is a contractor position. The contractor may be requested to provide their services during non-core business hours throughout the week, including evenings.",
    "apply_link": "https://holafly.applytojob.com/apply/un0dcndjwf/qa-analyst",
    "published_date": "January 6, 2026"
  },
  {
    "title": "Junior QA Engineer",
    "company": "Veeam Software",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "AWS",
    "description": "Veeam, the #1 global market leader in data resilience, believes businesses should control all their data whenever and wherever they need it. Veeam provides data resilience through data backup, data recovery, data portability, data security, and data intelligence. Based in Seattle, Veeam protects over 550,000 customers worldwide who trust Veeam to keep their businesses running. Join us as we move forward together, growing, learning, and making a real impact for some of the world’s biggest brands. The future of data resilience is here - go fearlessly forward with us.\n\n##### About the Role\n\nThe Veeam Quality Assurance team invites you to work on Veeam products with Veeam QA professionals in the Warsaw R&D office. QA has the power to breathe life into our products. Testers are always at the center of the action: developing an idea, thinking through the functionality, and conducting a thousand complex experiments is all easy, and this is not the limit. The goal of QA is a quality product and millions of happy users confident that “Veeam just works.”\n\n##### What You’ll Do\n\n* “Deep diving” into our products, technology and profession\n* Analysing software requirements\n* Testing one or several Veeam products\n* Communicating with other participants of the product development process\n* Evaluating test results, maintaining defects database\n\n##### What You’ll Bring\n\n* Technical education or passion for technology\n* 1 year of experience in system administration, software testing, or networking\n* Looking for your first job in IT or already working as a test engineer, software developer or system administrator\n* Willing to grow professionally in the software testing field\n* Advanced knowledge of Windows or Linux operating systems\n* Understanding of network technologies and systems (DNS, DHCP, basic network settings, etc.)\n* Curious, attentive and tend to note flaws in everything around you\n* An open-minded person with common sense and clear logic\n* A fast learner (passionate eyes outweigh knowledge gaps) and you love interesting and challenging tasks\n* English proficiency for daily communication within international teams\n\n##### What You’ll Get\n\n* 26 paid days off annually, plus 3 global VeeaMe Days for self-care and paid volunteer time\n* Paid parental, maternity, andpaternity leave\n* Fully covered family medical plan, dental, rehab, and vaccinations\n* Life, critical illness, and disability insurance\n* Employer pension contribution via PPK\n* Monthly Edenred allowance of 450 PLN for meals\n* MultiSport card fully covered by Veeam, giving access to sports facilities nationwide\n* Six free therapy sessions, plus legal and financial advice\n* Professional training and education, including courses and workshops, internal meetups, and unlimited access to our online learning platforms (LinkedIn Learning, Athena, O’Reilly) and mentoring through our MentorLab program\n\n**Please note:**\n\nPlease note that any personal data collected from you during the recruitment process will be processed in accordance with ourRecruiting Privacy Notice.\n\nThe Privacy Notice sets out the basis on which the personal data collected from you, or that you provide to us, will be processed by us in connection with our recruitment processes.\n\nBy applying for this position, you consent to the processing of your personal data in accordance with ourRecruiting Privacy Notice.\n\nBy submitting your application, you acknowledge that the information provided in your job application and any supporting documents is complete and accurate to the best of your knowledge. Any misrepresentation, omission, or falsification of information may result in disqualification from consideration for employment or, if discovered after employment begins, termination of employment.",
    "apply_link": "https://job-boards.eu.greenhouse.io/veeamsoftware/jobs/4745532101",
    "published_date": "January 3, 2026"
  },
  {
    "title": "QA Engineer",
    "company": "Capital on Tap",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "Azure, iOS, Appium, Selenium, Java, JavaScript, TypeScript, SQL, Postman",
    "description": "We’re Capital on Tap 👋\n💳 Capital on Tap was founded with the mission to help small business owners and make their lives easier. Today, we provide an all-in-one business credit card & spend management platform that helps business owners save time and money. Capital on Tap proudly serves over 200,000 businesses across the world and our goal is to help 1 million small businesses by 2030.\n\nWhy Join Us?\nWe empower you to be innovative and solve complex problems. Take ownership, make an impact, and thrive in our scaling and agile environment.\n\nThis is a B2B Contract 📃 position, working remotely 🏡 from Poland.\n\nWhat You'll Be DoingWe’re looking for a QA Engineer to join our team! You'd be responsible for both manual and automated testing as well as contributing to best practices throughout the SDLC working closely with our Software Engineers and Product Managers to provide governance and oversight of the quality of the products we develop. We're also big on running POCs to help improve various aspects of QA so there's plenty of interesting work to get stuck into!\n\n* Contributing to the ongoing development of automated test scenarios working as part of an agile team\n* Driving continuous improvement, recommending and implementing enhancements to test processes and procedures.\n* Investigating user problems referred to you by the Product teams, testing bugs, and creating and managing bug reports.\n* Developing a strong understanding of the products and domain to perform hands-on testing from a technical standpoint.\n* Supporting your engineering colleagues so that testing is a team-wide responsibility\n* Prioritising tasks and workload in a fast moving environment - good sense of urgency resourcefulness and independence\n* Managing risks and issues effectively with timely escalation to the project stakeholders\n* Reviewing design proposals, acceptance criteria and processes, and recommend improvements.\n\nWe’re Looking For 🔎Required skills:\n\n* Proven software quality assurance experience with a focus on both web and mobile applications\n* Experience developing tests for functional and regression testing that include manual, automated, performance and ad-hoc testing\n* Pragmatic when raising bugs and have a good understanding of risk, impact, dependencies and how to balance these\n* Understand the full E2E impact of changes, considering these in the QA strategy and approach\n* Experience with C# is preferable (or similar OOPs languages)\n* Experience with JavaScript/Typescript\n* Experience in using testing tools and frameworks such as, Selenium Webdriver, RestSharp, PostMan, Appium, xUnit, NUnit, etc\n* Experience working with and testing REST APIs\n* Experience working across multiple teams.\n* Understands CI/CD concepts and implement continuous testing practices\n* Excellent attention to detail and a methodical approach to testing\n* Understand the concept of checking against testing, strong knowledge of exploratory testing.\n* Bias for action and problem solving - eagerness to take initiative and make things happen\n* Proficient in SQL Server queries and scripting experience.\n\nNice to have skills:\n\n* Previous exposure to Microsoft Azure DevOps\n* Experience with usability best practices; able to influence and improve user experience\n* ISTQB certification desirable\n* Experience of working in a fintech company.\n\nDiversity & Inclusion🌈We welcome, consider, and encourage applications from anyone who shares our commitment to inclusivity. Join us in creating a space where authenticity thrives, and everyone can do their best work.\n\nInterview Process🤝First stage: 30-minute intro, CV review, and values with Talent Partner\n\n🤝Second stage: 45-minute “Tech Chat” with Team Manager\n\n🤝Final stage: 60-minute Code Pairing + 30-minute Interview with Engineering & Product\n\n**Other Info** 👍Check out our‘Top Tips’ for interviewing.\n✔️Keep updated on new job opportunities by following us onLinkedin.\n📧Emailcareers@capitalontap.comif you have any questions.\n\nExcited to work here? Apply!\nIf you’d like to progress your career within our fast growing, profitable fintech then click apply and we will aim to get back to you within 3 working days (during busy periods this could take up to 5 working days.)",
    "apply_link": "https://job-boards.greenhouse.io/capitalontap/jobs/7807915002",
    "published_date": "January 3, 2026"
  },
  {
    "title": "Data QA Engineer",
    "company": "Aristocrat",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Aristocrat is looking for Data QA Engineer",
    "apply_link": "https://aristocrat.wd3.myworkdayjobs.com/en-US/AristocratExternalCareersSite/job/Warsaw-Poland/Data-QA-Engineer_R0020124",
    "published_date": "January 3, 2026"
  },
  {
    "title": "Infrastructure Automation Engineer – On-Prem",
    "company": "Yopeso",
    "country": "Romania, Europe",
    "salary": "Undisclosed",
    "tags": "Docker, iOS, Python, Jenkins",
    "description": "Yopeso has been developing a diverse range of software products, from large-scale applications to smaller solutions, for 20 years. With a growing team of over 300 employees across five locations, we are dedicated to fostering a culture of growth, transparency, and professionalism.\n\nAt Yopeso, we value authenticity, curiosity, and ambition. These values drive us to build strong connections within our community and with our partners, ensuring trust, integrity, and transparency in all our business practices. We strive to maintain the highest professional standards and continuously challenge ourselves to develop high-quality, high-performance, and secure software solutions.\n\nOur approach is rooted in efficient collaboration among passionate professionals working in agile teams. Guided by curiosity and ambition, we strive to create products that are meaningful and impactful, while remaining true to our authentic selves.\n\n**What we offer:**\n\n* Competitive remuneration\n* Remote work\n* 24 days off per year and floating days\n* Private clinic health services, Regina Maria Medical Insurance\n* Flexible benefits through the Up multibenefits platform\n* Referral bonus scheme\n* Team events, online or at the office\n* Training and development opportunities with an allocated budget\n* Professional Certifications\n* Knowledge sharing context\n\nCompetitive remuneration\n\nRemote work\n\n24 days off per year and floating days\n\nPrivate clinic health services, Regina Maria Medical Insurance\n\nFlexible benefits through the Up multibenefits platform\n\nReferral bonus scheme\n\nTeam events, online or at the office\n\nTraining and development opportunities with an allocated budget\n\nProfessional Certifications\n\nKnowledge sharing context\n\n### Job requirements\n\n#### Role Overview\n\nAs an\n**Infrastructure Automation Engineer** , you will focus on automating\n**on-prem infrastructure and system-related processes** using\n**Ansible and Python** .Your primary goal is to eliminate manual, repetitive tasks, standardize infrastructure operations, and improve reliability and efficiency across engineering environments.\n\nBy integrating automation solutions with the\n**Common Data Backbone** , you will enable consistent configuration, streamlined data management, and scalable infrastructure operations.\n\n##### Key Responsibilities:\n\n* Design, implement, and maintainautomation frameworks for on-prem infrastructure\n* Automatesystem configuration, provisioning, and maintenanceusing Ansible and Python\n* Reduce manual effort and operational errors by automating repetitive tasks\n* Optimize infrastructure-related process flows and operational workflows\n* Integrate automation solutions with theCommon Data Backbone\n* Develop and maintainPython and Ansible-based tools and scripts\n* Continuously improve and extend automation capabilities based on evolving infrastructure needs\n* Collaborate closely with infrastructure and engineering teams\n\nDesign, implement, and maintain\n**automation frameworks for on-prem infrastructure**\n\nAutomate\n**system configuration, provisioning, and maintenance** using Ansible and Python\n\nReduce manual effort and operational errors by automating repetitive tasks\n\nOptimize infrastructure-related process flows and operational workflows\n\nIntegrate automation solutions with the\n**Common Data Backbone**\n\nDevelop and maintain\n**Python and Ansible-based tools and scripts**\n\nContinuously improve and extend automation capabilities based on evolving infrastructure needs\n\nCollaborate closely with infrastructure and engineering teams\n\n##### Requirements:\n\n* Background inSystem Administration, Infrastructure Engineering, or Automation\n* Strong hands-on experience withAnsible(mandatory),Jenkins, andDocker\n* Solid scripting skills inPython(mandatory); Bash is a plus\n* Experience automatingon-prem infrastructure environments\n* Understanding of infrastructure lifecycle, configuration management, and operational processes\n* Ability to analyze and automate complex workflows\n* Strong communication and problem-solving skills\n* Fluent in English (German is a plus)\n\nBackground in\n**System Administration, Infrastructure Engineering, or Automation**\n\nStrong hands-on experience with\n**Ansible** (mandatory),\n**Jenkins** , and\n**Docker**\n\nSolid scripting skills in\n**Python** (mandatory); Bash is a plus\n\nExperience automating\n**on-prem infrastructure environments**\n\nUnderstanding of infrastructure lifecycle, configuration management, and operational processes\n\nAbility to analyze and automate complex workflows\n\nStrong communication and problem-solving skills\n\nFluent in English (German is a plus)\n\n##### Nice to Have:\n\n* Experience withvirtualization platforms(VMware, KVM, etc.)\n* Exposure toInfrastructure as Code concepts\n* Basic knowledge of containers (nice-to-have, not core)\n\nExperience with\n**virtualization platforms** (VMware, KVM, etc.)\n\nExposure to\n**Infrastructure as Code concepts**\n\nBasic knowledge of containers (nice-to-have, not core)\n\nor\n\nFill out the information below\n\n* International\n* AfghanistanAfghanistan\n\nUpload your CV or resume file\n\nUpload your cover letter\n\nPlease fill in additional questions\n\n*\n\n#### All done!\n\nYour application has been successfully submitted!",
    "apply_link": "https://yopeso.recruitee.com/o/infrastructure-automation-engineer-on-prem-1",
    "published_date": "January 28, 2026"
  },
  {
    "title": "Infrastructure Automation Engineer – On-Prem",
    "company": "Yopeso",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "Docker, iOS, Python, Jenkins",
    "description": "**Yopeso** has been developing a diverse range of software products, from large-scale applications to smaller solutions, for 20 years. With a growing team of over 300 employees across five locations, we are dedicated to fostering a culture of growth, transparency, and professionalism.\n\nAt Yopeso, we value\n**authenticity, curiosity, and ambition** . These values drive us to build strong connections within our community and with our partners, ensuring trust, integrity, and transparency in all our business practices. We strive to maintain the highest professional standards and continuously challenge ourselves to develop high-quality, high-performance, and secure software solutions.\n\nOur approach is rooted in efficient collaboration among passionate professionals working in agile teams. Guided by curiosity and ambition, we strive to create products that are meaningful and impactful, while remaining true to our authentic selves.\n\n**What we offer:**\n\n* Competitive remuneration\n* Remote work\n* Sports/leisure benefit\n* 20 sick leave days paid at 100%\n* 32 calendar days of vacation\n* Team events, online, at the office or outside\n* Professional development plan with guidance and mentorship\n* Training and development opportunities with allocated budget\n* Professional Certifications\n* Optional medical insurance\n\nCompetitive remuneration\n\nRemote work\n\nSports/leisure benefit\n\n20 sick leave days paid at 100%\n\n32 calendar days of vacation\n\nTeam events, online, at the office or outside\n\nProfessional development plan with guidance and mentorship\n\nTraining and development opportunities with allocated budget\n\nProfessional Certifications\n\nOptional medical insurance\n\n### Job requirements\n\n#### Role Overview\n\nAs an\n**Infrastructure Automation Engineer** , you will focus on automating\n**on-prem infrastructure and system-related processes** using\n**Ansible and Python** .Your primary goal is to eliminate manual, repetitive tasks, standardize infrastructure operations, and improve reliability and efficiency across engineering environments.\n\nBy integrating automation solutions with the\n**Common Data Backbone** , you will enable consistent configuration, streamlined data management, and scalable infrastructure operations.\n\n##### Key Responsibilities:\n\n* Design, implement, and maintainautomation frameworks for on-prem infrastructure\n* Automatesystem configuration, provisioning, and maintenanceusing Ansible and Python\n* Reduce manual effort and operational errors by automating repetitive tasks\n* Optimize infrastructure-related process flows and operational workflows\n* Integrate automation solutions with theCommon Data Backbone\n* Develop and maintainPython and Ansible-based tools and scripts\n* Continuously improve and extend automation capabilities based on evolving infrastructure needs\n* Collaborate closely with infrastructure and engineering teams\n\nDesign, implement, and maintain\n**automation frameworks for on-prem infrastructure**\n\nAutomate\n**system configuration, provisioning, and maintenance** using Ansible and Python\n\nReduce manual effort and operational errors by automating repetitive tasks\n\nOptimize infrastructure-related process flows and operational workflows\n\nIntegrate automation solutions with the\n**Common Data Backbone**\n\nDevelop and maintain\n**Python and Ansible-based tools and scripts**\n\nContinuously improve and extend automation capabilities based on evolving infrastructure needs\n\nCollaborate closely with infrastructure and engineering teams\n\n##### Requirements:\n\n* Background inSystem Administration, Infrastructure Engineering, or Automation\n* Strong hands-on experience withAnsible(mandatory),Jenkins, andDocker\n* Solid scripting skills inPython(mandatory); Bash is a plus\n* Experience automatingon-prem infrastructure environments\n* Understanding of infrastructure lifecycle, configuration management, and operational processes\n* Ability to analyze and automate complex workflows\n* Strong communication and problem-solving skills\n* Fluent in English (German is a plus)\n\nBackground in\n**System Administration, Infrastructure Engineering, or Automation**\n\nStrong hands-on experience with\n**Ansible** (mandatory),\n**Jenkins** , and\n**Docker**\n\nSolid scripting skills in\n**Python** (mandatory); Bash is a plus\n\nExperience automating\n**on-prem infrastructure environments**\n\nUnderstanding of infrastructure lifecycle, configuration management, and operational processes\n\nAbility to analyze and automate complex workflows\n\nStrong communication and problem-solving skills\n\nFluent in English (German is a plus)\n\n##### Nice to Have:\n\n* Experience withvirtualization platforms(VMware, KVM, etc.)\n* Exposure toInfrastructure as Code concepts\n* Basic knowledge of containers (nice-to-have, not core)\n\nExperience with\n**virtualization platforms** (VMware, KVM, etc.)\n\nExposure to\n**Infrastructure as Code concepts**\n\nBasic knowledge of containers (nice-to-have, not core)\n\nor\n\nFill out the information below\n\n* International\n* AfghanistanAfghanistan\n\nUpload your CV or resume file\n\nUpload your cover letter\n\n*\n\n#### All done!\n\nYour application has been successfully submitted!",
    "apply_link": "https://yopeso.recruitee.com/o/infrastructure-automation-engineer-on-prem-moldova",
    "published_date": "January 28, 2026"
  },
  {
    "title": "Principal PLC/Automation Engineer",
    "company": "Sigma Software Group",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "We are looking for a Principal PLC/Automation Engineer who will lead the launch of a new project from the ground up. In this role, you will design and implement the automation architecture, develop PLC-based control systems, and integrate energy-efficient solutions.\n\nYou will collaborate closely with cross-functional specialists, define technical requirements, select appropriate hardware and control strategies, and ensure reliable, sustainable system performance.\n\n**PROJECT**\n\nThis is a new greenfield project, aimed at developing advanced water treatment technologies with optimized energy consumption. The solution will integrate solar and alternative energy sources to ensure sustainable and stable operation.\n\n### Job Description\n\n* Design and program PLC-based automation systems\n* Develop HMI/SCADA interfaces and monitoring tools\n* Integrate sensors, pumps, VFDs, and instrumentation for water-cleaning processes\n* Implement energy-optimized control strategies adapted to renewable power sources\n* Create system documentation (FDS, control narratives, test plans, electrical diagrams)\n* Lead FAT, on-site commissioning, troubleshooting, and optimization\n* Ensure compliance with safety, quality, and electrical standards\n* Coordinate with process, mechanical, and electrical teams throughout the project\n\n### Qualifications\n\n* 10+ years in industrial automation/PLC engineering\n* Proven background in process automation (preferably water/wastewater)\n* Hands-on experience with VFDs, industrial networks (Profinet, Modbus), and instrumentation\n* Ability to design control architecture and lead full lifecycle from concept to commissioning\n* Strong understanding of electrical principles, panel design, and safety standards\n* Excellent problem-solving and documentation skills\n* English level: Upper-Intermediate or higher",
    "apply_link": "https://jobs.smartrecruiters.com/sigmasoftware2/744000105813110-principal-plc-automation-engineer",
    "published_date": "January 28, 2026"
  },
  {
    "title": "Freelance Manual QA Tester",
    "company": "Radley Yeldar",
    "country": "United Kingdom, Europe",
    "salary": "Undisclosed",
    "tags": "Azure",
    "description": "**Essential skills for this role include:**\n\n-          2+ years as a QA (agency experience required)\n\n-          Good knowledge of QA & QA processes\n\n-          Ability to communicate with colleagues to help understand requirements and formulate them into acceptance criteria.\n\n-          Ability to know how to test across multiple devices and platforms, including a working knowledge of BrowserStack.\n\n**Desirable skills for this role:**\n\n-          An understanding of Umbraco, Jira and Azure\n\n**Examples of specific tasks**\n\n-          Facilitate requirements into acceptance criteria\n\n-          Manual testing across multiple devices and platforms\n\n**About You**\n\n-          Calm, Motivated, organised and methodical\n\n-          Proactive, resourceful and able to think critically\n\n-          Confident to speak up when you feel something is not right\n\nYou will be reporting to RY’s Head of QA and work in close collaboration with developers, creatives and project management.\n\nMore project-specific details can be provided after an NDA has been signed and return should both parties agree to proceed.",
    "apply_link": "https://apply.workable.com/radley-yeldar/j/AF050BBF59",
    "published_date": "January 28, 2026"
  },
  {
    "title": "QA Tester",
    "company": "Tester Work",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "**Tester Work** provides access to exciting and rewarding project-based opportunities for freelancers. Learn new skills and earn money by testing world-class apps and websites.\n\n🌎 For this specific project,\n**we are looking for QA testers and tech-enthusiasts in Austria!**\n\n* Test Case Executions:Perform a set of flows using specific instructions and compare the results observed with the expected/intended results provided;\n* Functional Exploratory Test Cases:Explore the application or website’s functionality based on your experience and background in testing;\n* Usability Test Cycles:Completing surveys or taking part in interviews to look into your preferences and opinions regarding different types of applications for our customers. Questionnaires investigate how you use specific apps, how much time you spend on them, and what you like and dislike about particular features and products.\n\nPerform a set of flows using specific instructions and compare the results observed with the expected/intended results provided;\n\nExplore the application or website’s functionality based on your experience and background in testing;\n\nCompleting surveys or taking part in interviews to look into your preferences and opinions regarding different types of applications for our customers. Questionnaires investigate how you use specific apps, how much time you spend on them, and what you like and dislike about particular features and products.\n\nPayments are transferred within a maximum of two weeks of project completion, via PayPal, bank transfers via Wise or Upwork.Don’t miss out on this exciting opportunity to develop new skills and earn good money on a schedule that suits you!﻿\n\nor\n\nFill out the information below\n\nPlease fill in additional questions\n\n*\n\n#### All done!\n\nYour application has been successfully submitted!",
    "apply_link": "https://testerwork.recruitee.com/o/qa-testers-wanted-in-austria-4",
    "published_date": "January 28, 2026"
  },
  {
    "title": "QA Tester",
    "company": "Tester Work",
    "country": "Switzerland, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "**Tester Work** provides access to exciting and rewarding project-based opportunities for freelancers. Learn new skills and earn money by testing world-class apps and websites.\n\n🌎 For this specific project,\n**we are looking for QA testers and tech-enthusiasts in Switzerland!**\n\n* Test Case Executions:Perform a set of flows using specific instructions and compare the results observed with the expected/intended results provided;\n* Functional Exploratory Test Cases:Explore the application or website’s functionality based on your experience and background in testing;\n* Usability Test Cycles:Completing surveys or taking part in interviews to look into your preferences and opinions regarding different types of applications for our customers. Questionnaires investigate how you use specific apps, how much time you spend on them, and what you like and dislike about particular features and products.\n\nPerform a set of flows using specific instructions and compare the results observed with the expected/intended results provided;\n\nExplore the application or website’s functionality based on your experience and background in testing;\n\nCompleting surveys or taking part in interviews to look into your preferences and opinions regarding different types of applications for our customers. Questionnaires investigate how you use specific apps, how much time you spend on them, and what you like and dislike about particular features and products.\n\nPayments are transferred within a maximum of two weeks of project completion, via PayPal, bank transfers via Wise or Upwork.Don’t miss out on this exciting opportunity to develop new skills and earn good money on a schedule that suits you!﻿\n\nor\n\nFill out the information below\n\nPlease fill in additional questions\n\n*\n\n#### All done!\n\nYour application has been successfully submitted!",
    "apply_link": "https://testerwork.recruitee.com/o/qa-testers-wanted-in-switzerland-3",
    "published_date": "January 28, 2026"
  },
  {
    "title": "Quality Assurance Mobile Engineer – Android, iOS",
    "company": "MARGO",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "MARGO is looking for Quality Assurance Mobile Engineer – Android, iOS",
    "apply_link": "https://jobs.lever.co/margo-group/f5d126fe-e2b8-4e68-931c-4e1caaaab38e",
    "published_date": "January 28, 2026"
  },
  {
    "title": "Software Quality Assurance Specialist III",
    "company": "Jabil",
    "country": "Germany, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Software Quality Assurance Specialist III is responsible for ensuring that all computerized systems used in healthcare operations comply with regulatory requirements such as FDA 21 CFR Part 11 and EU Annex 11. This role is critical in maintaining data integrity, patient safety, and product quality through rigorous validation of software and systems.\n\nKey Responsibilities\n\n* Project Leader for Computer System Validation (CSV) programs across Jabil Healthcare, ensuring alignment with global and site-specific objectives.\n* Subject Matter Expert (SME) in the validation of computerized quality systems and applications, providing strategic guidance and technical oversight.\n* Lead compliance initiatives related to FDA 21 CFR Part 11 and EU Annex 11, ensuring systems meet regulatory expectations.\n* Coach and mentor CSV leads/supervisors on procedures, forms, templates, and regulatory requirements, fostering a culture of compliance and continuous improvement.\n* Drivethe standardizationof CSVprocesses acrossthe site in accordance with global, regional, and site-level directives.\n* Champion adherence to global regulations and standards, including ISO 13485, FDA 21 CFR Part 11, and EU Annex 11.\n* Provide supportduring regulatoryaudits and inspections, ensuring readiness and robust documentation.\n* Accountable for CSV metrics to the global metrics team, contributing to enterprise-wide performance tracking.\n* Collaborate with cross-functional teams (QA, IT, Manufacturing, R&D) to define system requirements and validation strategies.\n* Ensure all validation activities are conducted in accordance with Jabil CSV procedures and associated work instructions.\n* Review and approve validation deliverables, ensuring completeness, accuracy, and compliance.\n* Monitor the Master System Inventory, ensuring accurate tracking of all GxP systems.\n* Monitor system performance and revalidate as necessary after upgrades or changes.\n* Lead periodic reviews of GxP systems and conduct risk assessments and impact analyses for both new and existing systems.\n* Ensure compliance with thecompany’s securitypolicies and procedures.\n* Perform additional duties and responsibilities as assigned, contributing to the overall success of the CSV program.\n\nProject Leader for Computer System Validation (CSV) programs across Jabil Healthcare, ensuring alignment with global and site-specific objectives.\n\nSubject Matter Expert (SME) in the validation of computerized quality systems and applications, providing strategic guidance and technical oversight.\n\nLead compliance initiatives related to FDA 21 CFR Part 11 and EU Annex 11, ensuring systems meet regulatory expectations.\n\nCoach and mentor CSV leads/supervisors on procedures, forms, templates, and regulatory requirements, fostering a culture of compliance and continuous improvement.\n\nthe standardization\nprocesses across\n\nChampion adherence to global regulations and standards, including ISO 13485, FDA 21 CFR Part 11, and EU Annex 11.\n\nduring regulatory\n\nAccountable for CSV metrics to the global metrics team, contributing to enterprise-wide performance tracking.\n\nCollaborate with cross-functional teams (QA, IT, Manufacturing, R&D) to define system requirements and validation strategies.\n\nEnsure all validation activities are conducted in accordance with Jabil CSV procedures and associated work instructions.\n\nReview and approve validation deliverables, ensuring completeness, accuracy, and compliance.\n\nMonitor the Master System Inventory, ensuring accurate tracking of all GxP systems.\n\nMonitor system performance and revalidate as necessary after upgrades or changes.\n\nLead periodic reviews of GxP systems and conduct risk assessments and impact analyses for both new and existing systems.\n\ncompany’s security\n\nPerform additional duties and responsibilities as assigned, contributing to the overall success of the CSV program.\n\nRequirements\n\n* Minimum 8 years of relevant experience in Computer System Validation, Software Quality Assurance, or related roles within a regulated (GxP) environment.\n* Bachelor’s degree in Engineering, Computer Science, Life Sciences, or a related technical discipline (Master’s degree preferred).\n* Deep knowledge of FDA 21 CFR Part 11, EU Annex 11, GAMP 5, and ISO 13485.\n* Proven experience leading CSV projects and delivering validation documentation (URS, Risk Assessments, IQ/OQ/PQ, Validation Plans/Reports).\n* Strong understanding of GxP system lifecycle management, including periodic reviews, change control, and revalidation.\n* Demonstrated ability to work cross-functionally with QA, IT, Manufacturing, and R&D teams.\n* Experience supporting regulatory inspections (FDA, Notified Bodies, internal audits).\n* Excellent communication, coaching, and stakeholder management skills.\n* Strong analytical and problem-solving capabilities, with demonstrated attention to detail.\n* Ability to manage multiple priorities in a fast-paced, global manufacturing environment.\n\nMinimum 8 years of relevant experience in Computer System Validation, Software Quality Assurance, or related roles within a regulated (GxP) environment.\n\nBachelor’s degree in Engineering, Computer Science, Life Sciences, or a related technical discipline (Master’s degree preferred).\n\nDeep knowledge of FDA 21 CFR Part 11, EU Annex 11, GAMP 5, and ISO 13485.\n\nProven experience leading CSV projects and delivering validation documentation (URS, Risk Assessments, IQ/OQ/PQ, Validation Plans/Reports).\n\nStrong understanding of GxP system lifecycle management, including periodic reviews, change control, and revalidation.\n\nDemonstrated ability to work cross-functionally with QA, IT, Manufacturing, and R&D teams.\n\nExperience supporting regulatory inspections (FDA, Notified Bodies, internal audits).\n\nExcellent communication, coaching, and stakeholder management skills.\n\nStrong analytical and problem-solving capabilities, with demonstrated attention to detail.\n\nAbility to manage multiple priorities in a fast-paced, global manufacturing environment.\n\nJabil, including its subsidiaries, is an equal opportunity employer and considers qualified applicants for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, age, disability, genetic information, veteran status, or any other characteristic protected by law.",
    "apply_link": "https://jabil.wd5.myworkdayjobs.com/jabil_careers/job/remote---germany/software-quality-assurance-specialist-iii--m-f-d-_j2437765",
    "published_date": "January 28, 2026"
  },
  {
    "title": "Senior QA Engineer",
    "company": "Acronis",
    "country": "Bulgaria, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "* Actively use AI in usual work\n* Perform quality assurance and testing using modern, state-of-the-art testing processes (including clean room testing) as well as manual QA/testing when required\n* Create, review, and approve test plans and test scripts to ensure alignment with company standards and IT strategy\n* Develop test data sets containing both valid and invalid records to thoroughly verify program logic and system workflows\n* Collaborate with business users/end-users to plan and execute User\n* Acceptance Testing (UAT), alpha, and beta testing phases\n* Verify successful completion of system testing, document results, and ensure all identified issues are properly resolved\n* Develop Autotests\n* Core Focus Areas\n* Strong emphasis on structured testing processes and documentation\n* Combination of manual testing + formal QA methodology + writing code\n* Active participation in user acceptance and pre-release validation\n* Opportunity to influence and shape quality culture and standards\n\nActively use AI in usual work\n\nPerform quality assurance and testing using modern, state-of-the-art testing processes (including clean room testing) as well as manual QA/testing when required\n\nCreate, review, and approve test plans and test scripts to ensure alignment with company standards and IT strategy\n\nDevelop test data sets containing both valid and invalid records to thoroughly verify program logic and system workflows\n\nCollaborate with business users/end-users to plan and execute User\n\nAcceptance Testing (UAT), alpha, and beta testing phases\n\nVerify successful completion of system testing, document results, and ensure all identified issues are properly resolved\n\nDevelop Autotests\n\nCore Focus Areas\n\nStrong emphasis on structured testing processes and documentation\n\nCombination of manual testing + formal QA methodology + writing code\n\nActive participation in user acceptance and pre-release validation\n\nOpportunity to influence and shape quality culture and standards\n\n* Conducts a wide range of quality control tests and analyses to ensure that software meets or exceeds specified standards and end user requirements |\n* Performs quality assurance and testing in an environment that typically uses state-of-the-art software applications testing processes (i.e., testing \"clean room\") but may also include manual QA/Testing\n* Drafts, revises and approves test plans and scripts to ensure alignment with standards and IT strategy\n* Creates test data files with valid and invalid records to thoroughly test program logic and verify system flow\n* Collaborates with users to plan user acceptance testing, alpha and beta testing\n* Ensures that system tests are successfully completed and documented and all problems are resolved\n* May develop, revise and approve quality assurance and testing policies, standards and procedures\n\nConducts a wide range of quality control tests and analyses to ensure that software meets or exceeds specified standards and end user requirements |\n\nPerforms quality assurance and testing in an environment that typically uses state-of-the-art software applications testing processes (i.e., testing \"clean room\") but may also include manual QA/Testing\n\nDrafts, revises and approves test plans and scripts to ensure alignment with standards and IT strategy\n\nCreates test data files with valid and invalid records to thoroughly test program logic and verify system flow\n\nCollaborates with users to plan user acceptance testing, alpha and beta testing\n\nEnsures that system tests are successfully completed and documented and all problems are resolved\n\nMay develop, revise and approve quality assurance and testing policies, standards and procedures\n\nA Swiss company foundedin Singapore in\n2003, Acronis offers over twenty years of innovation with 15 offices worldwide and more than 1800 employees in 50+ countries. Acronis Cyber Protect is available in 26 languages in 150 countries and is used by over 20,000 service providers to protect over 750,000 businesses.\n\nOur corporate culture is focused on making a positive impact on the lives of each employee and the communities we serve. Mutual trust,respectand belief that we can contribute to the world everyday are the cornerstones of our team.\nEach member of our “A-Team” plays an instrumental role in driving the success of our innovative and expanding business. We seek individuals who excel in dynamic, global environments and have a never give up attitude, contributing to our collective growth and impact.\n\nTo ensure a fair and genuine hiring process, candidates are expected to participate in interviews without the use of AI tools, automated prompts, or third-party assistance.Interviews are designed to assess individual skills, experience, and communicationstyleand we value authentic, real-time interaction.\n\nUse of AI or externalassistanceduring live interviews may result in disqualification. For roles where AI skills are being evaluated,permitteduse of AI tools will be clearly communicated in advance. Candidates may be asked to disable virtual backgrounds orparticipatein in-person interviews. All employment offers are contingent upon successful completion of applicable criminal,educationand identity background checks",
    "apply_link": "https://acronis.wd502.myworkdayjobs.com/acronis_careers/job/bulgaria/senior-qa-engineer_r-100792",
    "published_date": "January 28, 2026"
  },
  {
    "title": "Quality Assurance Engineer – EU/India",
    "company": "Zact",
    "country": "Greece, Europe",
    "salary": "Undisclosed",
    "tags": "iOS, Postman",
    "description": "**About the Role**\n\nWe are looking for a motivated Quality Assurance Engineer (QAE) to join our distributed team across Europe or India. You will play a key role in ensuring the quality and reliability of our existing product, working directly with product lead and clients to understand issues, provide release confidence, and maintain high standards for product delivery. This role requires someone who is a quick learner, independent, and comfortable in a fully remote, client-facing environment.\n\n**What You’ll Do**\n\n* Test and validate features of our existing product to ensure      high-quality delivery\n* Analyze user stories and requirements to create clear, actionable      test cases\n* Execute test plans across functional, regression, and edge-case      scenarios\n* Identify, document, and track defects, working closely with      developers to ensure resolution\n* Communicate directly with support, product lead, and clients to      understand reported issues and provide timely updates\n* Provide release confidence and validation reports directly to      clients\n* Collaborate with remote team members across multiple time zones\n* Identify tests and workflows that would benefit from automation and      provide input to the automation team\n* Contribute to continuous improvement of testing processes,      documentation, and best practices\n\n**What We’re Looking For**\n\n* Proven experience in software testing, QA, or a related role\n* Strong experience with Postman, Jira, AIO,      or equivalent test management tools\n* Ability to create effective test cases from user stories and      requirements\n* Ability to identify tests that would benefit from automation\n* Quick learner with the ability to work independently and take      ownership of product quality\n* Strong problem-solving skills and attention to detail\n* Excellent verbal and written communication skills\n* Comfortable working in a fully remote, distributed team environment\n* Flexible and adaptable to changing priorities and deadlines\n* Located in Europe or India\n\n**Nice to Have**\n\n* Basic understanding of how to trigger automated tests via      CI/CD pipelines\n* Experience with ERP systems or enterprise software\n* Experience working in SaaS, B2B, or customer-facing products\n* Familiarity with automated testing frameworks or scripting\n* Understanding of release management and deployment processes\n\n**Minimum Education Requirement**\n\n* Bachelor’s degree in Computer Science, Engineering, Information      Technology, or a related field or      equivalent practical experience",
    "apply_link": "https://zact-inc.breezy.hr/p/b5998ec4ef12-quality-assurance-engineer-qae-eu-india-remote",
    "published_date": "January 27, 2026"
  },
  {
    "title": "QA Engineer z j. francuskim (osoba na stanowisku QA)",
    "company": "Strix",
    "country": "France, Europe",
    "salary": "Undisclosed",
    "tags": "iOS, Git, Java, JavaScript, React, Postman",
    "description": "Strix is looking for QA Engineer z j. francuskim (osoba na stanowisku QA)",
    "apply_link": "https://career.strix.net/o/qa-engineer-z-j-francuskim-osoba-na-stanowisku-qa",
    "published_date": "January 27, 2026"
  },
  {
    "title": "Senior QA Engineer - Ireland (m/w/d)",
    "company": "Storyblok",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Storyblok is looking for Senior QA Engineer - Ireland (m/w/d)",
    "apply_link": "https://www.storyblok.com/job?gh_jid=4708714101",
    "published_date": "January 27, 2026"
  },
  {
    "title": "Senior QA Engineer - Portugal (m/w/d)",
    "company": "Storyblok",
    "country": "Portugal, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Storyblok is looking for Senior QA Engineer - Portugal (m/w/d)",
    "apply_link": "https://www.storyblok.com/job?gh_jid=4749653101",
    "published_date": "January 27, 2026"
  },
  {
    "title": "Senior QA Engineer - UK (m/w/d)",
    "company": "Storyblok",
    "country": "United Kingdom, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Storyblok is looking for Senior QA Engineer - UK (m/w/d)",
    "apply_link": "https://www.storyblok.com/job?gh_jid=4749654101",
    "published_date": "January 27, 2026"
  },
  {
    "title": "QA",
    "company": "Technopride",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "ETL, SQL",
    "description": "Technopride is looking for QA",
    "apply_link": "https://technopride.zohorecruit.eu/jobs/careers/86852000002895230/QA?source=CareerSite",
    "published_date": "January 27, 2026"
  },
  {
    "title": "Quality Assurance Tester",
    "company": "Motorsport Games",
    "country": "United Kingdom, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Motorsport Games is looking for Quality Assurance Tester",
    "apply_link": "https://motorsportgames.bamboohr.com/careers/60",
    "published_date": "January 27, 2026"
  },
  {
    "title": "Automation QA Engineer",
    "company": "Game Lounge",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Docker, JavaScript, TypeScript",
    "description": "Game Lounge is looking for Automation QA Engineer",
    "apply_link": "https://gamelounge.bamboohr.com/careers/300",
    "published_date": "January 27, 2026"
  },
  {
    "title": "Full Stack QA Engineer",
    "company": "Genestack",
    "country": "Spain, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Docker, Kubernetes, Git, GitHub, Playwright, PyTest, Python, SQL",
    "description": "**Genestack**\n\n**Full Stack QA Engineer**\n\n**In this role, you will:**\n\n* Take full ownership of assigned tasks within sprints — from designing test cases and choosing most optimal test strategies to executing manual and writing automated tests.\n* Develop and maintain robust automated tests for both UI and API layers of our web-based solution.\n* Collaborate closely with product and development teams to understand complex requirements and translate them into effective test strategies.\n* Contribute to the ongoing improvement of our testing frameworks, pipelines, tools, and QA processes.\n\n**We would like you to have:**\n\n* 3+ years of experience as a Full Stack QA Engineer with a strong focus on test analysis and design.\n* Solid programming skills in Python, with practical experience in writing API/UI tests (knowledge of pytest, requests and Playwright is essential)\n* Knowledge of version control systems (e.g., GitHub), understanding of common branching strategies.\n* Ability to work efficiently in CLI environments.\n* Experience with CI/CD tools, preferably TeamCity.\n* Excellent communication and teamwork skills.\n* Fluent in English, both written and spoken.\n* A genuine interest in life sciences and bioinformatics.\n\n**It would be nice for you to have:**\n\n* Experience with other programming languages, frameworks and tools, including those for performance testing.\n* Experience using data manipulation and analysis tools (e.g., pandas).\n* Experience with SQL and NoSQL databases.\n* Solid grasp of core concepts in containerization and orchestration technologies, i.e., Docker and Kubernetes.\n* Familiarity with cloud platforms (e.g., AWS).\n\n**We offer you:**\n\n* international team of professionals;\n* fully paid sick leaves;\n* onboarding and domain training for newcomers;\n* flexible work schedule.",
    "apply_link": "https://genestack-ltd.breezy.hr/p/6ccea2948168-full-stack-qa-engineer",
    "published_date": "January 27, 2026"
  },
  {
    "title": "QA Manager Home-Based - GBR",
    "company": "Capita",
    "country": "United Kingdom, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "What we’re looking for:\n\nEssential:\n\n* Proven experience in QA management roles within large-scale learning technology or public sector programmes.\n* Strong understanding of market leading LMS/LXP platforms such as Cornerstone, and their integration with enterprise systems.\n* Experience in testing data integrations, APIs, and MI reporting tools\n* Familiarity with public sector standards for technology, security, data, quality, governance, and compliance.\n\nDesirable:\n\n* ISTQB or equivalent QA certification.\n* Experience with Agile and DevOps environments.\n\nIn addition, you will also have:\n\n* Excellent communication and stakeholder management skills, including client-facing experience.\n* Ability to manage multiple priorities and deliver under tight timelines.\n\nWhat you’ll be doing:\n\n* Own and evolve the QA strategy, standards, and best practices across the programme.\n* Define and implement test methodologies, including functional, integration, regression, and performance testing.\n* Develop and maintain test plans, test cases, and test scripts aligned to programme milestones and product releases.\n* Ensure traceability of requirements through robust test coverage and defect management.\n\n* Oversee QA activities for learning platform technology, ensuring high quality user experiences and reliable integration with internal systems and third-party tools.\n* Validate data flows and reporting accuracy across MI dashboards and government systems.\n\n* Act as the QA point of contact for internal teams and external clients, including government departments and delivery partners.\n* Provide clear, concise reporting on QA status, risks, and issues to programme leadership and governance boards.\n* Participate in client meetings, workshops, and reviews to represent QA interests and ensure alignment with contractual obligations.\n\n* Line manage 1–2 testers, providing coaching, performance management, and professional development.\n* Foster a culture of continuous improvement and quality excellence within the QA team.\n* Collaborate with Technical specialists, UX Designers, Learning Designers, Product Owners and Support teams to ensure standards and ways of working are embedded across teams.\n\nJoin Capita – Where Innovation Meets Opportunity\n\ndifference.\n\nyou.\n\nWhat’s in it for you?\n\n* 💻Remote working with occasional travel– work from wherever you’re happiest in the UK\n* 💰Competitive salary\n* 🌴23 days’ holiday, rising to 27 (pro rata) – plus the option to buy more after qualifying period\n* ❤️Paid volunteering daywith a charity of your choice\n* 🍼 Generousfamily leave policies– including 15 weeks’ fully paid maternity, adoption, and shared parental leave\n* 🚴‍♀️Cycle2Work scheme, pension, life assurance, and more\n\n🤝 Customer first, always​🧑‍💻 Fearless innovation​✅ Achieve together​💙 Everyone is valued\n\nWhat we hope you’ll do next:\n\nChoose ‘Apply now’ to fill out our short application, so that we can find out more about you.\n\nWe are committed to building a workforce that reflects the diversity of the communities we serve. As part of our strategic goals, we are focused on accelerating gender and ethnic representation in leadership roles. We warmly encourage applications from women and individuals from Black, Asian, and other ethnic minority backgrounds.\n\nLocation:\n\n,\n\nTime Type:\n\nContract Type:",
    "apply_link": "https://capita.wd3.myworkdayjobs.com/en-US/CapitaGlobal/job/QA-Manager_10115408",
    "published_date": "January 27, 2026"
  },
  {
    "title": "Senior Design Quality Assurance Expert",
    "company": "Ambit Iberia",
    "country": "Portugal, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Ambit Iberia is looking for Senior Design Quality Assurance Expert",
    "apply_link": "https://ambit.teamtailor.com/jobs/7103553-senior-design-quality-assurance-expert-100-remote",
    "published_date": "January 27, 2026"
  },
  {
    "title": "QA Engineer, DeFi Wallet",
    "company": "Bitpanda",
    "country": "Spain, Europe",
    "salary": "Undisclosed",
    "tags": "Git, Playwright, RSpec, TypeScript, Web3",
    "description": "##### Who we are\n\nWe simplify wealth creation. Founded in 2014 in Vienna, Austria by Eric Demuth, Paul Klanschek and Christian Trummer, we’re here to help people trust themselves enough to build their financial freedom — for now and the future. Our user-friendly, trade-everything platform empowers both first-time investors and seasoned experts to invest in the cryptocurrencies, crypto indices, stocks*, precious metals and commodities* they want — with any sized budget, 24/7. Our global team works across different cultures and time zones, bringing our products to more than 6 million customers, making us one of Europe’s safest and most secure platforms that powers modern investing.\n\nHeadquartered in Austria but operating across Europe, our products are built by fast-moving, talented, “roll-up-your-sleeves-and-make-it-happen” kind of people. It’s these diverse perspectives and innovative minds operating as ONE TEAM that keep Bitpanda at the cutting edge of our industry. So if you’re someone who thinks big, moves fast and wants to make an impact right from day one, then get ready to join our industry-changing team. Let’s go!\n\n##### \n\n**What you’ll do**\n\n##### \n\n* Assess quality on BP DeFi Wallet, creating and executing test plans performing manual and automated testing\n* Actively participate throughout the whole development cycle and co-shape the scrum practices and ceremonies, and mentor a QA intern and dev colleagues on QA topics.\n* Refine QA processes (drive left shift, advocate for higher usability, testability and security)\n* Participate in developing, extending and maintaining automation frameworks (playwright E2E and integration as well as API and load tests), co-shaping our CI/CD pipelines to increase product quality and confidence, and feedback speed\n* Own, shape and refine the release testing strategy (cadence, devices, scope of testing, automation)\n\n##### \n\n**Who you are**\n\n* Possess well-rounded QA experience with a strong focus onmobile testing, complemented by solid experience in bothFront-EndandBack-Endquality assurance.\n* Payments experience and an active interest in and enthusiasm for theWeb3space.\n* Havestrong analytical skillsto identify problems that matter and investigate bugs and patterns\n* Demonstrate a strongunderstanding of Scrum and Kanbanmethodologies, coupled with a solid grasp ofgood coding practicesessential for maintainable automation and collaboration.\n* Provenexperience developing and extending automation frameworks(ideally Front End facing and/or using TypeScript), and successfully integrating them into CI/CD pipelines (e.g., GitLab).\n\n##### What’s in it for you\n\n* Flexibility to work where you thrive– Enjoy the freedom of our Hybrid working model, combining onsite collaboration and remote work, with an additional 25 days per year to work from a city or country of your choice.\n* Reward for your impact– Receive a competitive total compensation package aligned with Bitpanda’s pay-for-impact policy, including participation in our stock option plan.\n* Support for your mental wellbeing– Access confidential coaching, counselling, and mental health resources whenever you need them through OpenUP.\n* Time to recharge– Take extra time off to rest, reset, and recharge, with 3 additional days off in 2026 to prioritise your wellbeing.\n* Continuous learning and growth– Grow your skills and stay ahead in your career with unlimited access to Udemy’s library of online courses at your own pace.\n* Exclusive perks and rewards– Enjoy discounts, rewards, and perks from partners worldwide across lifestyle, wellness, tech, and travel.\n* Support during life milestones– Take advantage of our additional 8 weeks of gender-neutral new parent leave to welcome and bond with your new addition to the family.\n* Create a productive workspace at home– Set up your home office exactly how you want it with a dedicated budget for comfort and productivity.\n* Fuel and focus on-site– Pandas in Vienna, Bucharest, Barcelona, and Berlin can enjoy free onsite dining, with freshly prepared lunches and snacks to keep you fuelled and focused all day long.\n* Recognition for your contributions– Celebrate milestones and achievements with recognition and rewards for your Tenure at Bitpanda.\n* Show your Bitpanda pride– Access exclusive Bitpanda-branded merchandise and gear to represent.\n* Connect and celebrate with your team– Join unforgettable company events, from our Winter Party in Vienna to summer gatherings worldwide, fostering fun, connection, and celebration\n\n.…and even more location-specific benefits designed to make life at Bitpanda even more rewarding wherever you are.\n\nAbove all, you will have the opportunity to learn and grow as part of Bitpanda’s incredible journey towards being Europe’s future #1 investment platform.",
    "apply_link": "https://job-boards.eu.greenhouse.io/bitpanda/jobs/4765203101",
    "published_date": "January 27, 2026"
  },
  {
    "title": "Junior QA Engineer",
    "company": "Duelbits",
    "country": "United Kingdom, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Duelbits is looking for Junior QA Engineer",
    "apply_link": "https://duelbits.bamboohr.com/careers/98",
    "published_date": "January 27, 2026"
  },
  {
    "title": "AQA Engineer",
    "company": "Acronis",
    "country": "Bulgaria, Europe",
    "salary": "Undisclosed",
    "tags": "Git, Playwright, Python, SQL, Jenkins, Postman",
    "description": "* Communicate with product managers, developers, and analysts to understand business and technical requirements\n* Review and analyze the product and its requirements\n* Design test suites and test cases\n* Develop automated tests for Windows, Linux, and macOS\n* Participate in code reviews, providing feedback to ensure automation code quality and maintainability\n* Execute and maintain regression test suites to validate release stability\n* Analyze automated test results\n* Maintain detailed documentation for test plans, test cases, and test results, ensuring clear communication of testing activities\n* Collect comprehensive and relevant data for bug investigation\n* Analyze customer issues, investigate root causes, and participate in technical discussions with R&D teams\n* Understand requirements & review product specs together with - PMs/devs/analysts\n* Design test suites/cases & develop automated tests (E2E, API/UI, regression)\n* Participate in code reviews for automation quality & maintainability\n* Execute & maintain regression suites, analyze results daily\n* Investigate bugs/root causes (including customer issues), collect data, discuss with R&D\n* Keep detailed test documentation & ensure release stability\n\nCommunicate with product managers, developers, and analysts to understand business and technical requirements\n\nReview and analyze the product and its requirements\n\nDesign test suites and test cases\n\nDevelop automated tests for Windows, Linux, and macOS\n\nParticipate in code reviews, providing feedback to ensure automation code quality and maintainability\n\nExecute and maintain regression test suites to validate release stability\n\nAnalyze automated test results\n\nMaintain detailed documentation for test plans, test cases, and test results, ensuring clear communication of testing activities\n\nCollect comprehensive and relevant data for bug investigation\n\nAnalyze customer issues, investigate root causes, and participate in technical discussions with R&D teams\n\nUnderstand requirements & review product specs together with - PMs/devs/analysts\n\nDesign test suites/cases & develop automated tests (E2E, API/UI, regression)\n\nParticipate in code reviews for automation quality & maintainability\n\nExecute & maintain regression suites, analyze results daily\n\nInvestigate bugs/root causes (including customer issues), collect data, discuss with R&D\n\nKeep detailed test documentation & ensure release stability\n\n* 3+ years of experience as an Automation QA Engineer (Python)\n* Solid knowledge of QA theory: principles, methodologies, and techniques\n* Tech stack: Python, Postman, API/UI testing, Playwright, SQL, Jira, Git, Jenkins, etc.\n* Confident skills in basic Windows/Linux/macOS system operations, including software installation, network configuration, and general troubleshooting\n* Strong analytical mindset and ability to solve complex logical problems\n* Good interpersonal, written, and verbal communication skills\n* Upper-intermediate English\n* Strong skills in using AI-assisted tools for test design, test analysis, and automation, including the ability to formulate precise, unambiguous specifications and prompts to achieve deterministic and repeatable results\n\n3+ years of experience as an Automation QA Engineer (Python)\n\nSolid knowledge of QA theory: principles, methodologies, and techniques\n\nTech stack: Python, Postman, API/UI testing, Playwright, SQL, Jira, Git, Jenkins, etc.\n\nConfident skills in basic Windows/Linux/macOS system operations, including software installation, network configuration, and general troubleshooting\n\nStrong analytical mindset and ability to solve complex logical problems\n\nGood interpersonal, written, and verbal communication skills\n\nUpper-intermediate English\n\nStrong skills in using AI-assisted tools for test design, test analysis, and automation, including the ability to formulate precise, unambiguous specifications and prompts to achieve deterministic and repeatable results\n\nA Swiss company foundedin Singapore in\n2003, Acronis offers over twenty years of innovation with 15 offices worldwide and more than 1800 employees in 50+ countries. Acronis Cyber Protect is available in 26 languages in 150 countries and is used by over 20,000 service providers to protect over 750,000 businesses.\n\nOur corporate culture is focused on making a positive impact on the lives of each employee and the communities we serve. Mutual trust,respectand belief that we can contribute to the world everyday are the cornerstones of our team.\nEach member of our “A-Team” plays an instrumental role in driving the success of our innovative and expanding business. We seek individuals who excel in dynamic, global environments and have a never give up attitude, contributing to our collective growth and impact.\n\nTo ensure a fair and genuine hiring process, candidates are expected to participate in interviews without the use of AI tools, automated prompts, or third-party assistance.Interviews are designed to assess individual skills, experience, and communicationstyleand we value authentic, real-time interaction.\n\nUse of AI or externalassistanceduring live interviews may result in disqualification. For roles where AI skills are being evaluated,permitteduse of AI tools will be clearly communicated in advance. Candidates may be asked to disable virtual backgrounds orparticipatein in-person interviews. All employment offers are contingent upon successful completion of applicable criminal,educationand identity background checks",
    "apply_link": "https://acronis.wd502.myworkdayjobs.com/acronis_careers/job/bulgaria/aqa-engineer_r-100793",
    "published_date": "January 27, 2026"
  },
  {
    "title": "Senior QA engineer - Hybrid QA (Javascript + Test Rail)",
    "company": "Nagarro",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "iOS, Git, Java, JavaScript",
    "description": "👋🏼 We're Nagarro. We are a digital product engineering company that is scaling in a big way! We build products, services, and experiences that inspire, excite, and delight. We work at scale — across all devices and digital mediums, and our people exist everywhere in the world (18 000+ experts across 39 countries, to be exact). Our work culture is dynamic and non-hierarchical. We're looking for great new colleagues. That's where you come in! By this point in your career, it is not just about the tech you know or how well you can code. It is about what more you want to do with that knowledge. Can you help your teammates proceed in the right direction? Can you tackle the challenges our clients face while always looking to take our solutions one step further to succeed at an even higher level? Yes? You may be ready to join us.\n\n### Job Description\n\n**Senior QA Automation Engineer (Javascript + Test Rail)**\n\n* Design, develop, and execute test cases for web applications.\n* Perform manual, exploratory, and regression testing.\n* Ensure high quality standards across the full testing lifecycle.\n* Analyze requirements and translate them into effective test scenarios.\n* Identify, document, track, and validate defects until resolution.\n* Actively contribute to UAT activities and business validation.\n* Maintain and manage test cases in TestRail.\n* Collaborate closely with developers, product owners, and stakeholders.\n* Support and extend test automation activities where applicable.\n* Participate in Agile ceremonies (planning, refinements, retrospectives).\n* Contribute to continuous improvement of QA processes and best practices.\n* Ensure testing coverage for configuration-based, IoT, or energy-related systems.\n\n### Qualifications\n\n* 5+ years of experience in Quality Assurance.\n* JavaScript (medium to expert level).\n* Strong background inManual Testing.\n* Hands-on experience withTestRail.\n* Test Case Design & Execution.\n* Exploratory & Regression Testing.\n* Defect Reporting & Tracking.\n* Requirements Analysis.\n* User Acceptance Testing (UAT).\n\n### Additional Information\n\nNice to Have\n\n* Java programming (used with Serenity).\n* Test Automation experience.\n* Previous exposure to:Energy Management projects.,IoT environments, configuration-based projects.\n\nDomain Knowledge (Plus)\n\n* Energy Management systems\n* IoT ecosystems\n* Building Automation / BMS concepts\n* Sensors, controllers, actuators\n* Alarms, setpoints, zones",
    "apply_link": "https://jobs.smartrecruiters.com/Nagarro1/744000104422175-senior-qa-engineer-hybrid-qa-javascript-test-rail-",
    "published_date": "January 22, 2026"
  },
  {
    "title": "QA Engineer (Europe, remote) - Sherpany",
    "company": "Datasite",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "Docker, Kubernetes, Git, GitHub, Playwright, Python, TypeScript, LLM, Game",
    "description": "* Ensuring product quality in order to achieve better customer satisfaction\n* Establishing and maintaining a quality system for all requirements\n* Analysing and evaluating data and key performances and drive continuous development of the quality\n* Conduct testing of applications, identifying deficiencies and creating and managing the overall quality planning strategy\n* Create and maintain automated tests to reduce the time of repetitive tasks\n* Creating reports for management and making sure that a quality awareness mindset is established in the team\n\nEnsuring product quality in order to achieve better customer satisfaction\n\nEstablishing and maintaining a quality system for all requirements\n\nAnalysing and evaluating data and key performances and drive continuous development of the quality\n\nConduct testing of applications, identifying deficiencies and creating and managing the overall quality planning strategy\n\nCreate and maintain automated tests to reduce the time of repetitive tasks\n\nCreating reports for management and making sure that a quality awareness mindset is established in the team\n\n* Experienced QA Engineer with different testing techniques such as UI Testing, Automated Testing, Performance Testing, API testing, LLM testing and have a knowledge of REST, Python, TypeScript\n* Experience in writing automated tests in Playwright as a plus.\n* Experienced with agile methodologies and have strong analytical skills\n* Solution-oriented team player with an autonomous and proactive working style\n* Experience / Knowledge of Kubernetes, Docker and CI/CD (Github Actions) is a plus\n* Great interpersonal and communication skills in English\n\nExperienced QA Engineer with different testing techniques such as UI Testing, Automated Testing, Performance Testing, API testing, LLM testing and have a knowledge of REST, Python, TypeScript\n\nExperience in writing automated tests in Playwright as a plus.\n\nExperienced with agile methodologies and have strong analytical skills\n\nSolution-oriented team player with an autonomous and proactive working style\n\nExperience / Knowledge of Kubernetes, Docker and CI/CD (Github Actions) is a plus\n\nGreat interpersonal and communication skills in English\n\n* Flexibility & Freedom: We value your work-life balance!\n* Grow with Us: We invest in your development by offering financial support for further education, training, and more—because your success is our success.\n* Well-being Matters: Your mental health is important! That’s why we partner withnilo.healthto support you.\n* Tech-Savvy Workspace: Work with the latest Apple MacBooks and cutting-edge tools to keep you ahead of the game.\n* Amazing Team Culture: We believe in fun, collaboration, and meaningful connections—expectawesome team eventsand a culture driven by strong values.\n\nFlexibility & Freedom: We value your work-life balance!\n\nGrow with Us: We invest in your development by offering financial support for further education, training, and more—because your success is our success.\n\nWell-being Matters: Your mental health is important! That’s why we partner with\nnilo.health\nto support you.\n\nTech-Savvy Workspace: Work with the latest Apple MacBooks and cutting-edge tools to keep you ahead of the game.\n\nAmazing Team Culture: We believe in fun, collaboration, and meaningful connections—expect\nawesome team events\nand a culture driven by strong values.\n\n* 1st Interview with our Talent Acquisition Specialist\n* Show us your skills with a technical code challenge\n* Technical interview with our QA Team\n* Get to know your potencial future squad and our Head of Platform and Operations\n* Job offer\n\n1st Interview with our Talent Acquisition Specialist\n\nShow us your skills with a technical code challenge\n\nTechnical interview with our QA Team\n\nGet to know your potencial future squad and our Head of Platform and Operations\n\nJob offer\n\nOur company is committed to fostering a diverse and inclusive workforce where all individuals are respected and valued. We are an equal opportunity employer and make all employment decisions without regard to race, color, religion, sex, gender identity, sexual orientation, age, national origin, disability, protected veteran status, or any other protected characteristic. We encourage applications from candidates of all backgrounds and are dedicated to building teams that reflect the diversity of our communities.",
    "apply_link": "https://datasite.wd1.myworkdayjobs.com/en-US/datasite/job/POL---Poland-Work-from-Home/QA-Engineer--Europe--remote----Sherpany_R35843",
    "published_date": "January 22, 2026"
  },
  {
    "title": "UAT Tester, 10 months project",
    "company": "TechBiz Global",
    "country": "Portugal, Europe",
    "salary": "Undisclosed",
    "tags": "iOS, SQL",
    "description": "At TechBiz Global, we are providing recruitment service to our TOP clients from our portfolio. We are currently seeking an\n**UAT Tester** specialistto join one of our\n**clients** ' teams. If you're looking for an exciting opportunity to grow in a innovative environment, this could be the perfect fit for you.\n\n**Key Responsibilities:**\n\n* Collaborate with the project team to understand the business requirements and objectives of the software.\n* Develop and execute detailed UAT test plans and test cases based on the business requirements.\n* Document test results, report bugs and errors to the development team, and follow through on resolutions.\n* Work closely with business analysts and project managers to ensure that all scenarios are tested and that the software meets business needs.\n* Provide feedback to the development team on usability and functionality issues.\n* Participate in project meetings and provide updates on UAT progress and outcomes.\n* Assist in the creation of user manuals and training materials for end-users.\n* Ensure that all UAT practices adhere to the company's quality standards and guidelines.\n* Stay updated on new testing tools and test strategies to improve the UAT process.\n\nCollaborate with the project team to understand the business requirements and objectives of the software.\n\nDevelop and execute detailed UAT test plans and test cases based on the business requirements.\n\nDocument test results, report bugs and errors to the development team, and follow through on resolutions.\n\nWork closely with business analysts and project managers to ensure that all scenarios are tested and that the software meets business needs.\n\nProvide feedback to the development team on usability and functionality issues.\n\nParticipate in project meetings and provide updates on UAT progress and outcomes.\n\nAssist in the creation of user manuals and training materials for end-users.\n\nEnsure that all UAT practices adhere to the company's quality standards and guidelines.\n\nStay updated on new testing tools and test strategies to improve the UAT process.\n\n### Job requirements\n\n**Skills and Qualifications Required:** - Bachelor's degree in Computer Science, Information Technology, or related field.- Proven experience in UAT testing or a similar role.- Strong understanding of software development and testing methodologies.- Proficiency in test management software (Sirion) and SQL.- Excellent analytical and problem-solving skills.- Ability to document and troubleshoot errors.- Working knowledge of Agile frameworks and regression testing is a plus.- Excellent communication and teamwork skills, with the ability to work independently.- Attention to detail and a commitment to achieving high-quality outcomes.- Preferred certifications: ISTQB Certification (Foundation Level or higher).\n\nor\n\nFill out the information below\n\n* International\n* AfghanistanAfghanistan\n\nUpload your CV or resume file\n\nUpload your cover letter\n\nPlease fill in additional questions\n\nI hereby confirm that I have read and understood the\n.\n\n*\n\n#### All done!\n\nYour application has been successfully submitted!",
    "apply_link": "https://techbizglobal.recruitee.com/o/uat-tester-10-months-project",
    "published_date": "January 21, 2026"
  },
  {
    "title": "Senior UAT Tester",
    "company": "TechBiz Global",
    "country": "Portugal, Europe",
    "salary": "Undisclosed",
    "tags": "iOS, SQL",
    "description": "At TechBiz Global, we are providing recruitment service to our TOP clients from our portfolio. We are currently seeking an\n**Senior UAT Tester** specialistto join one of our\n**clients** ' teams. If you're looking for an exciting opportunity to grow in a innovative environment, this could be the perfect fit for you.\n\n**Key Responsibilities:**\n\n* Collaborate with the project team to understand the business requirements and objectives of the software.\n* Develop and execute detailed UAT test plans and test cases based on the business requirements.\n* Document test results, report bugs and errors to the development team, and follow through on resolutions.\n* Work closely with business analysts and project managers to ensure that all scenarios are tested and that the software meets business needs.\n* Provide feedback to the development team on usability and functionality issues.\n* Participate in project meetings and provide updates on UAT progress and outcomes.\n* Assist in the creation of user manuals and training materials for end-users.\n* Ensure that all UAT practices adhere to the company's quality standards and guidelines.\n* Stay updated on new testing tools and test strategies to improve the UAT process.\n\nCollaborate with the project team to understand the business requirements and objectives of the software.\n\nDevelop and execute detailed UAT test plans and test cases based on the business requirements.\n\nDocument test results, report bugs and errors to the development team, and follow through on resolutions.\n\nWork closely with business analysts and project managers to ensure that all scenarios are tested and that the software meets business needs.\n\nProvide feedback to the development team on usability and functionality issues.\n\nParticipate in project meetings and provide updates on UAT progress and outcomes.\n\nAssist in the creation of user manuals and training materials for end-users.\n\nEnsure that all UAT practices adhere to the company's quality standards and guidelines.\n\nStay updated on new testing tools and test strategies to improve the UAT process.\n\n### Job requirements\n\n**Skills and Qualifications Required:** - Bachelor's degree in Computer Science, Information Technology, or related field.- Proven experience in UAT testing or a similar role.- Strong understanding of software development and testing methodologies.- Proficiency in test management software (Sirion) and SQL.- Excellent analytical and problem-solving skills.- Ability to document and troubleshoot errors.- Working knowledge of Agile frameworks and regression testing is a plus.- Excellent communication and teamwork skills, with the ability to work independently.- Attention to detail and a commitment to achieving high-quality outcomes.- Preferred certifications: ISTQB Certification (Foundation Level or higher).\n\nor\n\nFill out the information below\n\n* International\n* AfghanistanAfghanistan\n\nUpload your CV or resume file\n\nUpload your cover letter\n\nPlease fill in additional questions\n\nI hereby confirm that I have read and understood the\n.\n\n*\n\n#### All done!\n\nYour application has been successfully submitted!",
    "apply_link": "https://techbizglobal.recruitee.com/o/senior-uat-tester-10-months-project",
    "published_date": "January 21, 2026"
  },
  {
    "title": "LQA Game Tester, Arabic – Freelance",
    "company": "Side",
    "country": "Portugal, Europe",
    "salary": "Undisclosed",
    "tags": "iOS, Game",
    "description": "**About the company**\n\nSide (formerly PTW) is a global video game development and services provider, offering technical and creative solutions to many of the largest developers and studios around the world.\n\nFounded in Japan in 1994, Side has grown to become a global force in the video games industry, with over 40 studios in 15 countries worldwide and offices across North America, Europe, South America, and Asia.\n\nOur industry-leading services include codev, art production, localization, audio production, quality assurance, localization QA, player support, community management, and datasets. For more information, visit\nwww.side.inc\n\n**About the role**\n\nAs Localization QA Game Tester, you will work within our Localization Quality Assurance team and be the very first person to see the localized game in its entirety – translated text, images and the rest of the user interface collectively. You’ll get to experience the project in the way it will be consumed by the end users. You will work in a multilingual project team ensuring that the game is free from grammatical errors, cultural inconsistencies and ultimately ensuring that the game is accurately localized into the target language.\n\n**Key Responsibilities:**\n\n* Collaborate with a global project team.\n* Identify and correct spelling, grammar, punctuation, and other language errors.\n* Ensure adherence to console manufacturer guidelines.\n* Log details of errors and issues, providing improvement suggestions.\n* Ensure accurate translation within context and maintain consistency in terminology and imagery.\n* Identify missing or incorrect content and ensure proper display/format of dates, calendars, and characters.\n* Write reports on errors and bugs found and perform ad hoc translation.\n* Oversee the quality of your work, collaborate with the team, and contribute to the overall success of projects.\n\nOur Localization QA team conducts language checks on upcoming games across a variety of cutting-edge platforms, including PC, Xbox Series X/S, PS5, Nintendo Switch, PlayStation VR2, and various mobile and tablet devices. As an LQA Game Tester, you will be working on top gaming titles for some of the world’s leading publishers.\n\n**Requirements**\n\n* No experience required. Just fluency in Arabic and conversational in English.\n* Strong cultural understanding of the language you are applying for.\n* Computer literacy – particularly with Excel.\n* Robust Internet research skills.\n* Excellent attention to detail.\n* Previous experience with using different software, applications, and websites.\n* Ability to communicate clearly and concisely and collaborate within project teams.\n* Candidate must be located within Schengen Area.\n\n**What we offer:**\n\n* You will be working for the pre-eminent global provider of specialist services to the games industry and provided with full training and the opportunity to work on some of the biggest game clients, titles, projects, and tech in the world.\n* Attractive remuneration, holidays, regular team competitions with great prizes; and inclusion into an extensive social calendar. Our environments thrive with collaborative teamwork with people from all around the world, different nationalities, and languages.\n* A supportive community inclusive of LGBTQ+, and any age, ethnicity, religion, or disability. We care about the well-being of our employees and have a dedicated employee well-being program. We empower our people and offer regular progression opportunities to ensure our employees flourish.\n* Learn as you work and be part of something real that changes the face of gaming - forever.\n* Working with a global multi-lingual workforce with superb training and promotion and progression opportunities.\n\n**Working Condition:**\n\n* 100% remote within Europe. If you're based in Braga, Portugal, even better!\n* With the possibility of transitioning to a full-time role. However, if you prefer to remain a freelancer, that's perfectly fine!\n\n**We are currently building a talent pool for future opportunities.**\n\n**ALL APPLICATION MUST BE SENT IN ENGLISH**",
    "apply_link": "https://apply.workable.com/sideinc/j/9876DCEC7E",
    "published_date": "January 21, 2026"
  },
  {
    "title": "QA Automation",
    "company": "Expleo Group",
    "country": "Portugal, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Expleo Group is looking for QA Automation",
    "apply_link": "https://expleo-jobs-pt-en.icims.com/jobs/49393/qa-automation/job?in_iframe=1",
    "published_date": "January 21, 2026"
  },
  {
    "title": "Software Verification, QA Specialist",
    "company": "Codekeeper",
    "country": "Netherlands, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, iOS, Git, Java, Python, JavaScript, SQL, MySQL",
    "description": "Software Verifications & QA Specialist\n\n**About the Role**\n\nThe primary focus of this role is to ensure the integrity and reliability of our customers' software through verification processes. This role involves analyzing technical documentation, executing successful software builds in various programming languages, and validating software functionality against specified requirements. Additionally, you will be involved in conducting thorough testing of various scenarios, employing both manual and automated testing approaches. Your meticulous attention to detail will enable you to identify and report any bugs or glitches discovered during testing. The role also encompasses a variety of tasks in backend, frontend, and DevOps, making versatility and adaptability key traits for the successful candidate.\n\n**What You’ll Be Doing**\n\n**Software Verification**\n\n* Conduct verification of customer software using provided technical documentation\n* Achieve software builds across various programming languages\n* Identify, diagnose, and resolve build issues, ensuring software meets quality standards\n\nConduct verification of customer software using provided technical documentation\n\nAchieve software builds across various programming languages\n\nIdentify, diagnose, and resolve build issues, ensuring software meets quality standards\n\n**Quality Assurance & Testing**\n\n* Conduct end-to-end testing of application features across multiple scenarios\n* Use both manual and automated testing methods to validate functionality\n* Identify, document, and report bugs or inconsistencies to ensure a high-quality user experience\n\nConduct end-to-end testing of application features across multiple scenarios\n\nUse both manual and automated testing methods to validate functionality\n\nIdentify, document, and report bugs or inconsistencies to ensure a high-quality user experience\n\n**Technical Analysis and Problem Solving**\n\n* Analyze software requirements and technical documentation to understand build processes and dependencies\n\nAnalyze software requirements and technical documentation to understand build processes and dependencies\n\n**Collaboration and Communication**\n\n* Communicate effectively with team members and clients to understand requirements and provide updates\n\nCommunicate effectively with team members and clients to understand requirements and provide updates\n\n**Continuous Learning and Improvement**\n\n* Stay updated with emerging technologies and programming languages relevant to software verification\n* Contribute to the continuous improvement of verification processes and practices\n\nStay updated with emerging technologies and programming languages relevant to software verification\n\nContribute to the continuous improvement of verification processes and practices\n\n**Additional Backend, Frontend, and DevOps Tasks**\n\n* Assist in backend and frontend development tasks as required\n* Participate in DevOps activities, including CI/CD pipeline development and maintenance\n\nAssist in backend and frontend development tasks as required\n\nParticipate in DevOps activities, including CI/CD pipeline development and maintenance\n\n**Why Codekeeper?**\n\nWe were founded by tech industry professionals to revolutionize software escrow for the cloud era. We offer state-of-the-art software escrow solutions that mitigate third-party risks in business operations. As a remote-first company with a central office in The Hague, we prioritize a healthy, resilient organization to support the development of our robust app.\n\n🌐\ncodekeeper.co\n\n**What You Can Expect**\n\n* Passionate and fun-loving colleagues\n* Startup mindset with ample opportunities for growth\n* Regular team activities and gatherings\n* Comprehensive onboarding process with a dedicated ramp-up period\n* A supportive team that values open communication and direct feedback\n* A chance to excel in your career and make a difference\n\nPassionate and fun-loving colleagues\n\nStartup mindset with ample opportunities for growth\n\nRegular team activities and gatherings\n\nComprehensive onboarding process with a dedicated ramp-up period\n\nA supportive team that values open communication and direct feedback\n\nA chance to excel in your career and make a difference\n\n**About You**\n\n* 3+ years development / DevOps experience\n* 2+ years of experience with Linux, Windows and Mac environment fundamentals\n* Basic understanding of popular backend languages (Python, Java, NodeJS and PHP)\n* Prior experience or understanding of database- and server configuration (MongoDB, SQL, MySQL)\n* Prior experience or understanding of Git\n* Basic knowledge of front-end languages HTML, CSS, and JavaScript beneficial\n* Basic knowledge of AWS technologies beneficial\n* Basic knowledge of API configuration beneficial\n* Experience with various build tools, like (but not specifically) msbuild, webpack, maven, and others of the type beneficial\n\n3+ years development / DevOps experience\n\n2+ years of experience with Linux, Windows and Mac environment fundamentals\n\nBasic understanding of popular backend languages (Python, Java, NodeJS and PHP)\n\nPrior experience or understanding of database- and server configuration (MongoDB, SQL, MySQL)\n\nPrior experience or understanding of Git\n\nBasic knowledge of front-end languages HTML, CSS, and JavaScript beneficial\n\nBasic knowledge of AWS technologies beneficial\n\nBasic knowledge of API configuration beneficial\n\nExperience with various build tools, like (but not specifically) msbuild, webpack, maven, and others of the type beneficial\n\n**Additional Requirements**\n\n* Technical Expertise: Proficiency in multiple programming languages and software development tools\n* Analytical Skills: Strong ability to analyze technical documentation and identify key requirements\n* Problem-Solving: Excellent problem-solving abilities to diagnose and resolve complex software issues\n* Communication: Effective communication skills, both verbal and written, for collaborating with teams and clients\n* Adaptability: Ability to adapt to various programming environments and quickly learn new technologies\n* Teamwork: Strong team player with the ability to work in cross-functional teams\n* Time Management: Excellent organizational and time-management skills, with the ability to handle multiple tasks simultaneously\n\nTechnical Expertise: Proficiency in multiple programming languages and software development tools\n\nAnalytical Skills: Strong ability to analyze technical documentation and identify key requirements\n\nProblem-Solving: Excellent problem-solving abilities to diagnose and resolve complex software issues\n\nCommunication: Effective communication skills, both verbal and written, for collaborating with teams and clients\n\nAdaptability: Ability to adapt to various programming environments and quickly learn new technologies\n\nTeamwork: Strong team player with the ability to work in cross-functional teams\n\nTime Management: Excellent organizational and time-management skills, with the ability to handle multiple tasks simultaneously\n\n**Additional Info**\n\n**(#LI-Remote)**",
    "apply_link": "http://codekeeper.applytojob.com/apply/yeiflax2sa/software-verification-qa-specialist",
    "published_date": "January 21, 2026"
  },
  {
    "title": "QA Engineer",
    "company": "The Leaflet",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "Git, Python, SQL, Postman",
    "description": "**Location: Poland only, fully remote**\n\n**Job Type: B2B, full time**\n\n**Overview**\n\nHard Rock Digital is a team focused on becoming the best online sportsbook, casino, and social casino company in the world. We care about each customer's interaction, experience, behaviour, and insight and strive to ensure we’re always acting authentically.\n\nRooted in the kindred spirits of the Seminole Tribe of Florida, the new Hard Rock Digital taps a brand known all over the world as the leader in gaming, entertainment, and hospitality. We’re taking that foundation of success and bringing it to the digital space.\n\n**What** **s the position?**\n\n****\n\n****\n\nAs a Manual QA Engineer, your responsibilities will include:\n\n* Participating in all stages of the Software Development Life Cycle (SDLC) to ensure product quality\n* Reviewing and analysing product and technical requirements to develop comprehensive test strategies\n* Collaborating with QA and development teams to create detailed test plans and test cases\n* Executing test cases and analysing results to identify and document issues\n* Reporting and managing bugs, and assisting in troubleshooting issues\n* Monitoring health check metrics to ensure product stability\n* Working closely with Product and Development teams to drive continuous improvement\n* Contributing to QA Key Performance Indicators (KPIs) to track and enhance the efficiency and effectiveness of QA processes\n* Learn our application(s) inside and out and become subject matter expert\n* Mentor and guide junior QA team members in best practices, tools, and troubleshooting methods\n* Take ownership of testing strategy and execution for complex features or modules\n* Act as the primary QA point of contact in cross-functional discussions and planning sessions\n\nParticipating in all stages of the Software Development Life Cycle (SDLC) to ensure product quality\n\nReviewing and analysing product and technical requirements to develop comprehensive test strategies\n\nCollaborating with QA and development teams to create detailed test plans and test cases\n\nExecuting test cases and analysing results to identify and document issues\n\nReporting and managing bugs, and assisting in troubleshooting issues\n\nMonitoring health check metrics to ensure product stability\n\nWorking closely with Product and Development teams to drive continuous improvement\n\nContributing to QA Key Performance Indicators (KPIs) to track and enhance the efficiency and effectiveness of QA processes\n\nLearn our application(s) inside and out and become subject matter expert\n\nMentor and guide junior QA team members in best practices, tools, and troubleshooting methods\n\nTake ownership of testing strategy and execution for complex features or modules\n\nAct as the primary QA point of contact in cross-functional discussions and planning sessions\n\n### Job requirements\n\n**Who are we looking for?**\n\nWe are seeking someone who’s highly organized with a proactive mindset and a passion for tackling challenges with innovative ideas and solutions.\n\nKey skills required for this position:\n\n* 3+ years of professional experience in QA testing for web and mobile applications\n* Advanced expertise in identifying and resolving complex issues in web and mobile applications, including performance bottlenecks, integration failures, and UI/UX inconsistencies\n* Mastery in using QA tools (e.g., Proxyman, Charles, DevTools, Postman) and emulators for efficient troubleshooting and debugging\n* Mid level knowledge of SQL, with the ability to write and execute queries to validate data and support troubleshooting efforts\n* Exceptional analytical and problem-solving abilities, with a keen eye for detail\n* Thorough understanding of test management software and the QA role throughout the SDLC\n* Outstanding written and verbal communication skills to effectively convey ideas and feedback\n* Strong decision-making abilities, especially under tight deadlines or when prioritizing tasks in a fast-paced environment\n* Strong teamwork and collaboration abilities, with a proactive approach to cross-functional engagement\n* Team-oriented mindset, demonstrating excellent interpersonal skills for working with diverse stakeholders\n* Proven time management skills, with the ability to meet deadlines in a dynamic environment\n* Self-motivated, detail-oriented, and adept at prioritizing tasks in a fast-paced, complex setting\n* A genuine enthusiasm for sports betting and casino gaming, with a passion for understanding the industry\n* Experience with test automation development (backend or frontend) in Python is a plus\n\n3+ years of professional experience in QA testing for web and mobile applications\n\nAdvanced expertise in identifying and resolving complex issues in web and mobile applications, including performance bottlenecks, integration failures, and UI/UX inconsistencies\n\nMastery in using QA tools (e.g., Proxyman, Charles, DevTools, Postman) and emulators for efficient troubleshooting and debugging\n\nMid level knowledge of SQL, with the ability to write and execute queries to validate data and support troubleshooting efforts\n\nExceptional analytical and problem-solving abilities, with a keen eye for detail\n\nThorough understanding of test management software and the QA role throughout the SDLC\n\nOutstanding written and verbal communication skills to effectively convey ideas and feedback\n\nStrong decision-making abilities, especially under tight deadlines or when prioritizing tasks in a fast-paced environment\n\nStrong teamwork and collaboration abilities, with a proactive approach to cross-functional engagement\n\nTeam-oriented mindset, demonstrating excellent interpersonal skills for working with diverse stakeholders\n\nProven time management skills, with the ability to meet deadlines in a dynamic environment\n\nSelf-motivated, detail-oriented, and adept at prioritizing tasks in a fast-paced, complex setting\n\nA genuine enthusiasm for sports betting and casino gaming, with a passion for understanding the industry\n\nExperience with test automation development (backend or frontend) in Python is a plus\n\nor\n\nFill out the information below\n\n* International\n* AfghanistanAfghanistan\n\nUpload your CV or resume file\n\nUpload your cover letter\n\nPlease fill in additional questions\n\nI agree to the company\n﻿\n\n*\n\n#### All done!\n\nYour application has been successfully submitted!",
    "apply_link": "https://hardrockdigital.recruitee.com/o/manual-qa-engineer-8",
    "published_date": "January 19, 2026"
  },
  {
    "title": "Senior MQA Engineer",
    "company": "Newfire Global Partners",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "Git, Postman",
    "description": "### Your day-to-day activities:\n\n* Perform thorough manual testing of Web, BackEnd, and Mobile applications to ensure high quality and compliance with specifications.\n* Develop, document, and execute test plans, checklists and test cases.\n* Identify, record, document thoroughly, and track bugs.\n* Collaborate with cross-functional teams including developers, BA's, product managers, and UI/UX designers to ensure comprehensive test coverage\n* Participate in all aspects of the software development lifecycle, from requirements discussion (gathering) through post-release support\n* Test APIs and services by verifying data and functionality between various systems\n* Work closely with the automation team to identify opportunities for automation within manual testing processes\n* Ensure that all test results are accurate, reproducible, and recorded\n\n### You’re a perfect match if you have:\n\n* Experience Level: 3+ years of experience in Manual QA, with exposure to Web, BackEnd, and Mobile application testing.\n* Testing Tools & Frameworks: Experience with QA tools such as:○ For Web Testing: Browser developer tools, Postman, or similar tools.○ For BackEnd Testing: API testing tools like Postman, Swagger, or SoapUI.○ For Mobile Testing: Experience with testing tools like TestFlight, Charles orsimilar tools\n* Bug Tracking Tools: Proficiency with bug tracking and task management tools\n* Version Control: Experience with version control systems such as Git, Bitbucket, or SVN. Test Management: Experience with test management tools such as TestRail or Zephyr or similar tools.\n* Strong analytical skills with a focus on problem-solving.\n* Ability to understand and translate business requirements into testing strategies.\n* Solid understanding of software testing methodologies, including functional,regression, integration, and UAT testing.\n* Ability to multitask, prioritize, and manage time effectively in a fast-pacedenvironment.\n* Attention to detail and excellent communication skills.\n* Strong collaboration skills and the ability to work effectively in a teamenvironment.\n* A proactive approach with a drive to continuously improve processes andsystems.\n* High level of self-motivation, commitment, and dedication to the task at hand.\n\n### About Newfire Global Partners",
    "apply_link": "https://newfireglobal.pinpointhq.com/en/postings/1f4f546a-a931-4712-b74f-d1f0626258b5",
    "published_date": "January 19, 2026"
  },
  {
    "title": "Senior QA Engineer",
    "company": "Newfire Global Partners",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "Git, SQL, Postman",
    "description": "### Your day-to-day activities:\n\n* Perform thorough manual testing of Web, BackEnd, and Mobile applications to ensure high quality and compliance with specifications.\n* Develop, document, and execute test plans, checklists and test cases.\n* Identify, record, document thoroughly, and track bugs.\n* Collaborate with cross-functional teams including developers, BA's, product managers, and UI/UX designers to ensure comprehensive test coverage.\n* Participate in all aspects of the software development lifecycle, from requirements discussion (gathering) through post-release support.\n* Test APIs and services by verifying data and functionality between various systems.\n* Work closely with the automation team to identify opportunities for automation within manual testing processes.\n* Ensure that all test results are accurate, reproducible, and recorded.\n\n### You’re a perfect match if you have:\n\n* Experience Level: 3+ years of experience in Manual QA, with exposure to Web, BackEnd, and Mobile application testing.\n* Testing Tools & Frameworks: Experience with QA tools such as:For Web Testing: Browser developer tools, Postman, or similar tools.For BackEnd Testing: API testing tools like Postman, Swagger, or SoapUI.For Mobile Testing: Experience with testing tools like TestFlight, Charles or similar tools.\n* For Web Testing: Browser developer tools, Postman, or similar tools.\n* For BackEnd Testing: API testing tools like Postman, Swagger, or SoapUI.\n* For Mobile Testing: Experience with testing tools like TestFlight, Charles or similar tools.\n* Bug Tracking Tools: Proficiency with bug tracking and task management tools.\n* Version Control: Experience with version control systems such as Git, Bitbucket, or SVN.\n* Test Management: Experience with test management tools such as TestRail or Zephyr or similar tools.\n* Strong analytical skills with a focus on problem-solving.\n* Ability to understand and translate business requirements into testing strategies.\n* Solid understanding of software testing methodologies, including functional, regression, integration, and UAT testing.\n* Ability to multitask, prioritize, and manage time effectively in a fast-paced environment.\n* Attention to detail and excellent communication skills.\n* Strong collaboration skills and the ability to work effectively in a team environment.\n* A proactive approach with a drive to continuously improve processes and systems.\n* High level of self-motivation, commitment, and dedication to the task at hand.\n* As a Senior team member, you will be expected to actively participate in our hiring processes by serving on interview panels for future roles across the company.\n\n* Experience with Agile/Scrum methodologies.\n* Basic knowledge of SQL for database verification.\n* Familiarity with CI/CD pipelines and how testing fits into continuous delivery.\n* Knowledge of performance testing tools is a plus.\n\n### About Newfire Global Partners",
    "apply_link": "https://newfireglobal.pinpointhq.com/en/postings/83b14f02-2c2d-49de-8f2f-fd6c96b21252",
    "published_date": "January 19, 2026"
  },
  {
    "title": "Quality Assurance, French",
    "company": "Expleo Group",
    "country": "Portugal, Europe",
    "salary": "Undisclosed",
    "tags": "Azure, Selenium",
    "description": "Expleo Group is looking for Quality Assurance, French",
    "apply_link": "https://expleo-jobs-pt-en.icims.com/jobs/49369/quality-assurance---french/job?in_iframe=1",
    "published_date": "January 19, 2026"
  },
  {
    "title": "Quality Assurance Engineer – w/m/d",
    "company": "Arsipa",
    "country": "Germany, Europe",
    "salary": "Undisclosed",
    "tags": "iOS, Selenium, JUnit, Java, Python, TypeScript",
    "description": "### Jobbeschreibung\n\nir suchen einen\n**Quality Assurance (QA) Engineer (w/m/d)** für unsere wachsende Unternehmensgruppe -\n**Remote - deutschlandweit**\n\nDie\n**Arsipa GmbH** ist eine deutschlandweite Unternehmensgruppe in den Bereichen\n**Arbeitssicherheit, Arbeitsmedizin und Umweltschutz** . Wir verfolgen eine Private Equity Buy & Build Strategie und sind mit unseren\n**23 Tochterunternehmen** sowie\n**über 850 Mitarbeiter*Innen** an insgesamt\n**50 Standorten** in Deutschland und Österreich vertreten.\n\nUnsere Vision ist es, Arbeitsschutz neu zu denken:\n**Persönlich, individuell und aus einer Hand** . Durch den Zusammenschluss von erfolgreichen regionalen Betrieben zu einer\n**Unternehmensgruppe** werden wir einer der führenden drei Marktteilnehmer im deutschlandweiten Health & Safety Markt. Von unserem Hauptsitz in Berlin aus unterstützen und entlasten wir unsere Partnerbetriebe in den Bereichen Personal, Marketing, Finanzen sowie IT und fördern gleichzeitig den fachlichen Austausch zwischen Kolleg*Innen anderer Partnerbetriebe der\n.\n\n**Deine Aufgaben:**\n\n* Entwicklung und Implementierung von Teststrategien und -plänen zur Sicherstellung der Softwarequalität unseres Arbeitsmedizin-ERP-Systems „medigini“, des Kundenportals und weiteren Anwendungen aus dem Bereich Arbeitssicherheit\n* Erstellung und Durchführung von manuellen und automatisierten Tests\n* Zusammenarbeit mit den Entwicklungs- und Produktteams, um Anforderungen und Spezifikationen zu überprüfen\n* Sicherstellung der Einhaltung von Qualitätsstandards und Best Practices im gesamten Entwicklungsprozess\n* Analyse und Berichterstattung von Testergebnissen sowie Ableitung von Verbesserungsvorschlägen und die kontinuierliche Verbesserung der Testprozesse und -methoden\n\nEntwicklung und Implementierung von Teststrategien und -plänen zur Sicherstellung der Softwarequalität unseres Arbeitsmedizin-ERP-Systems „medigini“, des Kundenportals und weiteren Anwendungen aus dem Bereich Arbeitssicherheit\n\nErstellung und Durchführung von manuellen und automatisierten Tests\n\nZusammenarbeit mit den Entwicklungs- und Produktteams, um Anforderungen und Spezifikationen zu überprüfen\n\nSicherstellung der Einhaltung von Qualitätsstandards und Best Practices im gesamten Entwicklungsprozess\n\nAnalyse und Berichterstattung von Testergebnissen sowie Ableitung von Verbesserungsvorschlägen und die kontinuierliche Verbesserung der Testprozesse und -methoden\n\n**Deine Startvoraussetzungen:**\n\n* Mindestens 2 Jahre Berufserfahrung im Bereich Qualitätssicherung, Softwaretest oder als QA-Engineer\n\nMindestens 2 Jahre Berufserfahrung im Bereich Qualitätssicherung, Softwaretest oder als QA-Engineer\n\n* Fundierte Kenntnisse in der Erstellung und Durchführung von Testplänen und Testfällen\n\nFundierte Kenntnisse in der Erstellung und Durchführung von Testplänen und Testfällen\n\n* Erfahrung mit Testautomatisierungstools (z.B. Selenium, JUnit, Vitest, TestNG) und Testmanagement-Tools (z.B. JIRA, TestRail)\n\nErfahrung mit Testautomatisierungstools (z.B. Selenium, JUnit, Vitest, TestNG) und Testmanagement-Tools (z.B. JIRA, TestRail)\n\n* Kenntnisse in Programmiersprachen (z.B. Java, Python, Rust) und Skriptsprachen (z.B. Typescript)\n\nKenntnisse in Programmiersprachen (z.B. Java, Python, Rust) und Skriptsprachen (z.B. Typescript)\n\n* Teamfähigkeit, eigenständige Arbeitsweise und eine ausgeprägte Problemlösungsfähigkeit\n\nTeamfähigkeit, eigenständige Arbeitsweise und eine ausgeprägte Problemlösungsfähigkeit\n\n* Sehr gute Deutschkenntnisse (mind. B2) sowie verhandlungssichere Englischkenntnisse\n\nSehr gute Deutschkenntnisse (mind. B2) sowie verhandlungssichere Englischkenntnisse\n\n**Unsere Benefits:**\n\n* Strukturiertes Onboarding:Ein durchdachter Einstieg mit persönlicher Begleitung durch unser tolles Team – für einen sicheren und erfolgreichen Start bei uns\n* Zentral gelegenes Office mit Wow-Faktor:Unser Standort im 12. Stock des Rocket Towers bietet einen beeindruckenden 360°-Blick über Berlin – zentral in Kreuzberg/Mitte gelegen und optimal erreichbar\n* Moderne Arbeitsumgebung:Hochwertig ausgestattete Arbeitsplätze, stilvolle Meetingräume und alles, was es für produktives Arbeiten braucht – vom höhenverstellbaren Schreibtisch bis zu einer inspirierenden Atmosphäre\n* Kulinarische Extras:Große Auswahl an Getränken, frischer Kaffee, Snacks – und auch der obligatorische Obstkorb erwartet dich bei uns, neben regelmäßigen Team Lunches und Dinners für alle, die gutes Essen schätzen\n* Gemeinsame Erlebnisse:Monatlich wechselnde Team-Events stärken den Zusammenhalt und bringen Abwechslung in den Arbeitsalltag\n* Transparente Kommunikation:Wöchentliche Meetings mit deiner Führungskraft und regelmäßige All-Hands Meetings schaffen Klarheit, Nähe und Raum für gemeinsame Erfolge\n* Gesundheit im Fokus:Kostenlose Nutzung des hauseigenen Fitnessstudios im Rocket Tower\n* Exklusive Vergünstigungen:Zugriff auf unser Corporate Benefits Portal mit zahlreichen Angeboten und Sonderkonditionen bei bekannten Partnern\n\n**Strukturiertes Onboarding:** Ein durchdachter Einstieg mit persönlicher Begleitung durch unser tolles Team – für einen sicheren und erfolgreichen Start bei uns\n\n**Zentral gelegenes Office mit Wow-Faktor:** Unser Standort im 12. Stock des Rocket Towers bietet einen beeindruckenden 360°-Blick über Berlin – zentral in Kreuzberg/Mitte gelegen und optimal erreichbar\n\n**Moderne Arbeitsumgebung:** Hochwertig ausgestattete Arbeitsplätze, stilvolle Meetingräume und alles, was es für produktives Arbeiten braucht – vom höhenverstellbaren Schreibtisch bis zu einer inspirierenden Atmosphäre\n\n**Kulinarische Extras:** Große Auswahl an Getränken, frischer Kaffee, Snacks – und auch der obligatorische Obstkorb erwartet dich bei uns, neben regelmäßigen Team Lunches und Dinners für alle, die gutes Essen schätzen\n\n**Gemeinsame Erlebnisse:** Monatlich wechselnde Team-Events stärken den Zusammenhalt und bringen Abwechslung in den Arbeitsalltag\n\n**Transparente Kommunikation:** Wöchentliche Meetings mit deiner Führungskraft und regelmäßige All-Hands Meetings schaffen Klarheit, Nähe und Raum für gemeinsame Erfolge\n\n**Gesundheit im Fokus:** Kostenlose Nutzung des hauseigenen Fitnessstudios im Rocket Tower\n\n**Exklusive Vergünstigungen:** Zugriff auf unser Corporate Benefits Portal mit zahlreichen Angeboten und Sonderkonditionen bei bekannten Partnern\n\n**Unser Bewerbungsprozess:**\n\nWir freuen uns über deine Bewerbung über unser Stellenportal. Nach der Prüfung deiner Unterlagen wartet ein dreistufiger Bewerbungsprozess auf dich. Dieser startet mit einem kurzen Telefonat mit unserer internen Recruiterin Nina, gefolgt von einer Coding Challenge. Anschließend findet ein Videocall mit Benedikt, Chief Technology Officer, sowie ein Videocall mit deinen zukünftigen Teamkolleg*innen statt. Wenn du gerne Teil dieser spannenden Reise sein und aktiv mitwirken willst, dann sende uns gerne deine Bewerbung.\n\nDu erreichst\n**Nina - Recruiterin im HR-Team** der\n**Arsipa Gruppe** – unter\n\n**Wir freuen uns auf Dich!**\n\noder\n\nBitte geben Sie Ihre Kontaktdaten an\n\n* International\n* AfghanistanAfghanistan\n\nLebenslauf hochladen\n\nLaden Sie Ihr Anschreiben hoch\n\nFast fertig! Wir haben ein paar weitere Fragen für Sie\n\nDatenschutz\n\n*\n\n#### Vielen Dank für Ihre Bewerbung!\n\nIhre Bewerbung wurde erfolgreich an uns versendet!",
    "apply_link": "https://arsipa.recruitee.com/o/quality-assurance-qa-engineer-wmd-1",
    "published_date": "January 19, 2026"
  },
  {
    "title": "Senior QA Engineer",
    "company": "CoolGames",
    "country": "Netherlands, Europe",
    "salary": "Undisclosed",
    "tags": "Git, GitHub, Playwright, Cypress, Java, JavaScript, TypeScript, Jenkins, Game",
    "description": "We are looking for a Senior QA Engineer who will contribute to the entire lifecycle of HTML5 casual game development - from inception to live maintenance. As a key player, you'll champion the delivery of top-notch products, becoming an integral part of an agile, multidisciplinary, and creatively charged game development team.\n\n#### About CoolGames\n\nAt CoolGames, we’re proud to be a leading international HTML5 game studio, working with some of the world’s biggest ‘Big Tech’ game platforms, such as Netflix, Discord, Facebook and Microsoft Play. We also work with famous games IP such as Battleship, Angry Birds and Monopoly.\n\nCoolGames is part of Keesing, the world’s largest Braintainment company. Keesing is a financially strong publisher of engaging sudokus, crosswords and many other puzzles & games with a presence in over 20 countries headquartered in The Netherlands.\n\nWith the CoolGames HQ in Amsterdam, supported by our global remote teams, we offer market-competitive salaries, the chance to contribute to successful casual games that are played by millions and work directly with some of the biggest brands in the world. We believe in creativity, collaboration and delivering world-class gaming experiences, while giving you the choice to either join our Amsterdam studio or become part of our remote teams.\n\nIf you want to grow your career in a profitable, internationally recognized company, work closely with world-famous partners and be part of a highly professional international team - CoolGames is the right place for you.\n\n#### About the role\n\nAs a QA Engineer at CoolGames, you take responsibility for delivering high quality products. Your teamwork will be fundamental to the success of the products you work on. During a workday you might be testing, building and maintaining automated tests to speed up regression,  reviewing requirements, drafting test cases or collaborating with teammates to figure out tricky bugs among other things.\n\nYour responsibilities will include:\n\n* Testing games manually (black box testing);\n* Identify and track project issues;\n* Pay attention to user experience, gameplay mechanics, graphics, and audio elements to ensure a seamless gaming experience;\n* Participate in the planning and execution of QA activities throughout all phases of the sprint lifecycle;\n* Reviewing and analyzing game design documents and functional specifications;\n* Creating test documentation (test plans, traceability matrix, test cases, checklists, test reports);\n* Designing, implementing, and maintaining automated testing suites using tools like Playwright;\n* Facilitating smooth releases and collaboration with a team;\n* Provide feedback and suggestions to improve quality and game experience.\n\n### Requirements\n\n#### About you\n\nYou like to troubleshoot technical problems and try to get to the root of why weird error messages come up. You are proactive and used to taking ownership and responsibility. You are not afraid of information analysis. You see yourself as a good team player.\n\n* Good written and verbal communications skills in English - ability to describe identified issues in a clear and concise manner;\n* At least 5 years of relevant experience in software testing (gamedev is a strong plus);\n* A methodical, scientific and analytical mindset;\n* Knowledgeable about SDLC and STLC;\n* Expert in Test Design techniques and their applicability on practice;\n* Strong Knowledge about Testing types and levels and their applicability;\n* Experience with Agile development methodologies, processes and tools;\n* Experience with multiple platforms (mobile, desktop, web, social platforms);\n* Experience with Jira or similar software;\n* Experience with TestRail or similar software;\n* Proven Flexibility to adapt to changes in project requirements;\n* Good organizational skills;\n* Work your shifts (mostly) in concurrence with the rest of the team to ensure smooth collaboration.\n\nWill be a strong plus:\n\n* Certification like ISTQB;\n* Test automation experience: ability to write, review, and debug end-to-end automated tests;\n* Proficiency with at least one modern programming language with a preference for JavaScript/TypeScript;\n* Familiarity with Playwright/Cypress/WebdriverIO or another web test automation tool;\n* Experience with version control and CI integration (Jenkins/GitHub/GitLab).\n\n### Benefits\n\n#### What we can offer you:\n\n* An international team of 50+ professionals from almost 20 different countries;\n* Work closely with some of the biggest (upcoming) game platforms in the world on high-quality casual games that are played by millions of gamers;\n* Competitive remuneration;\n* A flexible remote working environment;\n* A very open, informal and international company culture where everyone can make a difference.",
    "apply_link": "https://apply.workable.com/coolgames/j/90CC46A78C",
    "published_date": "January 19, 2026"
  },
  {
    "title": "Senior QA Automation Engineer (JavaScript) Quality Assurance",
    "company": "Emergn",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "Azure, Git, Playwright, Cypress, Cucumber, Java, JavaScript, TypeScript, SQL",
    "description": "### We want you to:\n\n* Working as part of an agile team following Value, Flow, Quality guideline principles and practices to provide business value to our customers\n* Play a significant role in creating and maintaining test suites.\n* Provide technical support and participate in developing new solutions, following Agile and Scrum best practices.\n* Perform manual testing as well as craft automatic testing.\n* Participate in sprint planning meetings – gather information about requirements and translate functional documentation into Test sets.\n\n### This job might be for you if you have:\n\n* At least 5 years of experience in automation testing.\n* Strong analytical skills and attention to detail.\n* Knowledge of basic black-box test design techniques.\n* Experience with Version Control Systems such as Git, and Subversion.\n* Knowledge of SQL and Relational Databases.\n* Experience with automated web testing using frameworks and tools such as Playwright, Cucumber, Jasmine, and Cypress.\n* REST API testing experience.\n* Basic development skills using JavaScript, Node.js, and Typescript.\n* Good communication skills in English.\n\n* Experience with with Azure ecosystem and knowledge of Azure OpenAI and related AI services.\n* Experience in creating testing strategy, planning, and test plan development.\n\n### What we offer:\n\n* Salary from 2,800 – 4,000 EUR gross/month.\n* Work within a dynamic international team of experts\n* Excellent opportunity for personal and professional development\n* Flexible work model and the freedom to choose the tools that suit you best – Mac or Windows\n* Ability to work with modern technologies\n* Extensive catalogue of educational programs, the possibility of training and certification at the expense of the company\n* 20 working days of vacation per year\n* Life and disability insurance\n* Health insurance\n* Big free parking\n* Birthday gift\n\n### About Emergn",
    "apply_link": "https://emergn.pinpointhq.com/en/postings/3433f956-b18d-446a-87cd-1b1c6e527f34",
    "published_date": "January 16, 2026"
  },
  {
    "title": "Senior QA Engineer (f/m/x)",
    "company": "Deutsche Bank",
    "country": "Romania, Europe",
    "salary": "Undisclosed",
    "tags": "Kubernetes, Selenium, JMeter, Cucumber, Rest Assured, Java, Postman",
    "description": "### Job Description:\n\nDB Global Technology is Deutsche Bank’s technology centre in Central and Eastern Europe. Since its set-up in 2013, Bucharest Technology Centre (BEX) has constantly proven its capacity to deliver global technology products and services, playing a dynamic role in the Bank’s technology transformation.\n\nWe have a robust, hands-on engineering culture dedicated to continuous learning, knowledge-sharing, technical skill development and networking. We are an essential part of the Bank’s technology platform and develop applications for many important business areas.\n\nDeutsche Bank is renewing its workflow automation technology. DBFlow it’s a new platform aiming at simplifying business processes interactions and automation by using modern technologies specific to this domain.\n\nThe core of the platform is managing all platform business processes and provides core functionalities, libraries, indexing, data enhancement and user interaction to onboarded use cases. The goal is to have high availability and high-performance platform infrastructure with focus on fast business adoption with low downtimes. Core technologies are Java, Camunda, Spring, Hibernate and Elasticsearch deployed on OpenShift/Kubernetes environments and automated by E2E CI/CD pipelines.\n\nThe QA Automation Engineer is responsible for managing or performing work across multiple areas of the bank's overall Workflow platform including analysis, development, and administration. Work includes plan and develop engineering solutions to accomplish business goals, build reliability and resiliency into solutions with appropriate testing and reviewing throughout the delivery lifecycle, ensure maintainability and reusability of engineering.\n\nResponsibilities\n\n* Ability to plan and implement the full set of test automation activities: create, maintain, and execute automated tests, extend the existing frameworks. Perform load and performance testing.\n* Provide input to the project plan/release plan, defect/change management processes, systems integration, testing tools and processes.\n* Gather of testing requirements and syncing between IT and Business teams. Assist IT application team in achieving quality product by identifying defects and deficiencies.\n* Identify areas of weakness to existing procedures, continually implement new procedures, and assess risk of impact from changes to projects.\n* Perform manual testing when required by the application or time constraints.\n\nSkills\n\n* Automation framework tools: Selenium, Cucumber, BDD, Serenity, Rest Assured, CI/CD solutions or similar.\n* Proficient coding skills with Java (nice to have: Design Patterns, Spring, SpringBoot)\n* Excellent skills of backend testing (e.g. API Testing, Postman). Ability to perform load and performance testing (e.g. with JMeter).\n* Excellent skills in test planning, designing, and test strategy/case/script creation and execution.\n* Experience with integration & regressions testing and coordination with supporting systems.\n\nWell-being & Benefits\n\nEmotionally and mentally balanced:\n\n* Empowering managers who value your ideas and decisions. Show your positive attitude, determination, and open-mindedness.\n* A professional, passionate, and fun workplace with flexible Work from Home options.\n* A modern office with fun and relaxing areas to boost creativity.\n* Continuous learning culture with coaching and support from team experts.\n\nPhysically thriving:\n\n* Private healthcare and life insurance with premium benefits for you and discounts for your loved ones.\n\nSocially connected:\n\n* Enjoy retailer discounts, cultural and CSR activities, employee sport clubs, workshops, and more.\n\nFinancially secure:\n\n* Competitive income, performance-based promotions, and a sense of purpose.\n* 24 days holiday, loyalty days, and bank holidays (including weekdays for weekend bank holidays).\n\nWe strive for a\nculture\nin which we are empowered to excel together every day. This includes acting responsibly, thinking commercially, taking initiative and working collaboratively.\n\nTogether we share and celebrate the successes of our people. Together we are Deutsche Bank Group.\n\nWe welcome applications from all people and promote a positive, fair and inclusive work environment.\n\nWe strive for a\nculture\nin which we are empowered to excel together every day. This includes acting responsibly, thinking commercially, taking initiative and working collaboratively.\n\nTogether we share and celebrate the successes of our people. Together we are Deutsche Bank Group.\n\nWe welcome applications from all people and promote a positive, fair and inclusive work environment.",
    "apply_link": "https://db.wd3.myworkdayjobs.com/en-US/DBWebsite/job/Senior-QA-Engineer--f-m-x-_R0413113",
    "published_date": "January 16, 2026"
  },
  {
    "title": "Senior Manual QA Engineer | Quorso, UK",
    "company": "GT",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Azure, Git, GitHub, Rails, React, SQL",
    "description": "**GT was founded in 2019 by a former Apple, Nest, and Google executive.**\n\n**Quorso** **Senior Manual QA Engineer.**\n\n### About the Client\n\n**Quorso**\n\nQuorso’s Intelligent Management Platform eliminates the complexity and overwhelm of too much data, too many tasks, and too many systems. By combining advanced technology with human-centric workflows, it consolidates siloed tools—tasks, surveys, performance analytics, exception reporting—into a comprehensive, action-focused platform that improves store performance at every level.\n\n**40,000 stores** **$180bn+ P&L**\n\n### About the Role\n\nThis role will suit well an entrepreneurial QA engineer who wants to own and build a function. You will own the full cycle of the QA process at Quorso.\n\n### Responsibilities:\n\n* Own all testing activities across the Quorso platform.\n* Manage the scope of each testing round together with the engineering team.\n* Perform testing of recurrent release candidates and hot fixes.\n* Define and maintain the regression testing scope.\n* Maintain testing configurations and ensure they stay aligned with the current platform state.\n* Maintain and manage test setups.\n* Become a subject matter expert for the platform.\n* Triage and manage issues reported from production.\n* Work closely with engineering, product management, and design teams.\n\nOwn all testing activities across the Quorso platform.\n\nManage the scope of each testing round together with the engineering team.\n\nPerform testing of recurrent release candidates and hot fixes.\n\nDefine and maintain the regression testing scope.\n\nMaintain testing configurations and ensure they stay aligned with the current platform state.\n\nMaintain and manage test setups.\n\nBecome a subject matter expert for the platform.\n\nTriage and manage issues reported from production.\n\nWork closely with engineering, product management, and design teams.\n\n### Essential knowledge, skills & experience:\n\n* Product-minded; eager to deeply understand platform logic and user workflows.\n* Strong attention to detail; able to spot subtle inconsistencies, especially in user experience.\n* Understanding of security implications in functionality (file uploads, XSS, SQL injection) to plan and stress-test accordingly.\n* Experience with cross-browser and cross-device testing.\n* Experience in API testing.\n* Proven experience in leading or actively contributing to QA processes, including:Participating in defining acceptance criteriaManaging release and hot-fix testingManaging regression testing scopeMaintaining testing configurations for each roundDocumenting and collecting evidence from each testing round\n* Participating in defining acceptance criteria\n* Managing release and hot-fix testing\n* Managing regression testing scope\n* Maintaining testing configurations for each round\n* Documenting and collecting evidence from each testing round\n\nProduct-minded; eager to deeply understand platform logic and user workflows.\n\nStrong attention to detail; able to spot subtle inconsistencies, especially in user experience.\n\nUnderstanding of security implications in functionality (file uploads, XSS, SQL injection) to plan and stress-test accordingly.\n\nExperience with cross-browser and cross-device testing.\n\nExperience in API testing.\n\nProven experience in leading or actively contributing to QA processes, including:\n\nParticipating in defining acceptance criteria\n\nManaging release and hot-fix testing\n\nManaging regression testing scope\n\nMaintaining testing configurations for each round\n\nDocumenting and collecting evidence from each testing round\n\n### Nice-to-have\n\n* Accessibility testing experience.\n* Experience with test management tools (BrowserStack, Xray, TestRail, etc.).\n* Experience working with Rails / React stack (web, background jobs, SPA/PWA).\n* Understanding of how RDBMS operate and core principles.\n* Knowledge of Azure or AWS cloud services.\n* Experience with GitHub Actions or CircleCI.\n* Experience with exception tracking tools.\n* Experience with monitoring services, including RUM.\n\nAccessibility testing experience.\n\nExperience with test management tools (BrowserStack, Xray, TestRail, etc.).\n\nExperience working with Rails / React stack (web, background jobs, SPA/PWA).\n\nUnderstanding of how RDBMS operate and core principles.\n\nKnowledge of Azure or AWS cloud services.\n\nExperience with GitHub Actions or CircleCI.\n\nExperience with exception tracking tools.\n\nExperience with monitoring services, including RUM.\n\n### Interview Steps\n\nGT interview with Recruiter\n\nTechnical interview\n\nFinal interview\n\nReference check\n\n### \n\n### Quorso's Benefits:\n\n* 24 days of vacation + 3 extra days off during the December Christmas closure;\n* Sick leaves - up to 10 business days per year (may be extended depending on the circumstances);\n* Public holidays according to your local legislation;\n* Compensation of medical and dental insurance after a successful evaluation period;\n* Compensation of Optional Gym Membership after a successful evaluation period;\n* Family-friendly policies (parental leaves, etc.);\n* Internal and external training;\n* Top-of-the-range IT kit.\n\n24 days of vacation + 3 extra days off during the December Christmas closure;\n\nSick leaves - up to 10 business days per year (may be extended depending on the circumstances);\n\nPublic holidays according to your local legislation;\n\nCompensation of medical and dental insurance after a successful evaluation period;\n\nCompensation of Optional Gym Membership after a successful evaluation period;\n\nFamily-friendly policies (parental leaves, etc.);\n\nInternal and external training;\n\nTop-of-the-range IT kit.",
    "apply_link": "https://jobs.ashbyhq.com/gt-hq/db233771-5b92-48af-933e-b1504d210ceb",
    "published_date": "January 15, 2026"
  },
  {
    "title": "QA Tester",
    "company": "Tester Work",
    "country": "Ukraine, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "**Tester Work** provides access to exciting and rewarding project-based opportunities for freelancers. Learn new skills and earn money by testing world-class apps and websites.\n\n🌎 For this specific project,\n**we are looking for QA testers and tech-enthusiasts in Ukraine!**\n\n* Test Case Executions:Perform a set of flows using specific instructions and compare the results observed with the expected/intended results provided;\n* Functional Exploratory Test Cases:Explore the application or website’s functionality based on your experience and background in testing;\n* Usability Test Cycles:Completing surveys or taking part in interviews to look into your preferences and opinions regarding different types of applications for our customers. Questionnaires investigate how you use specific apps, how much time you spend on them, and what you like and dislike about particular features and products.\n\nPerform a set of flows using specific instructions and compare the results observed with the expected/intended results provided;\n\nExplore the application or website’s functionality based on your experience and background in testing;\n\nCompleting surveys or taking part in interviews to look into your preferences and opinions regarding different types of applications for our customers. Questionnaires investigate how you use specific apps, how much time you spend on them, and what you like and dislike about particular features and products.\n\nPayments are transferred within a maximum of two weeks of project completion, via PayPal, bank transfers via Wise or Upwork.Don’t miss out on this exciting opportunity to develop new skills and earn good money on a schedule that suits you!﻿\n\nor\n\nFill out the information below\n\nPlease fill in additional questions\n\n*\n\n#### All done!\n\nYour application has been successfully submitted!",
    "apply_link": "https://testerwork.recruitee.com/o/qa-testers-wanted-in-ukraine",
    "published_date": "January 14, 2026"
  },
  {
    "title": "QA Engineer / Senior QA Engineer – Machine Learning Platform for E-Commerce",
    "company": "Elite E-Commerce",
    "country": "Germany, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Microservices, Git, Appium, Playwright, Cypress, Python, TypeScript, React, SQL, Machine Learning",
    "description": "AppIQ Tech is seeking a meticulous and strategic QA Engineer / Sr. QA Engineer to ensure the quality and reliability of our Machine-Learning-driven e-commerce funnel optimisation and digital advertising platform.\n\nYou will be responsible for defining the testing strategy for high-performance applications that leverage our proprietary Predictive AI solutions.\n\nAs a key member of our fast-paced startup, you will balance the need for rapid feature deployment with the necessity of thorough testing. You will be responsible for identifying and prioritising the highest-risk bugs to ensure our scalable services, which manage millions of daily events, remain robust and accurate.\n\n* QA Architecture & Strategy:Develop and maintain a comprehensive QA architecture that supports full-stack applications and complex microservices.\n\n* Risk Management:Prioritise bug fixes based on risk of failure and potential impact, while striking a productive balance between speed-to-market and exhaustive testing.\n\n* Test Management:Utilise test case management (TCM) systems such as TestRail, Zephyr, Xray, PractiTest, qTest, or similar to organise test cases, track execution, and provide transparent reporting on quality metrics.\n\n* Automated Testing:Design, implement, and scale automated test suites using tools such as Playwright, Cypress, and Appium.\n\n* Testing & Validation:Perform rigorous unit tests and integration tests on applications built with TypeScript, React, Node.js, Python, and PySpark.\n\n* Infrastructure Testing:Verify the reliability of deployments across AWS (EC2, S3, Firehose) and Cloudflare edge environments.\n\n* Data Integrity:Collaborate with Data Engineers to validate the accuracy of complex event data and real-time reporting dashboards.\n\n* Cross-Functional Collaboration:Act as a great team player with excellent communication skills, working closely with developers and data scientists to ensure a seamless end-user experience.\n\n### Requirements\n\n* 4+ years of professional experience in software quality assurance or engineering, with a strong focus on scalable web applications (7+years for Sr. QA Engineer).\n\n* Strong grasp of QA architecture and modern testing methodologies.\n\n* Deep expertise in the tech stack used by our engineers, specifically TypeScript, React, Node.js, Python, and PySpark.\n\n* Cloud & Database Proficiency: Familiarity with AWS services and both SQL and NoSQL (e.g., MongoDB) databases to effectively test data persistence and performance.\n\n* Global Collaboration: Ability to work effectively with globally distributed teams.\n* Native or Business-level proficiency in written and spoken English\n\n**Strong plus if you also have:**\n\n* AI/ML Literacy:Understanding of Machine Learning (Supervised/Reinforcement Learning), Predictive AI, and the validation of Data Pipelines.\n\n* Proficiency in Python or experience with PySpark.\n\n* Prior experience in the e-commerce or Ad Tech ecosystem (DSPs, Audience Data, Fraud detection).\n\n### Benefits\n\n* The opportunity to shape the QA culture and architecture from the ground up.\n\n* An attractive career path on either a management or an individual contributor track.\n* Genuine learning, training and development opportunities, supported by regular performance reviews\n\n* Competitive compensation and generous paid time off.\n\n* Work-from-anywhere flexibility\n\n* Opportunities to develop expertise in building cutting-edge predictive AI applications.",
    "apply_link": "https://apply.workable.com/appiq-tech/j/5CCC366EFB",
    "published_date": "January 14, 2026"
  },
  {
    "title": "Junior QA Engineer – Machine Learning Platform, E-Commerce",
    "company": "Elite E-Commerce",
    "country": "Germany, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Cypress, JavaScript, Microservices, Python, React, SQL, TypeScript",
    "description": "Elite E-Commerce is looking for Junior QA Engineer – Machine Learning Platform, E-Commerce",
    "apply_link": "https://apply.workable.com/appiq-tech/j/74BC15219D",
    "published_date": "January 14, 2026"
  },
  {
    "title": "Senior QA Engineer – Machine Learning Platform, E-Commerce",
    "company": "Elite E-Commerce",
    "country": "Germany, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Microservices, Git, Appium, Playwright, Cypress, Python, TypeScript, React, SQL, Machine Learning",
    "description": "AppIQ Tech is seeking a meticulous and strategic QA Engineer / Sr. QA Engineer to ensure the quality and reliability of our Machine-Learning-driven e-commerce funnel optimisation and digital advertising platform.\n\nYou will be responsible for defining the testing strategy for high-performance applications that leverage our proprietary Predictive AI solutions.\n\nAs a key member of our fast-paced startup, you will balance the need for rapid feature deployment with the necessity of thorough testing. You will be responsible for identifying and prioritising the highest-risk bugs to ensure our scalable services, which manage millions of daily events, remain robust and accurate.\n\n* QA Architecture & Strategy:Develop and maintain a comprehensive QA architecture that supports full-stack applications and complex microservices.\n\n* Risk Management:Prioritise bug fixes based on risk of failure and potential impact, while striking a productive balance between speed-to-market and exhaustive testing.\n\n* Test Management:Utilise test case management (TCM) systems such as TestRail, Zephyr, Xray, PractiTest, qTest, or similar to organise test cases, track execution, and provide transparent reporting on quality metrics.\n\n* Automated Testing:Design, implement, and scale automated test suites using tools such as Playwright, Cypress, and Appium.\n\n* Testing & Validation:Perform rigorous unit tests and integration tests on applications built with TypeScript, React, Node.js, Python, and PySpark.\n\n* Infrastructure Testing:Verify the reliability of deployments across AWS (EC2, S3, Firehose) and Cloudflare edge environments.\n\n* Data Integrity:Collaborate with Data Engineers to validate the accuracy of complex event data and real-time reporting dashboards.\n\n* Cross-Functional Collaboration:Act as a great team player with excellent communication skills, working closely with developers and data scientists to ensure a seamless end-user experience.\n\n### Requirements\n\n* 4+ years of professional experience in software quality assurance or engineering, with a strong focus on scalable web applications (7+years for Sr. QA Engineer).\n\n* Strong grasp of QA architecture and modern testing methodologies.\n\n* Deep expertise in the tech stack used by our engineers, specifically TypeScript, React, Node.js, Python, and PySpark.\n\n* Cloud & Database Proficiency: Familiarity with AWS services and both SQL and NoSQL (e.g., MongoDB) databases to effectively test data persistence and performance.\n\n* Global Collaboration: Ability to work effectively with globally distributed teams.\n* Native or Business-level proficiency in written and spoken English\n\n**Strong plus if you also have:**\n\n* AI/ML Literacy:Understanding of Machine Learning (Supervised/Reinforcement Learning), Predictive AI, and the validation of Data Pipelines.\n\n* Proficiency in Python or experience with PySpark.\n\n* Prior experience in the e-commerce or Ad Tech ecosystem (DSPs, Audience Data, Fraud detection).\n\n### Benefits\n\n* The opportunity to shape the QA culture and architecture from the ground up.\n\n* An attractive career path on either a management or an individual contributor track.\n* Genuine learning, training and development opportunities, supported by regular performance reviews\n\n* Competitive compensation and generous paid time off.\n\n* Work-from-anywhere flexibility\n\n* Opportunities to develop expertise in building cutting-edge predictive AI applications.",
    "apply_link": "https://apply.workable.com/appiq-tech/j/B2FEF94CFD",
    "published_date": "January 14, 2026"
  },
  {
    "title": "QA Engineer – Machine Learning Platform, E-Commerce",
    "company": "Elite E-Commerce",
    "country": "Germany, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Microservices, Git, Appium, Playwright, Cypress, Python, TypeScript, React, SQL, Machine Learning",
    "description": "AppIQ Tech is seeking a meticulous and strategic QA Engineer / Sr. QA Engineer to ensure the quality and reliability of our Machine-Learning-driven e-commerce funnel optimisation and digital advertising platform.\n\nYou will be responsible for defining the testing strategy for high-performance applications that leverage our proprietary Predictive AI solutions.\n\nAs a key member of our fast-paced startup, you will balance the need for rapid feature deployment with the necessity of thorough testing. You will be responsible for identifying and prioritising the highest-risk bugs to ensure our scalable services, which manage millions of daily events, remain robust and accurate.\n\n* QA Architecture & Strategy:Develop and maintain a comprehensive QA architecture that supports full-stack applications and complex microservices.\n\n* Risk Management:Prioritise bug fixes based on risk of failure and potential impact, while striking a productive balance between speed-to-market and exhaustive testing.\n\n* Test Management:Utilise test case management (TCM) systems such as TestRail, Zephyr, Xray, PractiTest, qTest, or similar to organise test cases, track execution, and provide transparent reporting on quality metrics.\n\n* Automated Testing:Design, implement, and scale automated test suites using tools such as Playwright, Cypress, and Appium.\n\n* Testing & Validation:Perform rigorous unit tests and integration tests on applications built with TypeScript, React, Node.js, Python, and PySpark.\n\n* Infrastructure Testing:Verify the reliability of deployments across AWS (EC2, S3, Firehose) and Cloudflare edge environments.\n\n* Data Integrity:Collaborate with Data Engineers to validate the accuracy of complex event data and real-time reporting dashboards.\n\n* Cross-Functional Collaboration:Act as a great team player with excellent communication skills, working closely with developers and data scientists to ensure a seamless end-user experience.\n\n### Requirements\n\n* 4+ years of professional experience in software quality assurance or engineering, with a strong focus on scalable web applications (7+years for Sr. QA Engineer).\n\n* Strong grasp of QA architecture and modern testing methodologies.\n\n* Deep expertise in the tech stack used by our engineers, specifically TypeScript, React, Node.js, Python, and PySpark.\n\n* Cloud & Database Proficiency: Familiarity with AWS services and both SQL and NoSQL (e.g., MongoDB) databases to effectively test data persistence and performance.\n\n* Global Collaboration: Ability to work effectively with globally distributed teams.\n* Native or Business-level proficiency in written and spoken English\n\n**Strong plus if you also have:**\n\n* AI/ML Literacy:Understanding of Machine Learning (Supervised/Reinforcement Learning), Predictive AI, and the validation of Data Pipelines.\n\n* Proficiency in Python or experience with PySpark.\n\n* Prior experience in the e-commerce or Ad Tech ecosystem (DSPs, Audience Data, Fraud detection).\n\n### Benefits\n\n* The opportunity to shape the QA culture and architecture from the ground up.\n\n* An attractive career path on either a management or an individual contributor track.\n* Genuine learning, training and development opportunities, supported by regular performance reviews\n\n* Competitive compensation and generous paid time off.\n\n* Work-from-anywhere flexibility\n\n* Opportunities to develop expertise in building cutting-edge predictive AI applications.",
    "apply_link": "https://apply.workable.com/appiq-tech/j/AF60897F3E",
    "published_date": "January 14, 2026"
  },
  {
    "title": "QA Engineer – Machine Learning Platform, E-Commerce",
    "company": "Elite E-Commerce",
    "country": "Romania, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Cypress, JavaScript, Microservices, Python, React, SQL, TypeScript",
    "description": "Elite E-Commerce is looking for QA Engineer – Machine Learning Platform, E-Commerce",
    "apply_link": "https://apply.workable.com/appiq-tech/j/5393B45CED",
    "published_date": "January 14, 2026"
  },
  {
    "title": "Junior QA Engineer – Machine Learning Platform",
    "company": "Elite E-Commerce",
    "country": "Romania, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Cypress, JavaScript, Microservices, Python, React, SQL, TypeScript",
    "description": "Elite E-Commerce is looking for Junior QA Engineer – Machine Learning Platform",
    "apply_link": "https://apply.workable.com/appiq-tech/j/655D4BD5E1",
    "published_date": "January 14, 2026"
  },
  {
    "title": "Senior QA Engineer – Machine Learning Platform",
    "company": "Elite E-Commerce",
    "country": "Romania, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Cypress, JavaScript, Microservices, Python, React, SQL, TypeScript",
    "description": "Elite E-Commerce is looking for Senior QA Engineer – Machine Learning Platform",
    "apply_link": "https://apply.workable.com/appiq-tech/j/BDA3868A41",
    "published_date": "January 14, 2026"
  },
  {
    "title": "Senior Manual QA Engineer",
    "company": "GT",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Azure, Git, GitHub, Rails, React, SQL",
    "description": "**GT was founded in 2019 by a former Apple, Nest, and Google executive.**\n\n**Quorso** **Senior Manual QA Engineer.**\n\n### About the Client\n\n**Quorso**\n\nQuorso’s Intelligent Management Platform eliminates the complexity and overwhelm of too much data, too many tasks, and too many systems. By combining advanced technology with human-centric workflows, it consolidates siloed tools—tasks, surveys, performance analytics, exception reporting—into a comprehensive, action-focused platform that improves store performance at every level.\n\n**40,000 stores** **$180bn+ P&L**\n\n### About the Role\n\nThis role will suit well an entrepreneurial QA engineer who wants to own and build a function. You will own the full cycle of the QA process at Quorso.\n\n### Responsibilities:\n\n* Own all testing activities across the Quorso platform.\n* Manage the scope of each testing round together with the engineering team.\n* Perform testing of recurrent release candidates and hot fixes.\n* Define and maintain the regression testing scope.\n* Maintain testing configurations and ensure they stay aligned with the current platform state.\n* Maintain and manage test setups.\n* Become a subject matter expert for the platform.\n* Triage and manage issues reported from production.\n* Work closely with engineering, product management, and design teams.\n\nOwn all testing activities across the Quorso platform.\n\nManage the scope of each testing round together with the engineering team.\n\nPerform testing of recurrent release candidates and hot fixes.\n\nDefine and maintain the regression testing scope.\n\nMaintain testing configurations and ensure they stay aligned with the current platform state.\n\nMaintain and manage test setups.\n\nBecome a subject matter expert for the platform.\n\nTriage and manage issues reported from production.\n\nWork closely with engineering, product management, and design teams.\n\n### Essential knowledge, skills & experience:\n\n* Product-minded; eager to deeply understand platform logic and user workflows.\n* Strong attention to detail; able to spot subtle inconsistencies, especially in user experience.\n* Understanding of security implications in functionality (file uploads, XSS, SQL injection) to plan and stress-test accordingly.\n* Experience with cross-browser and cross-device testing.\n* Experience in API testing.\n* Proven experience in leading or actively contributing to QA processes, including:Participating in defining acceptance criteriaManaging release and hot-fix testingManaging regression testing scopeMaintaining testing configurations for each roundDocumenting and collecting evidence from each testing round\n* Participating in defining acceptance criteria\n* Managing release and hot-fix testing\n* Managing regression testing scope\n* Maintaining testing configurations for each round\n* Documenting and collecting evidence from each testing round\n\nProduct-minded; eager to deeply understand platform logic and user workflows.\n\nStrong attention to detail; able to spot subtle inconsistencies, especially in user experience.\n\nUnderstanding of security implications in functionality (file uploads, XSS, SQL injection) to plan and stress-test accordingly.\n\nExperience with cross-browser and cross-device testing.\n\nExperience in API testing.\n\nProven experience in leading or actively contributing to QA processes, including:\n\nParticipating in defining acceptance criteria\n\nManaging release and hot-fix testing\n\nManaging regression testing scope\n\nMaintaining testing configurations for each round\n\nDocumenting and collecting evidence from each testing round\n\n### Nice-to-have\n\n* Accessibility testing experience.\n* Experience with test management tools (BrowserStack, Xray, TestRail, etc.).\n* Experience working with Rails / React stack (web, background jobs, SPA/PWA).\n* Understanding of how RDBMS operate and core principles.\n* Knowledge of Azure or AWS cloud services.\n* Experience with GitHub Actions or CircleCI.\n* Experience with exception tracking tools.\n* Experience with monitoring services, including RUM.\n\nAccessibility testing experience.\n\nExperience with test management tools (BrowserStack, Xray, TestRail, etc.).\n\nExperience working with Rails / React stack (web, background jobs, SPA/PWA).\n\nUnderstanding of how RDBMS operate and core principles.\n\nKnowledge of Azure or AWS cloud services.\n\nExperience with GitHub Actions or CircleCI.\n\nExperience with exception tracking tools.\n\nExperience with monitoring services, including RUM.\n\n### Interview Steps\n\nGT interview with Recruiter\n\nTechnical interview\n\nFinal interview\n\nReference check\n\n### \n\n### Quorso's Benefits:\n\n* 24 days of vacation + 3 extra days off during the December Christmas closure;\n* Sick leaves - up to 10 business days per year (may be extended depending on the circumstances);\n* Public holidays according to your local legislation;\n* Compensation of medical and dental insurance after a successful evaluation period;\n* Compensation of Optional Gym Membership after a successful evaluation period;\n* Family-friendly policies (parental leaves, etc.);\n* Internal and external training;\n* Top-of-the-range IT kit.\n\n24 days of vacation + 3 extra days off during the December Christmas closure;\n\nSick leaves - up to 10 business days per year (may be extended depending on the circumstances);\n\nPublic holidays according to your local legislation;\n\nCompensation of medical and dental insurance after a successful evaluation period;\n\nCompensation of Optional Gym Membership after a successful evaluation period;\n\nFamily-friendly policies (parental leaves, etc.);\n\nInternal and external training;\n\nTop-of-the-range IT kit.",
    "apply_link": "https://jobs.ashbyhq.com/gt-hq/db233771-5b92-48af-933e-b1504d210ceb",
    "published_date": "January 14, 2026"
  },
  {
    "title": "QA Tester, Automatización",
    "company": "Expleo Group",
    "country": "Spain, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Expleo Group is looking for QA Tester, Automatización",
    "apply_link": "https://expleo-jobs-es-en.icims.com/jobs/49415/qa-tester-con-experiencia-en-automatizaci%c3%b3n/job?in_iframe=1",
    "published_date": "January 14, 2026"
  },
  {
    "title": "Junior QA Engineer (Hungary)",
    "company": "Sophos",
    "country": "Hungary, Europe",
    "salary": "Undisclosed",
    "tags": "Python",
    "description": "Sophos is looking for Junior QA Engineer (Hungary)",
    "apply_link": "https://jobs.lever.co/sophos/42ef52f1-da8b-447e-a56d-20751a0a289b",
    "published_date": "January 13, 2026"
  },
  {
    "title": "Creative Tech | QA Automation",
    "company": "Devoteam",
    "country": "Portugal, Europe",
    "salary": "Undisclosed",
    "tags": "iOS, Git, Selenium, Playwright, Cypress, Java, JavaScript, SQL, PostgreSQL",
    "description": "At Devoteam, we believe that technology with strong human values can actively drive change for the better. Discover how Tech for People unlocks the future, creating a positive impact on the people and the world around us. We are a global leading player in Digital Transformation for leading organisations across EMEA, with a revenue of €1B. We believe in transforming technology to create value for our clients, partners and employees in a world where technology is developed for people. We are proud of the culture we have built together. We are proud of our people at the service of technology. We are proud of our diverse environment. Because we are #TechforPeople. Join our multidisciplinary team of Cloud experts, Designers, Business consultants, Security experts, Engineers, Developers and other extraordinary talents, spread across more than 20 EMEA countries. Become one of our +10.000 tech and business leaders on cloud, data and cyber security. Let’s fuse creativity with technology together and build innovative solutions that actively change things for the better.\n\n### Job Description\n\n* Collaborate closely with the product team (functional tester, PO, Dev);\n* Design, develop, and maintain automated test scripts to validate functionality, performance, and security aspects of software applications;\n* Implement and enhance automated test frameworks to improve test efficiency and coverage;\n* Collaborate with the development team to integrate automated testing into the continuous integration/continuous deployment (CI/CD) pipeline;\n* Contribute to the creation and maintenance of test data, ensuring realistic and diverse scenarios are covered;\n* Execute automated test scripts and analyze results to identify defects, performance issues, and areas for improvement;\n* Report and track defects using designated tools, providing detailed information for developers to facilitate efficient issue resolution;\n* Collaborate with the development team to verify bug fixes and ensure the successful closure of reported issues;\n* Create and maintain documentation related to automated test scripts, frameworks, and testing processes;\n* Provide training and support to team members on test automation best practices.\n\n### Qualifications\n\nHard Skills:\n\n* At least 3 years of experience testing digital products.\n* Solid technical background in software development and testing principles.\n* Proven experience as an Automation Tester.\n* Autonomous in developing automated test projects.\n* Proficient in developing, maintaining, and executing automated tests for both BE and FE.\n* Comfortable with technologies such as: Java, JavaScript, Angular, and PostgreSQL.\n* Experience in web automation (Cypress and Playwright preferred, Selenium a plus) and API testing.\n\nSoft Skills:\n\n* Dynamic and a fast learner.\n* Autonomous with strong prioritization skills.\n* Collaborative with product teams (Functional QA, PO, Dev).\n* Good communication skills in Portuguese and English.\n* Team player.\n\n### Additional Information\n\nThe Devoteam Group works for equal opportunities, promoting its employees based on merit and actively fights against all forms of discrimination. We are convinced that diversity contributes to the creativity, dynamism and excellence of our organization. All of our vacancies are open to people with disabilities.\n\n### Job Location",
    "apply_link": "https://jobs.smartrecruiters.com/Devoteam/744000103045135",
    "published_date": "January 13, 2026"
  },
  {
    "title": "Software Quality Engineer – OpenShift Virtualization",
    "company": "Red Hat",
    "country": "Czech Republic, Europe",
    "salary": "Undisclosed",
    "tags": "Kubernetes, PyTest, Python",
    "description": "The OpenShift Virtualization team is looking for a Software Quality Engineer. In this role, you will work on industry-leading technologies such as Red Hat OpenShift, KubeVirt, Libvirt, and Qemu to ensure that we produce the highest quality virtual machine storage capabilities. You'll be responsible for all aspects of quality for Red Hat OpenShift Virtualization, including designing test plans, extending automation frameworks, and developing new automated tests. You will make sure our solutions fulfill the highest possible enterprise quality, performance, usability, and supportability. As a Software Quality Engineer, you will gain a deep technical understanding of a variety of popular technologies, including Virtualization, containers, Kubernetes, Red Hat OpenShift, and enterprise storage systems.\n\nYou will be a part of Red Hat’s culture that makes us unique in the Industry, enriched with\n\nRegardless of your role and designation, you will have the freedom to showcase your leadership skills and ability to bring innovative solutions to complex problems at any level that will help you get wider visibility in our organization.\n\nWhat you will do:\n\n* Design, develop, and maintain automation in Python with Pytest framework for OpenShift Virtualization testing and implementation.\n* Research new features, design test plans, and write test cases.\n* Execute manual and automated tests for OpenShift Virtualization and deliver clear status in a timely manner.\n* Conduct failure analysis, explore, identify, and document new bugs, advocate for the resolution of bugs, and communicate the impact on customers.\n* Coordinate cross-component teams to be responsible for bug verification, and regression testing.\n* Work in a fast-paced Agile global environment of talented Quality Engineers\n* Constantly learn new things and maintain an overview of current technologies.\n* Provide mentoring and leadership to junior Quality Engineers\n\nWhat you will bring:\n\n* 2+ years of experience automating test cases in Python with Pytest framework.\n* 2+ years of professional experience working in QE or similar roles.\n* Bachelor's degree (or higher, or equivalent in computer science or a related field).\n* Experience working with globally distributed team members.\n* Knowledge of testing methodologies and techniques.\n* Knowledge of the Linux operating system (any distribution).\n* Familiarity with Virtualization platforms and concepts.\n* Familiarity with Storage concepts (SAN, NAS), and storage APIs (clone snapshot, attach, detach)\n* Solid written and verbal communication skills in English\n\nAbout Red Hat\n\nis the world’s leading provider of enterprise\nsoftware solutions, using a community-powered approach to deliver high-performing Linux, cloud, container, and Kubernetes technologies. Spread across 40+ countries, our associates work flexibly across work environments, from in-office, to office-flex, to fully remote, depending on the requirements of their role. Red Hatters are encouraged to bring their best ideas, no matter their title or tenure. We're a leader in open source because of our open and inclusive environment. We hire creative, passionate people ready to contribute their ideas, help solve complex problems, and make an impact.\n\n#### Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.\n\n#### Red Hat supports individuals with disabilities and provides reasonable accommodations to job applicants. If you need assistance completing our online job application, emailapplication-assistance@redhat.com. General inquiries, such as those regarding the status of a job application, will not receive a reply.",
    "apply_link": "https://redhat.wd5.myworkdayjobs.com/jobs/job/brno---tech-park-brno---b/software-quality-engineer---openshift-virtualization--emea-_r-053590",
    "published_date": "January 12, 2026"
  },
  {
    "title": "Senior Automation QA",
    "company": "Newxel",
    "country": "Ukraine, Europe",
    "salary": "Undisclosed",
    "tags": "Docker, iOS, Git, Selenium, JUnit, Cucumber, Java, Jenkins, Postman",
    "description": "**Automation QA Engineer**\n\n* Design, develop, and execute automated test scripts using Java, Selenium, and related frameworks\n* Collaborate with cross-functional teams to define test scenarios, test cases, and acceptance criteria\n* Identify, document, and report bugs while working closely with developers to ensure timely resolution\n* Maintain and enhance existing test automation frameworks and infrastructure\n* Conduct code reviews and provide constructive feedback on automation practices\n* Integrate automated tests into CI/CD pipelines (Jenkins, GitLab CI, or similar)\n* Generate and present detailed test reports with insights on quality and stability\n* Perform RESTful API testing using Postman, RestAssured, or similar tools\n* Troubleshoot and debug automation issues to ensure quick resolution\n* Stay current with the latest QA automation trends and best practices.\n\nDesign, develop, and execute automated test scripts using Java, Selenium, and related frameworks\n\nCollaborate with cross-functional teams to define test scenarios, test cases, and acceptance criteria\n\nIdentify, document, and report bugs while working closely with developers to ensure timely resolution\n\nMaintain and enhance existing test automation frameworks and infrastructure\n\nConduct code reviews and provide constructive feedback on automation practices\n\nIntegrate automated tests into CI/CD pipelines (Jenkins, GitLab CI, or similar)\n\nGenerate and present detailed test reports with insights on quality and stability\n\nPerform RESTful API testing using Postman, RestAssured, or similar tools\n\nTroubleshoot and debug automation issues to ensure quick resolution\n\nStay current with the latest QA automation trends and best practices.\n\n* 3-5 years of experience in test automation (mobile + web + backend)\n* Strong proficiency in Java, with frameworks such as Selenium, TestNG, JUnit\n* Hands-on experience in API testing (Postman, RestAssured, or equivalent)\n* Knowledge of BDD tools (Cucumber or similar)\n* Experience with CI/CD pipelines (Jenkins, GitLab CI)\n* Familiarity with Docker for managing test environments\n* Proficiency with Git or other version control systems\n* Understanding of Agile methodologies and QA best practices\n* Strong problem-solving, debugging, and troubleshooting skills\n* Excellent communication and collaboration skills\n* Bachelor’s degree in Computer Science, Engineering, or related field.\n\n3-5 years of experience in test automation (mobile + web + backend)\n\nStrong proficiency in Java, with frameworks such as Selenium, TestNG, JUnit\n\nHands-on experience in API testing (Postman, RestAssured, or equivalent)\n\nKnowledge of BDD tools (Cucumber or similar)\n\nExperience with CI/CD pipelines (Jenkins, GitLab CI)\n\nFamiliarity with Docker for managing test environments\n\nProficiency with Git or other version control systems\n\nUnderstanding of Agile methodologies and QA best practices\n\nStrong problem-solving, debugging, and troubleshooting skills\n\nExcellent communication and collaboration skills\n\nBachelor’s degree in Computer Science, Engineering, or related field.\n\n* Competitive salary and benefits package\n* Medical insurance\n* Full Remote\n* Collaborative and innovative work environment\n* Career growth and development opportunities\n* A chance to work with a talented and driven team of professional\n\nCompetitive salary and benefits package\n\nMedical insurance\n\nFull Remote\n\nCollaborative and innovative work environment\n\nCareer growth and development opportunities\n\nA chance to work with a talented and driven team of professional\n\nOur client is building a cloud-first platform that helps global infrastructure providers manage and scale electric charging networks with ease. The system supports 150,000+ connected devices, processes hundreds of millions of sessions monthly, and is trusted in over 30 countries. It offers modular tools for operations, billing, fleet coordination, and intelligent energy distribution — all built on open, integration-ready standards. The solution enables providers to expand their footprint, reduce costs, and deliver a seamless end-user",
    "apply_link": "https://jobs.ashbyhq.com/newxel/9638407b-6fc4-4225-b2b2-11b40aaf5aa8",
    "published_date": "January 12, 2026"
  },
  {
    "title": "QA Engineer – Machine Learning Platform for E-Commerce",
    "company": "Elite E-Commerce",
    "country": "Romania, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Microservices, Git, Appium, Playwright, Cypress, Python, TypeScript, React, SQL, Machine Learning",
    "description": "AppIQ Tech is seeking a meticulous and strategic QA Engineer / Sr. QA Engineer to ensure the quality and reliability of our Machine-Learning-driven e-commerce funnel optimisation and digital advertising platform.\n\nYou will be responsible for defining the testing strategy for high-performance applications that leverage our proprietary Predictive AI solutions.\n\nAs a key member of our fast-paced startup, you will balance the need for rapid feature deployment with the necessity of thorough testing. You will be responsible for identifying and prioritising the highest-risk bugs to ensure our scalable services, which manage millions of daily events, remain robust and accurate.\n\n* QA Architecture & Strategy:Develop and maintain a comprehensive QA architecture that supports full-stack applications and complex microservices.\n\n* Risk Management:Prioritise bug fixes based on risk of failure and potential impact, while striking a productive balance between speed-to-market and exhaustive testing.\n\n* Test Management:Utilise test case management (TCM) systems such as TestRail, Zephyr, Xray, PractiTest, qTest, or similar to organise test cases, track execution, and provide transparent reporting on quality metrics.\n\n* Automated Testing:Design, implement, and scale automated test suites using tools such as Playwright, Cypress, and Appium.\n\n* Testing & Validation:Perform rigorous unit tests and integration tests on applications built with TypeScript, React, Node.js, Python, and PySpark.\n\n* Infrastructure Testing:Verify the reliability of deployments across AWS (EC2, S3, Firehose) and Cloudflare edge environments.\n\n* Data Integrity:Collaborate with Data Engineers to validate the accuracy of complex event data and real-time reporting dashboards.\n\n* Cross-Functional Collaboration:Act as a great team player with excellent communication skills, working closely with developers and data scientists to ensure a seamless end-user experience.\n\n### Requirements\n\n* 4+ years of professional experience in software quality assurance or engineering, with a strong focus on scalable web applications (7+years for Sr. QA Engineer).\n\n* Strong grasp of QA architecture and modern testing methodologies.\n\n* Deep expertise in the tech stack used by our engineers, specifically TypeScript, React, Node.js, Python, and PySpark.\n\n* Cloud & Database Proficiency: Familiarity with AWS services and both SQL and NoSQL (e.g., MongoDB) databases to effectively test data persistence and performance.\n\n* Global Collaboration: Ability to work effectively with globally distributed teams.\n\n**Strong plus if you also have:**\n\n* AI/ML Literacy:Understanding of Machine Learning (Supervised/Reinforcement Learning), Predictive AI, and the validation of Data Pipelines.\n\n* Proficiency in Python or experience with PySpark.\n\n* Prior experience in the e-commerce or Ad Tech ecosystem (DSPs, Audience Data, Fraud detection).\n\n### Benefits\n\n* The opportunity to shape the QA culture and architecture from the ground up.\n\n* An attractive career path on either a management or an individual contributor track.\n* Genuine learning, training and development opportunities, supported by regular performance reviews\n\n* Competitive compensation and generous paid time off.\n\n* Work-from-anywhere flexibility\n\n* Opportunities to develop expertise in building cutting-edge predictive AI applications.",
    "apply_link": "https://apply.workable.com/appiq-tech/j/441984758F",
    "published_date": "January 12, 2026"
  },
  {
    "title": "Senior QA Engineer – Machine Learning Platform, E-Commerce",
    "company": "Elite E-Commerce",
    "country": "Germany, Europe",
    "salary": "Undisclosed",
    "tags": "AWS, Microservices, Git, Appium, Playwright, Cypress, Python, TypeScript, React, SQL, Machine Learning",
    "description": "AppIQ Tech is seeking a meticulous and strategic QA Engineer / Sr. QA Engineer to ensure the quality and reliability of our Machine-Learning-driven e-commerce funnel optimisation and digital advertising platform.\n\nYou will be responsible for defining the testing strategy for high-performance applications that leverage our proprietary Predictive AI solutions.\n\nAs a key member of our fast-paced startup, you will balance the need for rapid feature deployment with the necessity of thorough testing. You will be responsible for identifying and prioritising the highest-risk bugs to ensure our scalable services, which manage millions of daily events, remain robust and accurate.\n\n* QA Architecture & Strategy:Develop and maintain a comprehensive QA architecture that supports full-stack applications and complex microservices.\n\n* Risk Management:Prioritise bug fixes based on risk of failure and potential impact, while striking a productive balance between speed-to-market and exhaustive testing.\n\n* Test Management:Utilise test case management (TCM) systems such as TestRail, Zephyr, Xray, PractiTest, qTest, or similar to organise test cases, track execution, and provide transparent reporting on quality metrics.\n\n* Automated Testing:Design, implement, and scale automated test suites using tools such as Playwright, Cypress, and Appium.\n\n* Testing & Validation:Perform rigorous unit tests and integration tests on applications built with TypeScript, React, Node.js, Python, and PySpark.\n\n* Infrastructure Testing:Verify the reliability of deployments across AWS (EC2, S3, Firehose) and Cloudflare edge environments.\n\n* Data Integrity:Collaborate with Data Engineers to validate the accuracy of complex event data and real-time reporting dashboards.\n\n* Cross-Functional Collaboration:Act as a great team player with excellent communication skills, working closely with developers and data scientists to ensure a seamless end-user experience.\n\n### Requirements\n\n* 4+ years of professional experience in software quality assurance or engineering, with a strong focus on scalable web applications (7+years for Sr. QA Engineer).\n\n* Strong grasp of QA architecture and modern testing methodologies.\n\n* Deep expertise in the tech stack used by our engineers, specifically TypeScript, React, Node.js, Python, and PySpark.\n\n* Cloud & Database Proficiency: Familiarity with AWS services and both SQL and NoSQL (e.g., MongoDB) databases to effectively test data persistence and performance.\n\n* Global Collaboration: Ability to work effectively with globally distributed teams.\n\n**Strong plus if you also have:**\n\n* AI/ML Literacy:Understanding of Machine Learning (Supervised/Reinforcement Learning), Predictive AI, and the validation of Data Pipelines.\n\n* Proficiency in Python or experience with PySpark.\n\n* Prior experience in the e-commerce or Ad Tech ecosystem (DSPs, Audience Data, Fraud detection).\n\n### Benefits\n\n* The opportunity to shape the QA culture and architecture from the ground up.\n\n* An attractive career path on either a management or an individual contributor track.\n* Genuine learning, training and development opportunities, supported by regular performance reviews\n\n* Competitive compensation and generous paid time off.\n\n* Work-from-anywhere flexibility\n\n* Opportunities to develop expertise in building cutting-edge predictive AI applications.",
    "apply_link": "https://apply.workable.com/appiq-tech/j/776E73E3F2",
    "published_date": "January 12, 2026"
  },
  {
    "title": "Manual QA, Mobile",
    "company": "GoReel",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "Docker, Game, Postman",
    "description": "Our team provides quality assurance for mobile games developed by the company. We work closely with game designers, developers, and product stakeholders to ensure high quality, stability, and an engaging player experience across different mobile devices and operating system versions.\n\nWe continuously improve our QA processes step by step, focusing on efficient testing practices and product quality.\n\nWe are looking for a Manual QA team member who can perform manual testing of mobile games across different devices and operating system versions.\n\nWe work remotely, with formal meetings kept to a minimum — one weekly stand-up, and the rest scheduled based on work needs.\n\nOur focus is on maintaining a balance between game quality and business goals to ensure long-term project sustainability and a positive team atmosphere.\n\nWe strive to deliver games that we can truly be proud of :)\n\n### Requirements\n\n* 1+ year of experience in manual QA, preferably in the iGaming industry;\n\n* Experience in testing mobile applications on real devices and emulators;\n\n* Good problem-solving and debugging skills, with the ability to investigate and clearly describe issues;\n\n* Basic understanding of CI/CD processes;\n\n* Familiarity with Agile development processes;\n\n* Confident knowledge of Jira, TestRail, Confluence, Postman, and basic Unix shell commands;\n\n* Basic understanding of containerization technologies (e.g., Docker) is a plus;\n\n* English level: Intermediate;\n\n* Technical education background.\n\n#### Responsibilities\n\n* Communicate with product owners and developers to ensure alignment with project goals;\n* Participate in product development activities from early stages, providing QA feedback;\n* Identify, document, and track bugs throughout the development process;\n* Develop and maintain test cases, checklists, and bug reports;\n* Test the product across different mobile devices and operating system versions;\n* Collaborate effectively within the team, maintaining a proactive and results-driven approach;\n* Ensure accuracy, responsibility, and attention to detail in all testing activities.\n\n### Benefits\n\n**Why Join Us?**\n\n🎰 Be part of the international iGaming industry – Work with a top European solution provider and shape the future of online gaming;\n\n💕 A Collaborative Culture – Join a supportive and understanding team;\n\n💰 Competitive salary and bonus system – Enjoy additional rewards on top of your base salary;\n\n📆 Unlimited vacation & sick leave – Because we prioritize your well-being;\n\n📈 Professional Development – Access a dedicated budget for self-development and learning;\n\n🏥 Healthcare coverage – Available for employees in Ukraine and compensation across the EU;\n\n🫂 Mental health support – Free consultations with a corporate psychologist;\n\n🇬🇧 Language learning support – We cover the cost of foreign language courses;\n\n🎁 Celebrating Your Milestones – Special gifts for life’s important moments;\n\n⏳ Flexible working hours – Start your day anytime between 9:00-11:00 AM;\n\n🏢 Flexible Work Arrangements – Choose between remote, office, or hybrid work;\n\n🖥 Modern Tech Setup – Get the tools you need to perform at your best;\n\n🚚 Relocation support – Assistance provided if you move to one of our hubs.",
    "apply_link": "https://apply.workable.com/goreel/j/6E6367E2D9",
    "published_date": "January 12, 2026"
  },
  {
    "title": "Senior QA Engineer",
    "company": "Huel",
    "country": "United Kingdom, Europe",
    "salary": "Undisclosed",
    "tags": "TypeScript, Microservices",
    "description": "Huel is looking for Senior QA Engineer",
    "apply_link": "https://careers.huel.com/jobs/7026305-senior-qa-engineer",
    "published_date": "January 12, 2026"
  },
  {
    "title": "Manual QA Engineer",
    "company": "Fluxon",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "**Who we are**\n\nWe are Fluxon, a product development team founded by ex-Googlers and startup founders. We offer full-cycle software development: from ideation and design to build and go-to-market. We partner with visionary companies, ranging from fast-growing startups to tech leaders like Google and Stripe, to turn bold ideas into products with the power to transform the world.\n\nThe role is open to candidates based in Poland preferably in Krakow, Wroclaw or Gdansk.\n\n**About the role**\n\nAs a Manual QA Engineer at Fluxon, you’ll have the opportunity to design and implement testing processes across diverse applications. You’ll collaborate with the team that values innovation, integrity, and continuous growth.\n\nYou’ll be responsible for:\n\n* Defining end-to-end test strategy and processes for entire products, including suggesting appropriate tools to use\n* Planning and executing testing for quality and conformance to specifications and deliverables\n* Assisting project teams by tracking, documenting, and reporting on quality initiatives\n* Investigating reports of product quality issues and working collaboratively towards resolution\n* Being your products’ quality champion and evangelising QA best practices within your teams and our clients\n* Engaging directly with our clients to understand requirements, define what quality means, and debug complex issues\n* Learning fast while working independently and reliably\n\n**Qualifications**\n\n* Experienced QA engineer generalist with a dedication to product quality, familiar and open to a wide range of technologies\n* 5+ years of hands-on experience testing web or mobile applications, as well as APIs\n* 3+ years of experience in setting up testing processes from scratch, building and maintaining test documentation\n* Strong understanding of client - server architecture\n* Strong understanding of testing theory and SDLC\n* Basic understanding of CI/CD\n* Basic understanding of networking stack (DNS, TCP/IP, HTTP(S), SSH, etc)\n* Upper-Intermediate level of written and spoken English\n* Basic scripting experience (any modern programming language)\n* Pro-active personality, with a willingness to learn and contribute to test automation in case future needs arise\n* Familiarity with task estimation\n\n**What we offer**\n\n* Exposure to high-profile SV startups and enterprise companies\n* Competitive salary\n* Fully remote work with flexible hours\n* Flexible paid time off\n* Profit-sharing program\n* Healthcare\n* Parental leave, including adoption and fostering\n* Gym membership and tuition reimbursement\n* Hands-on career development",
    "apply_link": "https://job-boards.greenhouse.io/fluxon/jobs/4612915005",
    "published_date": "January 12, 2026"
  },
  {
    "title": "Consultant, Application Security, Penetration Tester",
    "company": "Coalfire",
    "country": "United Kingdom, Europe",
    "salary": "£63,000 - £72,810",
    "tags": "",
    "description": "Coalfire is looking for Consultant, Application Security, Penetration Tester",
    "apply_link": "https://jobs.lever.co/coalfire/a9dcb640-2889-48cb-a6d2-e3c9f1be0016",
    "published_date": "January 12, 2026"
  },
  {
    "title": "QA Engineer",
    "company": "Capital on Tap",
    "country": "Poland, Europe",
    "salary": "Undisclosed",
    "tags": "Azure, iOS, Appium, Selenium, Java, JavaScript, TypeScript, SQL, Postman",
    "description": "We’re Capital on Tap 👋\n💳 Capital on Tap was founded with the mission to help small business owners and make their lives easier. Today, we provide an all-in-one business credit card & spend management platform that helps business owners save time and money. Capital on Tap proudly serves over 200,000 businesses across the world and our goal is to help 1 million small businesses by 2030.\n\nWhy Join Us?\nWe empower you to be innovative and solve complex problems. Take ownership, make an impact, and thrive in our scaling and agile environment.\n\nThis is a B2B Contract 📃 position, working remotely 🏡 from Poland.\n\nWhat You'll Be DoingWe’re looking for a QA Engineer to join our team! You'd be responsible for both manual and automated testing as well as contributing to best practices throughout the SDLC working closely with our Software Engineers and Product Managers to provide governance and oversight of the quality of the products we develop. We're also big on running POCs to help improve various aspects of QA so there's plenty of interesting work to get stuck into!\n\n* Contributing to the ongoing development of automated test scenarios working as part of an agile team\n* Driving continuous improvement, recommending and implementing enhancements to test processes and procedures.\n* Investigating user problems referred to you by the Product teams, testing bugs, and creating and managing bug reports.\n* Developing a strong understanding of the products and domain to perform hands-on testing from a technical standpoint.\n* Supporting your engineering colleagues so that testing is a team-wide responsibility\n* Prioritising tasks and workload in a fast moving environment - good sense of urgency resourcefulness and independence\n* Managing risks and issues effectively with timely escalation to the project stakeholders\n* Reviewing design proposals, acceptance criteria and processes, and recommend improvements.\n\nWe’re Looking For 🔎Required skills:\n\n* Proven software quality assurance experience with a focus on both web and mobile applications\n* Experience developing tests for functional and regression testing that include manual, automated, performance and ad-hoc testing\n* Pragmatic when raising bugs and have a good understanding of risk, impact, dependencies and how to balance these\n* Understand the full E2E impact of changes, considering these in the QA strategy and approach\n* Experience with C# is preferable (or similar OOPs languages)\n* Experience with JavaScript/Typescript\n* Experience in using testing tools and frameworks such as, Selenium Webdriver, RestSharp, PostMan, Appium, xUnit, NUnit, etc\n* Experience working with and testing REST APIs\n* Experience working across multiple teams.\n* Understands CI/CD concepts and implement continuous testing practices\n* Excellent attention to detail and a methodical approach to testing\n* Understand the concept of checking against testing, strong knowledge of exploratory testing.\n* Bias for action and problem solving - eagerness to take initiative and make things happen\n* Proficient in SQL Server queries and scripting experience.\n\nNice to have skills:\n\n* Previous exposure to Microsoft Azure DevOps\n* Experience with usability best practices; able to influence and improve user experience\n* ISTQB certification desirable\n* Experience of working in a fintech company.\n\nDiversity & Inclusion🌈We welcome, consider, and encourage applications from anyone who shares our commitment to inclusivity. Join us in creating a space where authenticity thrives, and everyone can do their best work.\n\nInterview Process🤝First stage: 30-minute intro, CV review, and values with Talent Partner\n\n🤝Second stage: 45-minute “Tech Chat” with Team Manager\n\n🤝Final stage: 60-minute Code Pairing + 30-minute Interview with Engineering & Product\n\n**Other Info** 👍Check out our‘Top Tips’ for interviewing.\n✔️Keep updated on new job opportunities by following us onLinkedin.\n📧Emailcareers@capitalontap.comif you have any questions.\n\nExcited to work here? Apply!\nIf you’d like to progress your career within our fast growing, profitable fintech then click apply and we will aim to get back to you within 3 working days (during busy periods this could take up to 5 working days.)",
    "apply_link": "https://job-boards.greenhouse.io/capitalontap/jobs/7807915002",
    "published_date": "January 12, 2026"
  },
  {
    "title": "QA",
    "company": "Ruby Labs",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at:\nhttps://rubylabs.com/about-us/\n\nWe’re looking for a hands-on Quality Assurance Engineer with strong manual testing experience to ensure our products meet the highest quality standards before release.\n\nYou’ll be responsible for validating functionality, UX/UI consistency, edge cases, and overall product stability across web and mobile environments. You’ll work closely with product, design, and engineering teams and play a key role in making sure features are ready for release from a quality standpoint.\n\nOver time, this role offers an opportunity to grow beyond pure QA and take on more responsibility around coordination, execution, and delivery ownership.\n\n* Perform thorough manual QA testing across web and mobile (UI, UX, logic, edge cases, responsiveness).\n* Validate product behavior against specs, designs, and expected user flows.\n* Identify, document, and clearly communicate bugs and inconsistencies.\n* Verify fixes and ensure issues are fully resolved before release.\n* Conduct regression testing for new features and production hotfixes.\n* Maintain structured bug reports and testing documentation.\n* Ensure consistent quality across browsers, devices, and screen sizes.\n* Participate in release readiness checks and quality sign-offs.\n\nPerform thorough manual QA testing across web and mobile (UI, UX, logic, edge cases, responsiveness).\n\nValidate product behavior against specs, designs, and expected user flows.\n\nIdentify, document, and clearly communicate bugs and inconsistencies.\n\nVerify fixes and ensure issues are fully resolved before release.\n\nConduct regression testing for new features and production hotfixes.\n\nMaintain structured bug reports and testing documentation.\n\nEnsure consistent quality across browsers, devices, and screen sizes.\n\nParticipate in release readiness checks and quality sign-offs.\n\n* 2–4 years of experience in manual QA for web or SaaS products.\n* Strong attention to detail with a solid understanding of UX/UI best practices.\n* Experience testing complex user flows and edge cases.\n* Basic understanding of:Browser developer toolsAPIs (request/response basics)Mobile web testing\n* Browser developer tools\n* APIs (request/response basics)\n* Mobile web testing\n* Familiarity with QA and tracking tools (e.g., Notion, JIRA, Trello, plane.so).\n* Clear written and verbal communication, especially when describing issues.\n* Strong sense of ownership and accountability for quality.\n\n2–4 years of experience in manual QA for web or SaaS products.\n\nStrong attention to detail with a solid understanding of UX/UI best practices.\n\nExperience testing complex user flows and edge cases.\n\nBasic understanding of:\n\nBrowser developer tools\n\nAPIs (request/response basics)\n\nMobile web testing\n\nFamiliarity with QA and tracking tools (e.g., Notion, JIRA, Trello, plane.so).\n\nClear written and verbal communication, especially when describing issues.\n\nStrong sense of ownership and accountability for quality.\n\n* Interest in growing into a broader role with responsibility for coordination and delivery.\n* Early experience helping track tasks, follow up on fixes, or support release planning.\n* Familiarity with agile or sprint-based workflows.\n* Experience working closely with designers and engineers throughout feature development.\n* Exposure to consumer-facing products or subscription-based SaaS.\n* Experience testing feature flags, experiments, or A/B tests.\n\nInterest in growing into a broader role with responsibility for coordination and delivery.\n\nEarly experience helping track tasks, follow up on fixes, or support release planning.\n\nFamiliarity with agile or sprint-based workflows.\n\nExperience working closely with designers and engineers throughout feature development.\n\nExposure to consumer-facing products or subscription-based SaaS.\n\nExperience testing feature flags, experiments, or A/B tests.\n\nRuby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.\n\nDiscover the perks of being part of our vibrant team! We offer:\n\n* Remote Work Environment:Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance.\n* Unlimited PTO:Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days.\n* Paid National Holidays:Celebrate and relax on national holidays with paid time off to unwind and recharge.\n* Company-provided MacBook:Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them.\n* Flexible Independent Contractor Agreement:Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here:https://docs.google.com/document/d/1tzxGX4Uu7Ts_HCLFXESKLnKaaBfVCPf1f9AYZPrkjJM/preview\n\n**Remote Work Environment:**\n\n**Unlimited PTO:**\n\n**Paid National Holidays:**\n\n**Company-provided MacBook:**\n\n**Flexible Independent Contractor Agreement:**\n\nBe part of our fast-growing team and seize this excellent opportunity for personal and professional growth!\n\nAfter submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:\n\n* Recruiter Screening (40 minutes)\n* Technical Interview (60 minutes)\n* Final Interview (60 minutes)\n\nRecruiter Screening (40 minutes)\n\nTechnical Interview (60 minutes)\n\nFinal Interview (60 minutes)\n\nAt Ruby Labs, we move fast, aim high, and expect the same from our team. We’re not here to play small—we’re here to build, grow, and win. That means we look for people who are ambitious, driven, and ready to give their best every single day.\n\nThis is a place for individuals who thrive under pressure, embrace challenges, and see opportunity in every obstacle. If you’re hungry to achieve, motivated by impact, and want to grow at the speed of your own ambition, Ruby Labs offers the platform to make it happen.\n\nHere, effort is matched with reward. We recognize those who go all in and deliver results, and we create space for people who want more—more responsibility, more growth, and more success.\n\n#LI-Remote",
    "apply_link": "https://jobs.ashbyhq.com/ruby-labs/c5c0357b-f725-46d9-ab20-1792632c0325",
    "published_date": "January 1, 2026"
  },
  {
    "title": "QA",
    "company": "Ruby Labs",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at:\nhttps://rubylabs.com/about-us/\n\nWe’re looking for a hands-on Quality Assurance Engineer with strong manual testing experience to ensure our products meet the highest quality standards before release.\n\nYou’ll be responsible for validating functionality, UX/UI consistency, edge cases, and overall product stability across web and mobile environments. You’ll work closely with product, design, and engineering teams and play a key role in making sure features are ready for release from a quality standpoint.\n\nOver time, this role offers an opportunity to grow beyond pure QA and take on more responsibility around coordination, execution, and delivery ownership.\n\n* Perform thorough manual QA testing across web and mobile (UI, UX, logic, edge cases, responsiveness).\n* Validate product behavior against specs, designs, and expected user flows.\n* Identify, document, and clearly communicate bugs and inconsistencies.\n* Verify fixes and ensure issues are fully resolved before release.\n* Conduct regression testing for new features and production hotfixes.\n* Maintain structured bug reports and testing documentation.\n* Ensure consistent quality across browsers, devices, and screen sizes.\n* Participate in release readiness checks and quality sign-offs.\n\nPerform thorough manual QA testing across web and mobile (UI, UX, logic, edge cases, responsiveness).\n\nValidate product behavior against specs, designs, and expected user flows.\n\nIdentify, document, and clearly communicate bugs and inconsistencies.\n\nVerify fixes and ensure issues are fully resolved before release.\n\nConduct regression testing for new features and production hotfixes.\n\nMaintain structured bug reports and testing documentation.\n\nEnsure consistent quality across browsers, devices, and screen sizes.\n\nParticipate in release readiness checks and quality sign-offs.\n\n* 2–4 years of experience in manual QA for web or SaaS products.\n* Strong attention to detail with a solid understanding of UX/UI best practices.\n* Experience testing complex user flows and edge cases.\n* Basic understanding of:Browser developer toolsAPIs (request/response basics)Mobile web testing\n* Browser developer tools\n* APIs (request/response basics)\n* Mobile web testing\n* Familiarity with QA and tracking tools (e.g., Notion, JIRA, Trello, plane.so).\n* Clear written and verbal communication, especially when describing issues.\n* Strong sense of ownership and accountability for quality.\n\n2–4 years of experience in manual QA for web or SaaS products.\n\nStrong attention to detail with a solid understanding of UX/UI best practices.\n\nExperience testing complex user flows and edge cases.\n\nBasic understanding of:\n\nBrowser developer tools\n\nAPIs (request/response basics)\n\nMobile web testing\n\nFamiliarity with QA and tracking tools (e.g., Notion, JIRA, Trello, plane.so).\n\nClear written and verbal communication, especially when describing issues.\n\nStrong sense of ownership and accountability for quality.\n\n* Interest in growing into a broader role with responsibility for coordination and delivery.\n* Early experience helping track tasks, follow up on fixes, or support release planning.\n* Familiarity with agile or sprint-based workflows.\n* Experience working closely with designers and engineers throughout feature development.\n* Exposure to consumer-facing products or subscription-based SaaS.\n* Experience testing feature flags, experiments, or A/B tests.\n\nInterest in growing into a broader role with responsibility for coordination and delivery.\n\nEarly experience helping track tasks, follow up on fixes, or support release planning.\n\nFamiliarity with agile or sprint-based workflows.\n\nExperience working closely with designers and engineers throughout feature development.\n\nExposure to consumer-facing products or subscription-based SaaS.\n\nExperience testing feature flags, experiments, or A/B tests.\n\nRuby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.\n\nDiscover the perks of being part of our vibrant team! We offer:\n\n* Remote Work Environment:Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance.\n* Unlimited PTO:Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days.\n* Paid National Holidays:Celebrate and relax on national holidays with paid time off to unwind and recharge.\n* Company-provided MacBook:Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them.\n* Flexible Independent Contractor Agreement:Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here:https://docs.google.com/document/d/1tzxGX4Uu7Ts_HCLFXESKLnKaaBfVCPf1f9AYZPrkjJM/preview\n\n**Remote Work Environment:**\n\n**Unlimited PTO:**\n\n**Paid National Holidays:**\n\n**Company-provided MacBook:**\n\n**Flexible Independent Contractor Agreement:**\n\nBe part of our fast-growing team and seize this excellent opportunity for personal and professional growth!\n\nAfter submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:\n\n* Recruiter Screening (40 minutes)\n* Technical Interview (60 minutes)\n* Final Interview (60 minutes)\n\nRecruiter Screening (40 minutes)\n\nTechnical Interview (60 minutes)\n\nFinal Interview (60 minutes)\n\nAt Ruby Labs, we move fast, aim high, and expect the same from our team. We’re not here to play small—we’re here to build, grow, and win. That means we look for people who are ambitious, driven, and ready to give their best every single day.\n\nThis is a place for individuals who thrive under pressure, embrace challenges, and see opportunity in every obstacle. If you’re hungry to achieve, motivated by impact, and want to grow at the speed of your own ambition, Ruby Labs offers the platform to make it happen.\n\nHere, effort is matched with reward. We recognize those who go all in and deliver results, and we create space for people who want more—more responsibility, more growth, and more success.\n\n#LI-Remote",
    "apply_link": "https://jobs.ashbyhq.com/ruby-labs/d751e8a6-2640-4c5b-a8b3-126f77666301",
    "published_date": "January 1, 2026"
  },
  {
    "title": "QA",
    "company": "Ruby Labs",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at:\nhttps://rubylabs.com/about-us/\n\nWe’re looking for a hands-on Quality Assurance Engineer with strong manual testing experience to ensure our products meet the highest quality standards before release.\n\nYou’ll be responsible for validating functionality, UX/UI consistency, edge cases, and overall product stability across web and mobile environments. You’ll work closely with product, design, and engineering teams and play a key role in making sure features are ready for release from a quality standpoint.\n\nOver time, this role offers an opportunity to grow beyond pure QA and take on more responsibility around coordination, execution, and delivery ownership.\n\n* Perform thorough manual QA testing across web and mobile (UI, UX, logic, edge cases, responsiveness).\n* Validate product behavior against specs, designs, and expected user flows.\n* Identify, document, and clearly communicate bugs and inconsistencies.\n* Verify fixes and ensure issues are fully resolved before release.\n* Conduct regression testing for new features and production hotfixes.\n* Maintain structured bug reports and testing documentation.\n* Ensure consistent quality across browsers, devices, and screen sizes.\n* Participate in release readiness checks and quality sign-offs.\n\nPerform thorough manual QA testing across web and mobile (UI, UX, logic, edge cases, responsiveness).\n\nValidate product behavior against specs, designs, and expected user flows.\n\nIdentify, document, and clearly communicate bugs and inconsistencies.\n\nVerify fixes and ensure issues are fully resolved before release.\n\nConduct regression testing for new features and production hotfixes.\n\nMaintain structured bug reports and testing documentation.\n\nEnsure consistent quality across browsers, devices, and screen sizes.\n\nParticipate in release readiness checks and quality sign-offs.\n\n* 2–4 years of experience in manual QA for web or SaaS products.\n* Strong attention to detail with a solid understanding of UX/UI best practices.\n* Experience testing complex user flows and edge cases.\n* Basic understanding of:Browser developer toolsAPIs (request/response basics)Mobile web testing\n* Browser developer tools\n* APIs (request/response basics)\n* Mobile web testing\n* Familiarity with QA and tracking tools (e.g., Notion, JIRA, Trello, plane.so).\n* Clear written and verbal communication, especially when describing issues.\n* Strong sense of ownership and accountability for quality.\n\n2–4 years of experience in manual QA for web or SaaS products.\n\nStrong attention to detail with a solid understanding of UX/UI best practices.\n\nExperience testing complex user flows and edge cases.\n\nBasic understanding of:\n\nBrowser developer tools\n\nAPIs (request/response basics)\n\nMobile web testing\n\nFamiliarity with QA and tracking tools (e.g., Notion, JIRA, Trello, plane.so).\n\nClear written and verbal communication, especially when describing issues.\n\nStrong sense of ownership and accountability for quality.\n\n* Interest in growing into a broader role with responsibility for coordination and delivery.\n* Early experience helping track tasks, follow up on fixes, or support release planning.\n* Familiarity with agile or sprint-based workflows.\n* Experience working closely with designers and engineers throughout feature development.\n* Exposure to consumer-facing products or subscription-based SaaS.\n* Experience testing feature flags, experiments, or A/B tests.\n\nInterest in growing into a broader role with responsibility for coordination and delivery.\n\nEarly experience helping track tasks, follow up on fixes, or support release planning.\n\nFamiliarity with agile or sprint-based workflows.\n\nExperience working closely with designers and engineers throughout feature development.\n\nExposure to consumer-facing products or subscription-based SaaS.\n\nExperience testing feature flags, experiments, or A/B tests.\n\nRuby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.\n\nDiscover the perks of being part of our vibrant team! We offer:\n\n* Remote Work Environment:Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance.\n* Unlimited PTO:Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days.\n* Paid National Holidays:Celebrate and relax on national holidays with paid time off to unwind and recharge.\n* Company-provided MacBook:Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them.\n* Flexible Independent Contractor Agreement:Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here:https://docs.google.com/document/d/1tzxGX4Uu7Ts_HCLFXESKLnKaaBfVCPf1f9AYZPrkjJM/preview\n\n**Remote Work Environment:**\n\n**Unlimited PTO:**\n\n**Paid National Holidays:**\n\n**Company-provided MacBook:**\n\n**Flexible Independent Contractor Agreement:**\n\nBe part of our fast-growing team and seize this excellent opportunity for personal and professional growth!\n\nAfter submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:\n\n* Recruiter Screening (40 minutes)\n* Technical Interview (60 minutes)\n* Final Interview (60 minutes)\n\nRecruiter Screening (40 minutes)\n\nTechnical Interview (60 minutes)\n\nFinal Interview (60 minutes)\n\nAt Ruby Labs, we move fast, aim high, and expect the same from our team. We’re not here to play small—we’re here to build, grow, and win. That means we look for people who are ambitious, driven, and ready to give their best every single day.\n\nThis is a place for individuals who thrive under pressure, embrace challenges, and see opportunity in every obstacle. If you’re hungry to achieve, motivated by impact, and want to grow at the speed of your own ambition, Ruby Labs offers the platform to make it happen.\n\nHere, effort is matched with reward. We recognize those who go all in and deliver results, and we create space for people who want more—more responsibility, more growth, and more success.\n\n#LI-Remote",
    "apply_link": "https://jobs.ashbyhq.com/ruby-labs/9e59db6c-df3d-494f-a0b9-93c09b290d8e",
    "published_date": "January 1, 2026"
  },
  {
    "title": "QA",
    "company": "Ruby Labs",
    "country": "Ukraine, Europe",
    "salary": "Undisclosed",
    "tags": "",
    "description": "Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at:\nhttps://rubylabs.com/about-us/\n\nWe’re looking for a hands-on Quality Assurance Engineer with strong manual testing experience to ensure our products meet the highest quality standards before release.\n\nYou’ll be responsible for validating functionality, UX/UI consistency, edge cases, and overall product stability across web and mobile environments. You’ll work closely with product, design, and engineering teams and play a key role in making sure features are ready for release from a quality standpoint.\n\nOver time, this role offers an opportunity to grow beyond pure QA and take on more responsibility around coordination, execution, and delivery ownership.\n\n* Perform thorough manual QA testing across web and mobile (UI, UX, logic, edge cases, responsiveness).\n* Validate product behavior against specs, designs, and expected user flows.\n* Identify, document, and clearly communicate bugs and inconsistencies.\n* Verify fixes and ensure issues are fully resolved before release.\n* Conduct regression testing for new features and production hotfixes.\n* Maintain structured bug reports and testing documentation.\n* Ensure consistent quality across browsers, devices, and screen sizes.\n* Participate in release readiness checks and quality sign-offs.\n\nPerform thorough manual QA testing across web and mobile (UI, UX, logic, edge cases, responsiveness).\n\nValidate product behavior against specs, designs, and expected user flows.\n\nIdentify, document, and clearly communicate bugs and inconsistencies.\n\nVerify fixes and ensure issues are fully resolved before release.\n\nConduct regression testing for new features and production hotfixes.\n\nMaintain structured bug reports and testing documentation.\n\nEnsure consistent quality across browsers, devices, and screen sizes.\n\nParticipate in release readiness checks and quality sign-offs.\n\n* 2–4 years of experience in manual QA for web or SaaS products.\n* Strong attention to detail with a solid understanding of UX/UI best practices.\n* Experience testing complex user flows and edge cases.\n* Basic understanding of:Browser developer toolsAPIs (request/response basics)Mobile web testing\n* Browser developer tools\n* APIs (request/response basics)\n* Mobile web testing\n* Familiarity with QA and tracking tools (e.g., Notion, JIRA, Trello, plane.so).\n* Clear written and verbal communication, especially when describing issues.\n* Strong sense of ownership and accountability for quality.\n\n2–4 years of experience in manual QA for web or SaaS products.\n\nStrong attention to detail with a solid understanding of UX/UI best practices.\n\nExperience testing complex user flows and edge cases.\n\nBasic understanding of:\n\nBrowser developer tools\n\nAPIs (request/response basics)\n\nMobile web testing\n\nFamiliarity with QA and tracking tools (e.g., Notion, JIRA, Trello, plane.so).\n\nClear written and verbal communication, especially when describing issues.\n\nStrong sense of ownership and accountability for quality.\n\n* Interest in growing into a broader role with responsibility for coordination and delivery.\n* Early experience helping track tasks, follow up on fixes, or support release planning.\n* Familiarity with agile or sprint-based workflows.\n* Experience working closely with designers and engineers throughout feature development.\n* Exposure to consumer-facing products or subscription-based SaaS.\n* Experience testing feature flags, experiments, or A/B tests.\n\nInterest in growing into a broader role with responsibility for coordination and delivery.\n\nEarly experience helping track tasks, follow up on fixes, or support release planning.\n\nFamiliarity with agile or sprint-based workflows.\n\nExperience working closely with designers and engineers throughout feature development.\n\nExposure to consumer-facing products or subscription-based SaaS.\n\nExperience testing feature flags, experiments, or A/B tests.\n\nRuby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.\n\nDiscover the perks of being part of our vibrant team! We offer:\n\n* Remote Work Environment:Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance.\n* Unlimited PTO:Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days.\n* Paid National Holidays:Celebrate and relax on national holidays with paid time off to unwind and recharge.\n* Company-provided MacBook:Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them.\n* Flexible Independent Contractor Agreement:Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here:https://docs.google.com/document/d/1tzxGX4Uu7Ts_HCLFXESKLnKaaBfVCPf1f9AYZPrkjJM/preview\n\n**Remote Work Environment:**\n\n**Unlimited PTO:**\n\n**Paid National Holidays:**\n\n**Company-provided MacBook:**\n\n**Flexible Independent Contractor Agreement:**\n\nBe part of our fast-growing team and seize this excellent opportunity for personal and professional growth!\n\nAfter submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:\n\n* Recruiter Screening (40 minutes)\n* Technical Interview (60 minutes)\n* Final Interview (60 minutes)\n\nRecruiter Screening (40 minutes)\n\nTechnical Interview (60 minutes)\n\nFinal Interview (60 minutes)\n\nAt Ruby Labs, we move fast, aim high, and expect the same from our team. We’re not here to play small—we’re here to build, grow, and win. That means we look for people who are ambitious, driven, and ready to give their best every single day.\n\nThis is a place for individuals who thrive under pressure, embrace challenges, and see opportunity in every obstacle. If you’re hungry to achieve, motivated by impact, and want to grow at the speed of your own ambition, Ruby Labs offers the platform to make it happen.\n\nHere, effort is matched with reward. We recognize those who go all in and deliver results, and we create space for people who want more—more responsibility, more growth, and more success.\n\n#LI-Remote",
    "apply_link": "https://jobs.ashbyhq.com/ruby-labs/3774f37a-104b-4358-acaf-d3d051a3bb6b",
    "published_date": "January 1, 2026"
  },
  {
    "title": "N8N Automation Engineer",
    "company": "Newxel",
    "country": "Ukraine, Europe",
    "salary": "Undisclosed",
    "tags": "Docker, Microservices, Git, Python, SQL, PostgreSQL, ETL, LLM",
    "description": "We’re seeking a Middle / Senior Automation Engineer to architect and implement intelligent, scalable systems that power automation, data integration, and AI workflows across our operations. This role combines hands-on development with strategic solution design – ideal for someone who thrives in dynamic environments, enjoys working across modern tech stacks (Python, n8n, LLMs, cloud, vector DBs), and can lead complex integrations across platforms like HubSpot, Ashby, and more.\n\n* Automation & Workflow OrchestrationBuild and maintain low-code/no-code workflows usingn8nIntegrateAI agents (e.g., RAG pipelines)and custom logic into automated processesDesign and optimizeprompt engineering strategiesfor LLM interactions\n* Build and maintain low-code/no-code workflows usingn8n\n* IntegrateAI agents (e.g., RAG pipelines)and custom logic into automated processes\n* Design and optimizeprompt engineering strategiesfor LLM interactions\n* Backend & Microservices DevelopmentDevelop lightweight, scalablemicroservices in Pythonfor data processing and system integrationImplement secure and reusable APIs to support automation and internal tools\n* Develop lightweight, scalablemicroservices in Pythonfor data processing and system integration\n* Implement secure and reusable APIs to support automation and internal tools\n* Database Engineering & ManagementSet up and administerPostgreSQLdatabases for workflow automation and microservicesWork withvector databases(e.g., Pinecone, Weaviate, Qdrant, pgvector) to support AI agents and RAG applications\n* Set up and administerPostgreSQLdatabases for workflow automation and microservices\n* Work withvector databases(e.g., Pinecone, Weaviate, Qdrant, pgvector) to support AI agents and RAG applications\n* Solution ArchitectureTranslate business needs into scalable architecture and technical designsSelect appropriate technologies, patterns, and tools for building maintainable and cost-effective systemsLead technical solution design for integrations between various tools and platforms.\n* Translate business needs into scalable architecture and technical designs\n* Select appropriate technologies, patterns, and tools for building maintainable and cost-effective systems\n* Lead technical solution design for integrations between various tools and platforms.\n\n**Automation & Workflow Orchestration**\n\n**n8n**\n\n**AI agents (e.g., RAG pipelines)**\n\n**prompt engineering strategies**\n\n**Backend & Microservices Development**\n\n**microservices in Python**\n\nImplement secure and reusable APIs to support automation and internal tools\n\n**Database Engineering & Management**\n\n**PostgreSQL**\n\n**vector databases**\n\n**Solution Architecture**\n\nTranslate business needs into scalable architecture and technical designs\n\nSelect appropriate technologies, patterns, and tools for building maintainable and cost-effective systems\n\nLead technical solution design for integrations between various tools and platforms.\n\n**Hard Skills**\n\n* Hands-on experience withn8n, or similar workflow automation platforms. Understanding of No-Code platforms, process analysis, workflow design, and system monitoring\n* Deep understanding of data warehousing concepts and ETL processes\n* Experience withRESTful APIs, OAuth, and data transformation techniques (e.g., pandas, SQL, JSON)\n* Deep knowledge ofrelational data baseadministration and performance tuning\n* Familiarity withvector databasesand embeddings for AI-powered applications\n\n**n8n**\n\nDeep understanding of data warehousing concepts and ETL processes\n\n**RESTful APIs, OAuth**\n\n**relational data base**\n\n**vector databases**\n\n**Soft Skills**\n\n* Self-driven andcomfortable operating without detailed specifications\n* Excellent problem-solving and troubleshooting abilities\n* Strong communication skills and ability tocollaborate in cross-functional teams\n* Ateam playerwho proactively shares knowledge and mentors others\n* English – Ability to read technical and product documentation\n\n**comfortable operating without detailed specifications**\n\nExcellent problem-solving and troubleshooting abilities\n\n**collaborate in cross-functional teams**\n\n**team player**\n\nEnglish – Ability to read technical and product documentation\n\n* Practical understanding ofLLMworkflows, including RAG architecture and vector search. RAG fine tuning\n* Familiarity withCI/CDand Git-based development workflows\n* Experience withevent-driven architectureor messaging systems (e.g., Pub/Sub, Kafka)\n* Knowledge ofPythonfor backend and data engineering tasks\n* Experience integrating withHubSpot, Ashby, or similar recruiting/CRM systems via APIs\n* Working knowledge ofcloud platformsand deployment (e.g., Cloud Run, Lambda, or Docker containers)\n\n**LLM**\n\n**CI/CD**\n\n**event-driven architecture**\n\n**Python**\n\n**HubSpot, Ashby**\n\n**cloud platforms**\n\n* Competitive salary and benefits package\n* Medical insurance\n* Tax compensation\n* Hybrid-friendly workplace: modern office in Kyiv and remote flexibility\n* Paid Vacations, Sick leaves\n* Career growth and development opportunities\n* A chance to work with a talented and driven team of professional\n\nCompetitive salary and benefits package\n\nMedical insurance\n\nTax compensation\n\nHybrid-friendly workplace: modern office in Kyiv and remote flexibility\n\nPaid Vacations, Sick leaves\n\nCareer growth and development opportunities\n\nA chance to work with a talented and driven team of professional\n\nNewxel helps companies around the world build dedicated development teams in Ukraine and beyond. With 260+ specialists, we offer not just staffing, but a strategic partnership model — where long-term success depends on how well we manage, support, and grow the people we work with. We’re not fans of bureaucracy, and we don’t believe in micromanagement. We prefer clear processes, mutual respect, and solving problems together. You’ll join a team that’s smart, steady, and always looking to do better.",
    "apply_link": "https://jobs.ashbyhq.com/newxel/82f264d5-ba03-48a2-b25d-6a8203326984",
    "published_date": "January 1, 2026"
  },
  {
    "title": "QA Engineer",
    "company": "Lingokids",
    "country": "Spain, Europe",
    "salary": "Undisclosed",
    "tags": "JavaScript",
    "description": "Lingokids is looking for QA Engineer",
    "apply_link": "https://jobs.lingokids.com/jobs/6988701-qa-engineer",
    "published_date": "January 1, 2026"
  },
  {
    "title": "Quality Assurance Automation Engineer",
    "company": "Devoteam",
    "country": "Portugal, Europe",
    "salary": "Undisclosed",
    "tags": "Git, Selenium, Playwright, SQL",
    "description": "At Devoteam, we believe that technology with strong human values can actively drive change for the better. Discover how Tech for People unlocks the future, creating a positive impact on the people and the world around us. We are a global leading player in Digital Transformation for leading organisations across EMEA, with a revenue of €1B. We believe in transforming technology to create value for our clients, partners and employees in a world where technology is developed for people. We are proud of the culture we have built together. We are proud of our people at the service of technology. We are proud of our diverse environment. Because we are #TechforPeople. Join our multidisciplinary team of Cloud experts, Designers, Business consultants, Security experts, Engineers, Developers and other extraordinary talents, spread across more than 20 EMEA countries. Become one of our +10.000 tech and business leaders on cloud, data and cyber security. Let’s fuse creativity with technology together and build innovative solutions that actively change things for the better.\n\n### Job Description\n\n* Review user stories and acceptance criteria in order to develop effective test plans and both manual and automated tests cases in collaboration with the development team.\n* Participate actively in scrum ceremonies in order to distribute test cases according to the test pyramid.\n* Estimate, prioritize, plan and coordinate testing activities.\n* Responsible for the STLC of new features on testing suites, taking technical ownership to ensure timely and quality delivery.\n* Researching test tools, methodologies, and trends and upgrading existing practices and processes.\n\n### Qualifications\n\n* BS/MS degree in Computer Science/Software Engineering or an IT related discipline:\n* 4+ years of experience as a Software Development Engineer in Test;\n* Hands on experience in OOP languages (C#);\n* Strong knowledge of software QA methodologies, tools and processes;\n* Hands-on experience with web browser automation tools (e.g. Selenium / Playwright);\n* Good understanding of all levels of the testing pyramid;\n* Experience in defect tracking and test management tools such as JIRA, X-Ray, etc;\n* Familiarity with relational database engines (SQL);\n* Experience working with Agile/Scrum software development methodology;\n* Fluent communication skills in English (both written & verbal);\n\n### Additional Information\n\nDevoteam Group works for equal opportunities, promoting its employees based on merit and actively fights against all forms of discrimination. We are convinced that diversity contributes to the creativity, dynamism and excellence of our organization. All of our vacancies are open to people with disabilities.\n\n### Job Location",
    "apply_link": "https://jobs.smartrecruiters.com/devoteam/744000100872955-gambling-sector-quality-assurance-automation-engineer",
    "published_date": "January 1, 2026"
  },
  {
    "title": "Manual QA Engineer, Android",
    "company": "BetterMe",
    "country": "Ukraine, Europe",
    "salary": "Undisclosed",
    "tags": "Android, Postman",
    "description": "**Про компанію:** \n\n**Що для цього тобі знадобиться:**\n\n* Принаймні 2+ роки досвіду Manual QA;\n* Мінімум останній 1 рік досвіду тестування Android-додатків;\n* Можливість використання Android Studio (читання та аналіз логів);\n* Досвід роботи з web debugging proxy додатками (Charles);\n* Хороші знання і розуміння методологій і практик тестування;\n* Експертиза в аналізі вимог до програмного забезпечення;\n* Вміння самостійно ставити завдання та ефективно організовувати власну роботу;\n* Орієнтованість на результат та уважність до деталей;\n* Швидке сприйняття нові ідеї та концепції;\n* Вміння викладати ідеї мовою, зручною для бізнесу та користувача.\n\n**Буде круто, якщо ти маєш:**\n\n* Досвід тестування legal compliance (e.g. GDPR);\n* Знання і практичний досвід з тестуванням back-end (використання Postman, Swagger, REST);\n* Досвід тестування мобільних підписок;\n* Досвід роботи та аналіз даних систем аналітики.\n\n**Твої майбутні задачі:**\n\n* Ручне тестування Android-додатків;\n* Створення та підтримка чинної тестової документації;\n* Активна участь у процесі розробки.",
    "apply_link": "https://betterme.breezy.hr/p/ce22fc41edb1-manual-qa-engineer-android",
    "published_date": "January 1, 2026"
  },
  {
    "title": "Senior Manual QA Engineer – Freelance",
    "company": "Altamira",
    "country": "Europe",
    "salary": "Undisclosed",
    "tags": "RSpec, SQL, Postman",
    "description": "Altamira is a software development outsourcing company. We provide solutions that make a tangible impact on our client’s growth and productivity. With domain knowledge across product and technology development, we aim to provide cost-efficient solutions without compromising quality. We are driven to deliver the best, every single time.\n\nAltamira service delivery teams currently span Slovakia, Ukraine, and the Middle East, and we have ambitions to expand our footprint to meet the growing demand across Europe and into our primary growth markets in the UK and the US. In terms of industry verticals, we are focused on EdTech, Fintech, eCommerce, and Pharma.\n\nWe are looking for a\n**Manual QA Engineer** **full-time, 3-month assignment**\n\n### Responsibilities\n\n* Validate product features from an end-user perspective, ensuring usability, accessibility, and functional accuracy\n* Design, document, and execute manual test cases for web applications\n* Perform API testing using Postman and Swagger, validating request/response payloads and integration points\n* Write and execute SQL queries to verify data correctness and support backend troubleshooting\n* Collaborate with product and development teams to maintain accurate product documentation and test coverage\n* Work closely with developers throughout the build cycle to confirm requirements and identify edge cases early\n* Identify, log, prioritize, and track defects; provide structured bug reports with clear reproduction steps\n* Proactively suggest improvements to QA processes, testing efficiency, and overall product quality\n\n### Requirements\n\n* 3–4 years of experience in manual QA or software testing, preferably within product-focused teams\n* Strong understanding of Client–Server Architecture, HTTP methods, request/response cycles, and status codes\n* Hands-on experience with Postman (collections, scripts, automation) and familiarity with Swagger/OpenAPI\n* Working knowledge of SQL for querying databases and validating backend data\n* Experience with test case management tools such as TestRail or Zephyr\n* Familiarity with bug tracking systems such as Jira or YouTrack\n* Strong knowledge of QA methodologies, SDLC, and Agile development processes\n* Ability to create and maintain clear product documentation, including feature flows and edge cases\n* Comfort working in a fast-paced environment with shifting priorities\n* Excellent written and verbal communication skills; ability to articulate issues clearly and work effectively across teams\n* Product-oriented mindset with attention to detail and user experience\n* English level: Upper-Intermediate or higher\n\n**Our transparent recruitment journey usually takes up to 2 weeks and includes a few stages:**\n\n#### We offer:\n\n* Competitive salary, room for development and growth.\n* Possibility to work in the Bratislava and Kyiv offices or fully remotely.\n* Loyal management, interesting tasks, constant support.\n* Medical insurance (optional).\n* English courses.\n* Technical equipment providing.\n* Paid vacations 20 workdays, paid sick leave, regular salary reviews;\n* Flexible schedule and ability to manage your working hours;\n* Support your personal growth and skills upgrading.\n* The great environment inside the team, support of initiatives, and ability to contribute to the common goal.\n\nWe do believe that the success of\naltamira.ai\nis impossible without the success of our Talents and the success of our Clients!",
    "apply_link": "https://boards.greenhouse.io/altamiratechnologies/jobs/4745891101",
    "published_date": "January 1, 2026"
  }
]